MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// Register: PIR5
#define PIR5 PIR5
extern volatile unsigned char           PIR5                __at(0x015);
#ifndef _LIB_BUILD
asm("PIR5 equ 015h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C5IF                   :1;
        unsigned C6IF                   :1;
        unsigned C7IF                   :1;
        unsigned C8IF                   :1;
        unsigned COG3IF                 :1;
        unsigned COG4IF                 :1;
        unsigned CCP7IF                 :1;
        unsigned CCP8IF                 :1;
    };
} PIR5bits_t;
extern volatile PIR5bits_t PIR5bits __at(0x015);
// bitfield macros
#define _PIR5_C5IF_POSN                                     0x0
#define _PIR5_C5IF_POSITION                                 0x0
#define _PIR5_C5IF_SIZE                                     0x1
#define _PIR5_C5IF_LENGTH                                   0x1
#define _PIR5_C5IF_MASK                                     0x1
#define _PIR5_C6IF_POSN                                     0x1
#define _PIR5_C6IF_POSITION                                 0x1
#define _PIR5_C6IF_SIZE                                     0x1
#define _PIR5_C6IF_LENGTH                                   0x1
#define _PIR5_C6IF_MASK                                     0x2
#define _PIR5_C7IF_POSN                                     0x2
#define _PIR5_C7IF_POSITION                                 0x2
#define _PIR5_C7IF_SIZE                                     0x1
#define _PIR5_C7IF_LENGTH                                   0x1
#define _PIR5_C7IF_MASK                                     0x4
#define _PIR5_C8IF_POSN                                     0x3
#define _PIR5_C8IF_POSITION                                 0x3
#define _PIR5_C8IF_SIZE                                     0x1
#define _PIR5_C8IF_LENGTH                                   0x1
#define _PIR5_C8IF_MASK                                     0x8
#define _PIR5_COG3IF_POSN                                   0x4
#define _PIR5_COG3IF_POSITION                               0x4
#define _PIR5_COG3IF_SIZE                                   0x1
#define _PIR5_COG3IF_LENGTH                                 0x1
#define _PIR5_COG3IF_MASK                                   0x10
#define _PIR5_COG4IF_POSN                                   0x5
#define _PIR5_COG4IF_POSITION                               0x5
#define _PIR5_COG4IF_SIZE                                   0x1
#define _PIR5_COG4IF_LENGTH                                 0x1
#define _PIR5_COG4IF_MASK                                   0x20
#define _PIR5_CCP7IF_POSN                                   0x6
#define _PIR5_CCP7IF_POSITION                               0x6
#define _PIR5_CCP7IF_SIZE                                   0x1
#define _PIR5_CCP7IF_LENGTH                                 0x1
#define _PIR5_CCP7IF_MASK                                   0x40
#define _PIR5_CCP8IF_POSN                                   0x7
#define _PIR5_CCP8IF_POSITION                               0x7
#define _PIR5_CCP8IF_SIZE                                   0x1
#define _PIR5_CCP8IF_LENGTH                                 0x1
#define _PIR5_CCP8IF_MASK                                   0x80

// Register: PIR6
#define PIR6 PIR6
extern volatile unsigned char           PIR6                __at(0x016);
#ifndef _LIB_BUILD
asm("PIR6 equ 016h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM5IF                 :1;
        unsigned PWM6IF                 :1;
        unsigned PWM11IF                :1;
        unsigned PWM12IF                :1;
    };
} PIR6bits_t;
extern volatile PIR6bits_t PIR6bits __at(0x016);
// bitfield macros
#define _PIR6_PWM5IF_POSN                                   0x0
#define _PIR6_PWM5IF_POSITION                               0x0
#define _PIR6_PWM5IF_SIZE                                   0x1
#define _PIR6_PWM5IF_LENGTH                                 0x1
#define _PIR6_PWM5IF_MASK                                   0x1
#define _PIR6_PWM6IF_POSN                                   0x1
#define _PIR6_PWM6IF_POSITION                               0x1
#define _PIR6_PWM6IF_SIZE                                   0x1
#define _PIR6_PWM6IF_LENGTH                                 0x1
#define _PIR6_PWM6IF_MASK                                   0x2
#define _PIR6_PWM11IF_POSN                                  0x2
#define _PIR6_PWM11IF_POSITION                              0x2
#define _PIR6_PWM11IF_SIZE                                  0x1
#define _PIR6_PWM11IF_LENGTH                                0x1
#define _PIR6_PWM11IF_MASK                                  0x4
#define _PIR6_PWM12IF_POSN                                  0x3
#define _PIR6_PWM12IF_POSITION                              0x3
#define _PIR6_PWM12IF_SIZE                                  0x1
#define _PIR6_PWM12IF_LENGTH                                0x1
#define _PIR6_PWM12IF_MASK                                  0x8

// Register: TMR0
#define TMR0 TMR0
extern volatile unsigned char           TMR0                __at(0x017);
#ifndef _LIB_BUILD
asm("TMR0 equ 017h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0                   :8;
    };
} TMR0bits_t;
extern volatile TMR0bits_t TMR0bits __at(0x017);
// bitfield macros
#define _TMR0_TMR0_POSN                                     0x0
#define _TMR0_TMR0_POSITION                                 0x0
#define _TMR0_TMR0_SIZE                                     0x8
#define _TMR0_TMR0_LENGTH                                   0x8
#define _TMR0_TMR0_MASK                                     0xFF

// Register: TMR1
#define TMR1 TMR1
extern volatile unsigned short          TMR1                __at(0x018);
#ifndef _LIB_BUILD
asm("TMR1 equ 018h");
#endif

// Register: TMR1L
#define TMR1L TMR1L
extern volatile unsigned char           TMR1L               __at(0x018);
#ifndef _LIB_BUILD
asm("TMR1L equ 018h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
} TMR1Lbits_t;
extern volatile TMR1Lbits_t TMR1Lbits __at(0x018);
// bitfield macros
#define _TMR1L_TMR_POSN                                     0x0
#define _TMR1L_TMR_POSITION                                 0x0
#define _TMR1L_TMR_SIZE                                     0x8
#define _TMR1L_TMR_LENGTH                                   0x8
#define _TMR1L_TMR_MASK                                     0xFF

// Register: TMR1H
#define TMR1H TMR1H
extern volatile unsigned char           TMR1H               __at(0x019);
#ifndef _LIB_BUILD
asm("TMR1H equ 019h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR                    :8;
    };
} TMR1Hbits_t;
extern volatile TMR1Hbits_t TMR1Hbits __at(0x019);
// bitfield macros
#define _TMR1H_TMR_POSN                                     0x0
#define _TMR1H_TMR_POSITION                                 0x0
#define _TMR1H_TMR_SIZE                                     0x8
#define _TMR1H_TMR_LENGTH                                   0x8
#define _TMR1H_TMR_MASK                                     0xFF

