MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// Register: PIE4
#define PIE4 PIE4
extern volatile unsigned char           PIE4                __at(0x094);
#ifndef _LIB_BUILD
asm("PIE4 equ 094h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR4IE                 :1;
        unsigned TMR6IE                 :1;
        unsigned TMR3IE                 :1;
        unsigned TMR3GIE                :1;
        unsigned TMR5IE                 :1;
        unsigned TMR5GIE                :1;
        unsigned TMR8IE                 :1;
    };
} PIE4bits_t;
extern volatile PIE4bits_t PIE4bits __at(0x094);
// bitfield macros
#define _PIE4_TMR4IE_POSN                                   0x0
#define _PIE4_TMR4IE_POSITION                               0x0
#define _PIE4_TMR4IE_SIZE                                   0x1
#define _PIE4_TMR4IE_LENGTH                                 0x1
#define _PIE4_TMR4IE_MASK                                   0x1
#define _PIE4_TMR6IE_POSN                                   0x1
#define _PIE4_TMR6IE_POSITION                               0x1
#define _PIE4_TMR6IE_SIZE                                   0x1
#define _PIE4_TMR6IE_LENGTH                                 0x1
#define _PIE4_TMR6IE_MASK                                   0x2
#define _PIE4_TMR3IE_POSN                                   0x2
#define _PIE4_TMR3IE_POSITION                               0x2
#define _PIE4_TMR3IE_SIZE                                   0x1
#define _PIE4_TMR3IE_LENGTH                                 0x1
#define _PIE4_TMR3IE_MASK                                   0x4
#define _PIE4_TMR3GIE_POSN                                  0x3
#define _PIE4_TMR3GIE_POSITION                              0x3
#define _PIE4_TMR3GIE_SIZE                                  0x1
#define _PIE4_TMR3GIE_LENGTH                                0x1
#define _PIE4_TMR3GIE_MASK                                  0x8
#define _PIE4_TMR5IE_POSN                                   0x4
#define _PIE4_TMR5IE_POSITION                               0x4
#define _PIE4_TMR5IE_SIZE                                   0x1
#define _PIE4_TMR5IE_LENGTH                                 0x1
#define _PIE4_TMR5IE_MASK                                   0x10
#define _PIE4_TMR5GIE_POSN                                  0x5
#define _PIE4_TMR5GIE_POSITION                              0x5
#define _PIE4_TMR5GIE_SIZE                                  0x1
#define _PIE4_TMR5GIE_LENGTH                                0x1
#define _PIE4_TMR5GIE_MASK                                  0x20
#define _PIE4_TMR8IE_POSN                                   0x6
#define _PIE4_TMR8IE_POSITION                               0x6
#define _PIE4_TMR8IE_SIZE                                   0x1
#define _PIE4_TMR8IE_LENGTH                                 0x1
#define _PIE4_TMR8IE_MASK                                   0x40

// Register: PIE5
#define PIE5 PIE5
extern volatile unsigned char           PIE5                __at(0x095);
#ifndef _LIB_BUILD
asm("PIE5 equ 095h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C5IE                   :1;
        unsigned C6IE                   :1;
        unsigned C7IE                   :1;
        unsigned C8IE                   :1;
        unsigned COG3IE                 :1;
        unsigned COG4IE                 :1;
        unsigned CCP7IE                 :1;
        unsigned CCP8IE                 :1;
    };
} PIE5bits_t;
extern volatile PIE5bits_t PIE5bits __at(0x095);
// bitfield macros
#define _PIE5_C5IE_POSN                                     0x0
#define _PIE5_C5IE_POSITION                                 0x0
#define _PIE5_C5IE_SIZE                                     0x1
#define _PIE5_C5IE_LENGTH                                   0x1
#define _PIE5_C5IE_MASK                                     0x1
#define _PIE5_C6IE_POSN                                     0x1
#define _PIE5_C6IE_POSITION                                 0x1
#define _PIE5_C6IE_SIZE                                     0x1
#define _PIE5_C6IE_LENGTH                                   0x1
#define _PIE5_C6IE_MASK                                     0x2
#define _PIE5_C7IE_POSN                                     0x2
#define _PIE5_C7IE_POSITION                                 0x2
#define _PIE5_C7IE_SIZE                                     0x1
#define _PIE5_C7IE_LENGTH                                   0x1
#define _PIE5_C7IE_MASK                                     0x4
#define _PIE5_C8IE_POSN                                     0x3
#define _PIE5_C8IE_POSITION                                 0x3
#define _PIE5_C8IE_SIZE                                     0x1
#define _PIE5_C8IE_LENGTH                                   0x1
#define _PIE5_C8IE_MASK                                     0x8
#define _PIE5_COG3IE_POSN                                   0x4
#define _PIE5_COG3IE_POSITION                               0x4
#define _PIE5_COG3IE_SIZE                                   0x1
#define _PIE5_COG3IE_LENGTH                                 0x1
#define _PIE5_COG3IE_MASK                                   0x10
#define _PIE5_COG4IE_POSN                                   0x5
#define _PIE5_COG4IE_POSITION                               0x5
#define _PIE5_COG4IE_SIZE                                   0x1
#define _PIE5_COG4IE_LENGTH                                 0x1
#define _PIE5_COG4IE_MASK                                   0x20
#define _PIE5_CCP7IE_POSN                                   0x6
#define _PIE5_CCP7IE_POSITION                               0x6
#define _PIE5_CCP7IE_SIZE                                   0x1
#define _PIE5_CCP7IE_LENGTH                                 0x1
#define _PIE5_CCP7IE_MASK                                   0x40
#define _PIE5_CCP8IE_POSN                                   0x7
#define _PIE5_CCP8IE_POSITION                               0x7
#define _PIE5_CCP8IE_SIZE                                   0x1
#define _PIE5_CCP8IE_LENGTH                                 0x1
#define _PIE5_CCP8IE_MASK                                   0x80

