MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile SLRCONEbits_t SLRCONEbits __at(0x310);
// bitfield macros
#define _SLRCONE_SLRE0_POSN                                 0x0
#define _SLRCONE_SLRE0_POSITION                             0x0
#define _SLRCONE_SLRE0_SIZE                                 0x1
#define _SLRCONE_SLRE0_LENGTH                               0x1
#define _SLRCONE_SLRE0_MASK                                 0x1
#define _SLRCONE_SLRE1_POSN                                 0x1
#define _SLRCONE_SLRE1_POSITION                             0x1
#define _SLRCONE_SLRE1_SIZE                                 0x1
#define _SLRCONE_SLRE1_LENGTH                               0x1
#define _SLRCONE_SLRE1_MASK                                 0x2
#define _SLRCONE_SLRE2_POSN                                 0x2
#define _SLRCONE_SLRE2_POSITION                             0x2
#define _SLRCONE_SLRE2_SIZE                                 0x1
#define _SLRCONE_SLRE2_LENGTH                               0x1
#define _SLRCONE_SLRE2_MASK                                 0x4

// Register: CCPR8
#define CCPR8 CCPR8
extern volatile unsigned short          CCPR8               __at(0x311);
#ifndef _LIB_BUILD
asm("CCPR8 equ 0311h");
#endif

// Register: CCPR8L
#define CCPR8L CCPR8L
extern volatile unsigned char           CCPR8L              __at(0x311);
#ifndef _LIB_BUILD
asm("CCPR8L equ 0311h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RL                     :8;
    };
} CCPR8Lbits_t;
extern volatile CCPR8Lbits_t CCPR8Lbits __at(0x311);
// bitfield macros
#define _CCPR8L_RL_POSN                                     0x0
#define _CCPR8L_RL_POSITION                                 0x0
#define _CCPR8L_RL_SIZE                                     0x8
#define _CCPR8L_RL_LENGTH                                   0x8
#define _CCPR8L_RL_MASK                                     0xFF

// Register: CCPR8H
#define CCPR8H CCPR8H
extern volatile unsigned char           CCPR8H              __at(0x312);
#ifndef _LIB_BUILD
asm("CCPR8H equ 0312h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH                     :8;
    };
} CCPR8Hbits_t;
extern volatile CCPR8Hbits_t CCPR8Hbits __at(0x312);
// bitfield macros
#define _CCPR8H_RH_POSN                                     0x0
#define _CCPR8H_RH_POSITION                                 0x0
#define _CCPR8H_RH_SIZE                                     0x8
#define _CCPR8H_RH_LENGTH                                   0x8
#define _CCPR8H_RH_MASK                                     0xFF

// Register: CCP8CON
#define CCP8CON CCP8CON
extern volatile unsigned char           CCP8CON             __at(0x313);
#ifndef _LIB_BUILD
asm("CCP8CON equ 0313h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :4;
        unsigned FMT                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
        unsigned MODE3                  :1;
    };
    struct {
        unsigned CCP8MODE               :4;
        unsigned CCP8FMT                :1;
        unsigned CCP8OUT                :1;
        unsigned                        :1;
        unsigned CCP8EN                 :1;
    };
    struct {
        unsigned CCP8MODE0              :1;
        unsigned CCP8MODE1              :1;
        unsigned CCP8MODE2              :1;
        unsigned CCP8MODE3              :1;
    };
} CCP8CONbits_t;
extern volatile CCP8CONbits_t CCP8CONbits __at(0x313);
// bitfield macros
#define _CCP8CON_MODE_POSN                                  0x0
#define _CCP8CON_MODE_POSITION                              0x0
#define _CCP8CON_MODE_SIZE                                  0x4
#define _CCP8CON_MODE_LENGTH                                0x4
#define _CCP8CON_MODE_MASK                                  0xF
#define _CCP8CON_FMT_POSN                                   0x4
#define _CCP8CON_FMT_POSITION                               0x4
#define _CCP8CON_FMT_SIZE                                   0x1
#define _CCP8CON_FMT_LENGTH                                 0x1
#define _CCP8CON_FMT_MASK                                   0x10
#define _CCP8CON_OUT_POSN                                   0x5
#define _CCP8CON_OUT_POSITION                               0x5
#define _CCP8CON_OUT_SIZE                                   0x1
#define _CCP8CON_OUT_LENGTH                                 0x1
#define _CCP8CON_OUT_MASK                                   0x20
#define _CCP8CON_EN_POSN                                    0x7
#define _CCP8CON_EN_POSITION                                0x7
#define _CCP8CON_EN_SIZE                                    0x1
#define _CCP8CON_EN_LENGTH                                  0x1
#define _CCP8CON_EN_MASK                                    0x80
#define _CCP8CON_MODE0_POSN                                 0x0
#define _CCP8CON_MODE0_POSITION                             0x0
#define _CCP8CON_MODE0_SIZE                                 0x1
#define _CCP8CON_MODE0_LENGTH                               0x1
#define _CCP8CON_MODE0_MASK                                 0x1
#define _CCP8CON_MODE1_POSN                                 0x1
#define _CCP8CON_MODE1_POSITION                             0x1
#define _CCP8CON_MODE1_SIZE                                 0x1
#define _CCP8CON_MODE1_LENGTH                               0x1
#define _CCP8CON_MODE1_MASK                                 0x2
#define _CCP8CON_MODE2_POSN                                 0x2
#define _CCP8CON_MODE2_POSITION                             0x2
#define _CCP8CON_MODE2_SIZE                                 0x1
#define _CCP8CON_MODE2_LENGTH                               0x1
#define _CCP8CON_MODE2_MASK                                 0x4
#define _CCP8CON_MODE3_POSN                                 0x3
#define _CCP8CON_MODE3_POSITION                             0x3
#define _CCP8CON_MODE3_SIZE                                 0x1
#define _CCP8CON_MODE3_LENGTH                               0x1
#define _CCP8CON_MODE3_MASK                                 0x8
#define _CCP8CON_CCP8MODE_POSN                              0x0
#define _CCP8CON_CCP8MODE_POSITION                          0x0
#define _CCP8CON_CCP8MODE_SIZE                              0x4
#define _CCP8CON_CCP8MODE_LENGTH                            0x4
#define _CCP8CON_CCP8MODE_MASK                              0xF
#define _CCP8CON_CCP8FMT_POSN                               0x4
#define _CCP8CON_CCP8FMT_POSITION                           0x4
#define _CCP8CON_CCP8FMT_SIZE                               0x1
#define _CCP8CON_CCP8FMT_LENGTH                             0x1
#define _CCP8CON_CCP8FMT_MASK                               0x10
#define _CCP8CON_CCP8OUT_POSN                               0x5
#define _CCP8CON_CCP8OUT_POSITION                           0x5
#define _CCP8CON_CCP8OUT_SIZE                               0x1
#define _CCP8CON_CCP8OUT_LENGTH                             0x1
#define _CCP8CON_CCP8OUT_MASK                               0x20
#define _CCP8CON_CCP8EN_POSN                                0x7
#define _CCP8CON_CCP8EN_POSITION                            0x7
#define _CCP8CON_CCP8EN_SIZE                                0x1
#define _CCP8CON_CCP8EN_LENGTH                              0x1
#define _CCP8CON_CCP8EN_MASK                                0x80
#define _CCP8CON_CCP8MODE0_POSN                             0x0
#define _CCP8CON_CCP8MODE0_POSITION                         0x0
#define _CCP8CON_CCP8MODE0_SIZE                             0x1
#define _CCP8CON_CCP8MODE0_LENGTH                           0x1
#define _CCP8CON_CCP8MODE0_MASK                             0x1
#define _CCP8CON_CCP8MODE1_POSN                             0x1
#define _CCP8CON_CCP8MODE1_POSITION                         0x1
#define _CCP8CON_CCP8MODE1_SIZE                             0x1
#define _CCP8CON_CCP8MODE1_LENGTH                           0x1
#define _CCP8CON_CCP8MODE1_MASK                             0x2
#define _CCP8CON_CCP8MODE2_POSN                             0x2
#define _CCP8CON_CCP8MODE2_POSITION                         0x2
#define _CCP8CON_CCP8MODE2_SIZE                             0x1
#define _CCP8CON_CCP8MODE2_LENGTH                           0x1
#define _CCP8CON_CCP8MODE2_MASK                             0x4
#define _CCP8CON_CCP8MODE3_POSN                             0x3
#define _CCP8CON_CCP8MODE3_POSITION                         0x3
#define _CCP8CON_CCP8MODE3_SIZE                             0x1
#define _CCP8CON_CCP8MODE3_LENGTH                           0x1
#define _CCP8CON_CCP8MODE3_MASK                             0x8

