MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile DAC5CON2bits_t DAC5CON2bits __at(0x59A);
// bitfield macros
#define _DAC5CON2_REF_POSN                                  0x0
#define _DAC5CON2_REF_POSITION                              0x0
#define _DAC5CON2_REF_SIZE                                  0x8
#define _DAC5CON2_REF_LENGTH                                0x8
#define _DAC5CON2_REF_MASK                                  0xFF
#define _DAC5CON2_DAC5REF8_POSN                             0x0
#define _DAC5CON2_DAC5REF8_POSITION                         0x0
#define _DAC5CON2_DAC5REF8_SIZE                             0x1
#define _DAC5CON2_DAC5REF8_LENGTH                           0x1
#define _DAC5CON2_DAC5REF8_MASK                             0x1
#define _DAC5CON2_DAC5REF9_POSN                             0x1
#define _DAC5CON2_DAC5REF9_POSITION                         0x1
#define _DAC5CON2_DAC5REF9_SIZE                             0x1
#define _DAC5CON2_DAC5REF9_LENGTH                           0x1
#define _DAC5CON2_DAC5REF9_MASK                             0x2
#define _DAC5CON2_DAC5REF10_POSN                            0x2
#define _DAC5CON2_DAC5REF10_POSITION                        0x2
#define _DAC5CON2_DAC5REF10_SIZE                            0x1
#define _DAC5CON2_DAC5REF10_LENGTH                          0x1
#define _DAC5CON2_DAC5REF10_MASK                            0x4
#define _DAC5CON2_DAC5REF11_POSN                            0x3
#define _DAC5CON2_DAC5REF11_POSITION                        0x3
#define _DAC5CON2_DAC5REF11_SIZE                            0x1
#define _DAC5CON2_DAC5REF11_LENGTH                          0x1
#define _DAC5CON2_DAC5REF11_MASK                            0x8
#define _DAC5CON2_DAC5REF12_POSN                            0x4
#define _DAC5CON2_DAC5REF12_POSITION                        0x4
#define _DAC5CON2_DAC5REF12_SIZE                            0x1
#define _DAC5CON2_DAC5REF12_LENGTH                          0x1
#define _DAC5CON2_DAC5REF12_MASK                            0x10
#define _DAC5CON2_DAC5REF13_POSN                            0x5
#define _DAC5CON2_DAC5REF13_POSITION                        0x5
#define _DAC5CON2_DAC5REF13_SIZE                            0x1
#define _DAC5CON2_DAC5REF13_LENGTH                          0x1
#define _DAC5CON2_DAC5REF13_MASK                            0x20
#define _DAC5CON2_DAC5REF14_POSN                            0x6
#define _DAC5CON2_DAC5REF14_POSITION                        0x6
#define _DAC5CON2_DAC5REF14_SIZE                            0x1
#define _DAC5CON2_DAC5REF14_LENGTH                          0x1
#define _DAC5CON2_DAC5REF14_MASK                            0x40
#define _DAC5CON2_DAC5REF15_POSN                            0x7
#define _DAC5CON2_DAC5REF15_POSITION                        0x7
#define _DAC5CON2_DAC5REF15_SIZE                            0x1
#define _DAC5CON2_DAC5REF15_LENGTH                          0x1
#define _DAC5CON2_DAC5REF15_MASK                            0x80
#define _DAC5CON2_R8_POSN                                   0x0
#define _DAC5CON2_R8_POSITION                               0x0
#define _DAC5CON2_R8_SIZE                                   0x1
#define _DAC5CON2_R8_LENGTH                                 0x1
#define _DAC5CON2_R8_MASK                                   0x1
#define _DAC5CON2_R9_POSN                                   0x1
#define _DAC5CON2_R9_POSITION                               0x1
#define _DAC5CON2_R9_SIZE                                   0x1
#define _DAC5CON2_R9_LENGTH                                 0x1
#define _DAC5CON2_R9_MASK                                   0x2
#define _DAC5CON2_R10_POSN                                  0x2
#define _DAC5CON2_R10_POSITION                              0x2
#define _DAC5CON2_R10_SIZE                                  0x1
#define _DAC5CON2_R10_LENGTH                                0x1
#define _DAC5CON2_R10_MASK                                  0x4
#define _DAC5CON2_R11_POSN                                  0x3
#define _DAC5CON2_R11_POSITION                              0x3
#define _DAC5CON2_R11_SIZE                                  0x1
#define _DAC5CON2_R11_LENGTH                                0x1
#define _DAC5CON2_R11_MASK                                  0x8
#define _DAC5CON2_R12_POSN                                  0x4
#define _DAC5CON2_R12_POSITION                              0x4
#define _DAC5CON2_R12_SIZE                                  0x1
#define _DAC5CON2_R12_LENGTH                                0x1
#define _DAC5CON2_R12_MASK                                  0x10
#define _DAC5CON2_R13_POSN                                  0x5
#define _DAC5CON2_R13_POSITION                              0x5
#define _DAC5CON2_R13_SIZE                                  0x1
#define _DAC5CON2_R13_LENGTH                                0x1
#define _DAC5CON2_R13_MASK                                  0x20
#define _DAC5CON2_R14_POSN                                  0x6
#define _DAC5CON2_R14_POSITION                              0x6
#define _DAC5CON2_R14_SIZE                                  0x1
#define _DAC5CON2_R14_LENGTH                                0x1
#define _DAC5CON2_R14_MASK                                  0x40
#define _DAC5CON2_R15_POSN                                  0x7
#define _DAC5CON2_R15_POSITION                              0x7
#define _DAC5CON2_R15_SIZE                                  0x1
#define _DAC5CON2_R15_LENGTH                                0x1
#define _DAC5CON2_R15_MASK                                  0x80
#define _DAC5CON2_DAC5R8_POSN                               0x0
#define _DAC5CON2_DAC5R8_POSITION                           0x0
#define _DAC5CON2_DAC5R8_SIZE                               0x1
#define _DAC5CON2_DAC5R8_LENGTH                             0x1
#define _DAC5CON2_DAC5R8_MASK                               0x1
#define _DAC5CON2_DAC5R9_POSN                               0x1
#define _DAC5CON2_DAC5R9_POSITION                           0x1
#define _DAC5CON2_DAC5R9_SIZE                               0x1
#define _DAC5CON2_DAC5R9_LENGTH                             0x1
#define _DAC5CON2_DAC5R9_MASK                               0x2
#define _DAC5CON2_DAC5R10_POSN                              0x2
#define _DAC5CON2_DAC5R10_POSITION                          0x2
#define _DAC5CON2_DAC5R10_SIZE                              0x1
#define _DAC5CON2_DAC5R10_LENGTH                            0x1
#define _DAC5CON2_DAC5R10_MASK                              0x4
#define _DAC5CON2_DAC5R11_POSN                              0x3
#define _DAC5CON2_DAC5R11_POSITION                          0x3
#define _DAC5CON2_DAC5R11_SIZE                              0x1
#define _DAC5CON2_DAC5R11_LENGTH                            0x1
#define _DAC5CON2_DAC5R11_MASK                              0x8
#define _DAC5CON2_DAC5R12_POSN                              0x4
#define _DAC5CON2_DAC5R12_POSITION                          0x4
#define _DAC5CON2_DAC5R12_SIZE                              0x1
#define _DAC5CON2_DAC5R12_LENGTH                            0x1
#define _DAC5CON2_DAC5R12_MASK                              0x10
#define _DAC5CON2_DAC5R13_POSN                              0x5
#define _DAC5CON2_DAC5R13_POSITION                          0x5
#define _DAC5CON2_DAC5R13_SIZE                              0x1
#define _DAC5CON2_DAC5R13_LENGTH                            0x1
#define _DAC5CON2_DAC5R13_MASK                              0x20
#define _DAC5CON2_DAC5R14_POSN                              0x6
#define _DAC5CON2_DAC5R14_POSITION                          0x6
#define _DAC5CON2_DAC5R14_SIZE                              0x1
#define _DAC5CON2_DAC5R14_LENGTH                            0x1
#define _DAC5CON2_DAC5R14_MASK                              0x40
#define _DAC5CON2_DAC5R15_POSN                              0x7
#define _DAC5CON2_DAC5R15_POSITION                          0x7
#define _DAC5CON2_DAC5R15_SIZE                              0x1
#define _DAC5CON2_DAC5R15_LENGTH                            0x1
#define _DAC5CON2_DAC5R15_MASK                              0x80
#define _DAC5CON2_REF8_POSN                                 0x0
#define _DAC5CON2_REF8_POSITION                             0x0
#define _DAC5CON2_REF8_SIZE                                 0x1
#define _DAC5CON2_REF8_LENGTH                               0x1
#define _DAC5CON2_REF8_MASK                                 0x1
#define _DAC5CON2_REF9_POSN                                 0x1
#define _DAC5CON2_REF9_POSITION                             0x1
#define _DAC5CON2_REF9_SIZE                                 0x1
#define _DAC5CON2_REF9_LENGTH                               0x1
#define _DAC5CON2_REF9_MASK                                 0x2
#define _DAC5CON2_REF10_POSN                                0x2
#define _DAC5CON2_REF10_POSITION                            0x2
#define _DAC5CON2_REF10_SIZE                                0x1
#define _DAC5CON2_REF10_LENGTH                              0x1
#define _DAC5CON2_REF10_MASK                                0x4
#define _DAC5CON2_REF11_POSN                                0x3
#define _DAC5CON2_REF11_POSITION                            0x3
#define _DAC5CON2_REF11_SIZE                                0x1
#define _DAC5CON2_REF11_LENGTH                              0x1
#define _DAC5CON2_REF11_MASK                                0x8
#define _DAC5CON2_REF12_POSN                                0x4
#define _DAC5CON2_REF12_POSITION                            0x4
#define _DAC5CON2_REF12_SIZE                                0x1
#define _DAC5CON2_REF12_LENGTH                              0x1
#define _DAC5CON2_REF12_MASK                                0x10
#define _DAC5CON2_REF13_POSN                                0x5
#define _DAC5CON2_REF13_POSITION                            0x5
#define _DAC5CON2_REF13_SIZE                                0x1
#define _DAC5CON2_REF13_LENGTH                              0x1
#define _DAC5CON2_REF13_MASK                                0x20
#define _DAC5CON2_REF14_POSN                                0x6
#define _DAC5CON2_REF14_POSITION                            0x6
#define _DAC5CON2_REF14_SIZE                                0x1
#define _DAC5CON2_REF14_LENGTH                              0x1
#define _DAC5CON2_REF14_MASK                                0x40
#define _DAC5CON2_REF15_POSN                                0x7
#define _DAC5CON2_REF15_POSITION                            0x7
#define _DAC5CON2_REF15_SIZE                                0x1
#define _DAC5CON2_REF15_LENGTH                              0x1
#define _DAC5CON2_REF15_MASK                                0x80

// Register: DAC6CON0
#define DAC6CON0 DAC6CON0
extern volatile unsigned char           DAC6CON0            __at(0x59B);
#ifndef _LIB_BUILD
asm("DAC6CON0 equ 059Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE2                    :1;
        unsigned OE1                    :1;
        unsigned FM                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned NSS1                   :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned                        :1;
        unsigned OE                     :1;
    };
    struct {
        unsigned DACNSS                 :2;
        unsigned DACPSS                 :2;
        unsigned DACOE2                 :1;
        unsigned DACOE1                 :1;
        unsigned DACFM                  :1;
        unsigned DACEN                  :1;
    };
    struct {
        unsigned DACNSS0                :1;
        unsigned DACNSS1                :1;
        unsigned DACPSS0                :1;
        unsigned DACPSS1                :1;
        unsigned                        :1;
        unsigned DACOE                  :1;
    };
    struct {
        unsigned DAC6NSS                :2;
        unsigned DAC6PSS                :2;
        unsigned DAC6OE2                :1;
        unsigned DAC6OE1                :1;
        unsigned DAC6FM                 :1;
        unsigned DAC6EN                 :1;
    };
    struct {
        unsigned DAC6NSS0               :1;
        unsigned DAC6NSS1               :1;
        unsigned DAC6PSS0               :1;
        unsigned DAC6PSS1               :1;
    };
} DAC6CON0bits_t;
