MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile DAC6REFHbits_t DAC6REFHbits __at(0x59D);
// bitfield macros
#define _DAC6REFH_REF_POSN                                  0x0
#define _DAC6REFH_REF_POSITION                              0x0
#define _DAC6REFH_REF_SIZE                                  0x8
#define _DAC6REFH_REF_LENGTH                                0x8
#define _DAC6REFH_REF_MASK                                  0xFF
#define _DAC6REFH_DAC6REF8_POSN                             0x0
#define _DAC6REFH_DAC6REF8_POSITION                         0x0
#define _DAC6REFH_DAC6REF8_SIZE                             0x1
#define _DAC6REFH_DAC6REF8_LENGTH                           0x1
#define _DAC6REFH_DAC6REF8_MASK                             0x1
#define _DAC6REFH_DAC6REF9_POSN                             0x1
#define _DAC6REFH_DAC6REF9_POSITION                         0x1
#define _DAC6REFH_DAC6REF9_SIZE                             0x1
#define _DAC6REFH_DAC6REF9_LENGTH                           0x1
#define _DAC6REFH_DAC6REF9_MASK                             0x2
#define _DAC6REFH_DAC6REF10_POSN                            0x2
#define _DAC6REFH_DAC6REF10_POSITION                        0x2
#define _DAC6REFH_DAC6REF10_SIZE                            0x1
#define _DAC6REFH_DAC6REF10_LENGTH                          0x1
#define _DAC6REFH_DAC6REF10_MASK                            0x4
#define _DAC6REFH_DAC6REF11_POSN                            0x3
#define _DAC6REFH_DAC6REF11_POSITION                        0x3
#define _DAC6REFH_DAC6REF11_SIZE                            0x1
#define _DAC6REFH_DAC6REF11_LENGTH                          0x1
#define _DAC6REFH_DAC6REF11_MASK                            0x8
#define _DAC6REFH_DAC6REF12_POSN                            0x4
#define _DAC6REFH_DAC6REF12_POSITION                        0x4
#define _DAC6REFH_DAC6REF12_SIZE                            0x1
#define _DAC6REFH_DAC6REF12_LENGTH                          0x1
#define _DAC6REFH_DAC6REF12_MASK                            0x10
#define _DAC6REFH_DAC6REF13_POSN                            0x5
#define _DAC6REFH_DAC6REF13_POSITION                        0x5
#define _DAC6REFH_DAC6REF13_SIZE                            0x1
#define _DAC6REFH_DAC6REF13_LENGTH                          0x1
#define _DAC6REFH_DAC6REF13_MASK                            0x20
#define _DAC6REFH_DAC6REF14_POSN                            0x6
#define _DAC6REFH_DAC6REF14_POSITION                        0x6
#define _DAC6REFH_DAC6REF14_SIZE                            0x1
#define _DAC6REFH_DAC6REF14_LENGTH                          0x1
#define _DAC6REFH_DAC6REF14_MASK                            0x40
#define _DAC6REFH_DAC6REF15_POSN                            0x7
#define _DAC6REFH_DAC6REF15_POSITION                        0x7
#define _DAC6REFH_DAC6REF15_SIZE                            0x1
#define _DAC6REFH_DAC6REF15_LENGTH                          0x1
#define _DAC6REFH_DAC6REF15_MASK                            0x80
#define _DAC6REFH_R8_POSN                                   0x0
#define _DAC6REFH_R8_POSITION                               0x0
#define _DAC6REFH_R8_SIZE                                   0x1
#define _DAC6REFH_R8_LENGTH                                 0x1
#define _DAC6REFH_R8_MASK                                   0x1
#define _DAC6REFH_R9_POSN                                   0x1
#define _DAC6REFH_R9_POSITION                               0x1
#define _DAC6REFH_R9_SIZE                                   0x1
#define _DAC6REFH_R9_LENGTH                                 0x1
#define _DAC6REFH_R9_MASK                                   0x2
#define _DAC6REFH_R10_POSN                                  0x2
#define _DAC6REFH_R10_POSITION                              0x2
#define _DAC6REFH_R10_SIZE                                  0x1
#define _DAC6REFH_R10_LENGTH                                0x1
#define _DAC6REFH_R10_MASK                                  0x4
#define _DAC6REFH_R11_POSN                                  0x3
#define _DAC6REFH_R11_POSITION                              0x3
#define _DAC6REFH_R11_SIZE                                  0x1
#define _DAC6REFH_R11_LENGTH                                0x1
#define _DAC6REFH_R11_MASK                                  0x8
#define _DAC6REFH_R12_POSN                                  0x4
#define _DAC6REFH_R12_POSITION                              0x4
#define _DAC6REFH_R12_SIZE                                  0x1
#define _DAC6REFH_R12_LENGTH                                0x1
#define _DAC6REFH_R12_MASK                                  0x10
#define _DAC6REFH_R13_POSN                                  0x5
#define _DAC6REFH_R13_POSITION                              0x5
#define _DAC6REFH_R13_SIZE                                  0x1
#define _DAC6REFH_R13_LENGTH                                0x1
#define _DAC6REFH_R13_MASK                                  0x20
#define _DAC6REFH_R14_POSN                                  0x6
#define _DAC6REFH_R14_POSITION                              0x6
#define _DAC6REFH_R14_SIZE                                  0x1
#define _DAC6REFH_R14_LENGTH                                0x1
#define _DAC6REFH_R14_MASK                                  0x40
#define _DAC6REFH_R15_POSN                                  0x7
#define _DAC6REFH_R15_POSITION                              0x7
#define _DAC6REFH_R15_SIZE                                  0x1
#define _DAC6REFH_R15_LENGTH                                0x1
#define _DAC6REFH_R15_MASK                                  0x80
#define _DAC6REFH_DAC6R8_POSN                               0x0
#define _DAC6REFH_DAC6R8_POSITION                           0x0
#define _DAC6REFH_DAC6R8_SIZE                               0x1
#define _DAC6REFH_DAC6R8_LENGTH                             0x1
#define _DAC6REFH_DAC6R8_MASK                               0x1
#define _DAC6REFH_DAC6R9_POSN                               0x1
#define _DAC6REFH_DAC6R9_POSITION                           0x1
#define _DAC6REFH_DAC6R9_SIZE                               0x1
#define _DAC6REFH_DAC6R9_LENGTH                             0x1
#define _DAC6REFH_DAC6R9_MASK                               0x2
#define _DAC6REFH_DAC6R10_POSN                              0x2
#define _DAC6REFH_DAC6R10_POSITION                          0x2
#define _DAC6REFH_DAC6R10_SIZE                              0x1
#define _DAC6REFH_DAC6R10_LENGTH                            0x1
#define _DAC6REFH_DAC6R10_MASK                              0x4
#define _DAC6REFH_DAC6R11_POSN                              0x3
#define _DAC6REFH_DAC6R11_POSITION                          0x3
#define _DAC6REFH_DAC6R11_SIZE                              0x1
#define _DAC6REFH_DAC6R11_LENGTH                            0x1
#define _DAC6REFH_DAC6R11_MASK                              0x8
#define _DAC6REFH_DAC6R12_POSN                              0x4
#define _DAC6REFH_DAC6R12_POSITION                          0x4
#define _DAC6REFH_DAC6R12_SIZE                              0x1
#define _DAC6REFH_DAC6R12_LENGTH                            0x1
#define _DAC6REFH_DAC6R12_MASK                              0x10
#define _DAC6REFH_DAC6R13_POSN                              0x5
#define _DAC6REFH_DAC6R13_POSITION                          0x5
#define _DAC6REFH_DAC6R13_SIZE                              0x1
#define _DAC6REFH_DAC6R13_LENGTH                            0x1
#define _DAC6REFH_DAC6R13_MASK                              0x20
#define _DAC6REFH_DAC6R14_POSN                              0x6
#define _DAC6REFH_DAC6R14_POSITION                          0x6
#define _DAC6REFH_DAC6R14_SIZE                              0x1
#define _DAC6REFH_DAC6R14_LENGTH                            0x1
#define _DAC6REFH_DAC6R14_MASK                              0x40
#define _DAC6REFH_DAC6R15_POSN                              0x7
#define _DAC6REFH_DAC6R15_POSITION                          0x7
#define _DAC6REFH_DAC6R15_SIZE                              0x1
#define _DAC6REFH_DAC6R15_LENGTH                            0x1
#define _DAC6REFH_DAC6R15_MASK                              0x80
#define _DAC6REFH_REF8_POSN                                 0x0
#define _DAC6REFH_REF8_POSITION                             0x0
#define _DAC6REFH_REF8_SIZE                                 0x1
#define _DAC6REFH_REF8_LENGTH                               0x1
#define _DAC6REFH_REF8_MASK                                 0x1
#define _DAC6REFH_REF9_POSN                                 0x1
#define _DAC6REFH_REF9_POSITION                             0x1
#define _DAC6REFH_REF9_SIZE                                 0x1
#define _DAC6REFH_REF9_LENGTH                               0x1
#define _DAC6REFH_REF9_MASK                                 0x2
#define _DAC6REFH_REF10_POSN                                0x2
#define _DAC6REFH_REF10_POSITION                            0x2
#define _DAC6REFH_REF10_SIZE                                0x1
#define _DAC6REFH_REF10_LENGTH                              0x1
#define _DAC6REFH_REF10_MASK                                0x4
#define _DAC6REFH_REF11_POSN                                0x3
#define _DAC6REFH_REF11_POSITION                            0x3
#define _DAC6REFH_REF11_SIZE                                0x1
#define _DAC6REFH_REF11_LENGTH                              0x1
#define _DAC6REFH_REF11_MASK                                0x8
#define _DAC6REFH_REF12_POSN                                0x4
#define _DAC6REFH_REF12_POSITION                            0x4
#define _DAC6REFH_REF12_SIZE                                0x1
#define _DAC6REFH_REF12_LENGTH                              0x1
#define _DAC6REFH_REF12_MASK                                0x10
#define _DAC6REFH_REF13_POSN                                0x5
#define _DAC6REFH_REF13_POSITION                            0x5
#define _DAC6REFH_REF13_SIZE                                0x1
#define _DAC6REFH_REF13_LENGTH                              0x1
#define _DAC6REFH_REF13_MASK                                0x20
#define _DAC6REFH_REF14_POSN                                0x6
#define _DAC6REFH_REF14_POSITION                            0x6
#define _DAC6REFH_REF14_SIZE                                0x1
#define _DAC6REFH_REF14_LENGTH                              0x1
#define _DAC6REFH_REF14_MASK                                0x40
#define _DAC6REFH_REF15_POSN                                0x7
#define _DAC6REFH_REF15_POSITION                            0x7
#define _DAC6REFH_REF15_SIZE                                0x1
#define _DAC6REFH_REF15_LENGTH                              0x1
#define _DAC6REFH_REF15_MASK                                0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned REF                    :8;
    };
    struct {
        unsigned DAC6REF8               :1;
        unsigned DAC6REF9               :1;
        unsigned DAC6REF10              :1;
        unsigned DAC6REF11              :1;
        unsigned DAC6REF12              :1;
        unsigned DAC6REF13              :1;
        unsigned DAC6REF14              :1;
        unsigned DAC6REF15              :1;
    };
    struct {
        unsigned R8                     :1;
        unsigned R9                     :1;
        unsigned R10                    :1;
        unsigned R11                    :1;
        unsigned R12                    :1;
        unsigned R13                    :1;
        unsigned R14                    :1;
        unsigned R15                    :1;
    };
    struct {
        unsigned DAC6R8                 :1;
        unsigned DAC6R9                 :1;
        unsigned DAC6R10                :1;
        unsigned DAC6R11                :1;
        unsigned DAC6R12                :1;
        unsigned DAC6R13                :1;
        unsigned DAC6R14                :1;
        unsigned DAC6R15                :1;
    };
    struct {
        unsigned REF8                   :1;
        unsigned REF9                   :1;
        unsigned REF10                  :1;
        unsigned REF11                  :1;
        unsigned REF12                  :1;
        unsigned REF13                  :1;
        unsigned REF14                  :1;
        unsigned REF15                  :1;
    };
} DAC6CON2bits_t;
extern volatile DAC6CON2bits_t DAC6CON2bits __at(0x59D);
// bitfield macros
#define _DAC6CON2_REF_POSN                                  0x0
#define _DAC6CON2_REF_POSITION                              0x0
#define _DAC6CON2_REF_SIZE                                  0x8
#define _DAC6CON2_REF_LENGTH                                0x8
#define _DAC6CON2_REF_MASK                                  0xFF
#define _DAC6CON2_DAC6REF8_POSN                             0x0
#define _DAC6CON2_DAC6REF8_POSITION                         0x0
#define _DAC6CON2_DAC6REF8_SIZE                             0x1
#define _DAC6CON2_DAC6REF8_LENGTH                           0x1
#define _DAC6CON2_DAC6REF8_MASK                             0x1
#define _DAC6CON2_DAC6REF9_POSN                             0x1
#define _DAC6CON2_DAC6REF9_POSITION                         0x1
#define _DAC6CON2_DAC6REF9_SIZE                             0x1
#define _DAC6CON2_DAC6REF9_LENGTH                           0x1
#define _DAC6CON2_DAC6REF9_MASK                             0x2
#define _DAC6CON2_DAC6REF10_POSN                            0x2
#define _DAC6CON2_DAC6REF10_POSITION                        0x2
#define _DAC6CON2_DAC6REF10_SIZE                            0x1
#define _DAC6CON2_DAC6REF10_LENGTH                          0x1
#define _DAC6CON2_DAC6REF10_MASK                            0x4
#define _DAC6CON2_DAC6REF11_POSN                            0x3
#define _DAC6CON2_DAC6REF11_POSITION                        0x3
#define _DAC6CON2_DAC6REF11_SIZE                            0x1
#define _DAC6CON2_DAC6REF11_LENGTH                          0x1
#define _DAC6CON2_DAC6REF11_MASK                            0x8
#define _DAC6CON2_DAC6REF12_POSN                            0x4
#define _DAC6CON2_DAC6REF12_POSITION                        0x4
#define _DAC6CON2_DAC6REF12_SIZE                            0x1
#define _DAC6CON2_DAC6REF12_LENGTH                          0x1
#define _DAC6CON2_DAC6REF12_MASK                            0x10
#define _DAC6CON2_DAC6REF13_POSN                            0x5
#define _DAC6CON2_DAC6REF13_POSITION                        0x5
#define _DAC6CON2_DAC6REF13_SIZE                            0x1
#define _DAC6CON2_DAC6REF13_LENGTH                          0x1
#define _DAC6CON2_DAC6REF13_MASK                            0x20
#define _DAC6CON2_DAC6REF14_POSN                            0x6
#define _DAC6CON2_DAC6REF14_POSITION                        0x6
#define _DAC6CON2_DAC6REF14_SIZE                            0x1
#define _DAC6CON2_DAC6REF14_LENGTH                          0x1
#define _DAC6CON2_DAC6REF14_MASK                            0x40
#define _DAC6CON2_DAC6REF15_POSN                            0x7
#define _DAC6CON2_DAC6REF15_POSITION                        0x7
#define _DAC6CON2_DAC6REF15_SIZE                            0x1
#define _DAC6CON2_DAC6REF15_LENGTH                          0x1
#define _DAC6CON2_DAC6REF15_MASK                            0x80
#define _DAC6CON2_R8_POSN                                   0x0
#define _DAC6CON2_R8_POSITION                               0x0
#define _DAC6CON2_R8_SIZE                                   0x1
#define _DAC6CON2_R8_LENGTH                                 0x1
#define _DAC6CON2_R8_MASK                                   0x1
#define _DAC6CON2_R9_POSN                                   0x1
#define _DAC6CON2_R9_POSITION                               0x1
#define _DAC6CON2_R9_SIZE                                   0x1
#define _DAC6CON2_R9_LENGTH                                 0x1
#define _DAC6CON2_R9_MASK                                   0x2
#define _DAC6CON2_R10_POSN                                  0x2
#define _DAC6CON2_R10_POSITION                              0x2
#define _DAC6CON2_R10_SIZE                                  0x1
#define _DAC6CON2_R10_LENGTH                                0x1
#define _DAC6CON2_R10_MASK                                  0x4
#define _DAC6CON2_R11_POSN                                  0x3
#define _DAC6CON2_R11_POSITION                              0x3
#define _DAC6CON2_R11_SIZE                                  0x1
#define _DAC6CON2_R11_LENGTH                                0x1
#define _DAC6CON2_R11_MASK                                  0x8
#define _DAC6CON2_R12_POSN                                  0x4
#define _DAC6CON2_R12_POSITION                              0x4
#define _DAC6CON2_R12_SIZE                                  0x1
#define _DAC6CON2_R12_LENGTH                                0x1
#define _DAC6CON2_R12_MASK                                  0x10
#define _DAC6CON2_R13_POSN                                  0x5
#define _DAC6CON2_R13_POSITION                              0x5
#define _DAC6CON2_R13_SIZE                                  0x1
#define _DAC6CON2_R13_LENGTH                                0x1
#define _DAC6CON2_R13_MASK                                  0x20
#define _DAC6CON2_R14_POSN                                  0x6
#define _DAC6CON2_R14_POSITION                              0x6
#define _DAC6CON2_R14_SIZE                                  0x1
#define _DAC6CON2_R14_LENGTH                                0x1
#define _DAC6CON2_R14_MASK                                  0x40
#define _DAC6CON2_R15_POSN                                  0x7
#define _DAC6CON2_R15_POSITION                              0x7
#define _DAC6CON2_R15_SIZE                                  0x1
#define _DAC6CON2_R15_LENGTH                                0x1
#define _DAC6CON2_R15_MASK                                  0x80
#define _DAC6CON2_DAC6R8_POSN                               0x0
#define _DAC6CON2_DAC6R8_POSITION                           0x0
#define _DAC6CON2_DAC6R8_SIZE                               0x1
#define _DAC6CON2_DAC6R8_LENGTH                             0x1
#define _DAC6CON2_DAC6R8_MASK                               0x1
#define _DAC6CON2_DAC6R9_POSN                               0x1
#define _DAC6CON2_DAC6R9_POSITION                           0x1
#define _DAC6CON2_DAC6R9_SIZE                               0x1
#define _DAC6CON2_DAC6R9_LENGTH                             0x1
#define _DAC6CON2_DAC6R9_MASK                               0x2
#define _DAC6CON2_DAC6R10_POSN                              0x2
#define _DAC6CON2_DAC6R10_POSITION                          0x2
#define _DAC6CON2_DAC6R10_SIZE                              0x1
#define _DAC6CON2_DAC6R10_LENGTH                            0x1
#define _DAC6CON2_DAC6R10_MASK                              0x4
#define _DAC6CON2_DAC6R11_POSN                              0x3
#define _DAC6CON2_DAC6R11_POSITION                          0x3
#define _DAC6CON2_DAC6R11_SIZE                              0x1
#define _DAC6CON2_DAC6R11_LENGTH                            0x1
#define _DAC6CON2_DAC6R11_MASK                              0x8
#define _DAC6CON2_DAC6R12_POSN                              0x4
#define _DAC6CON2_DAC6R12_POSITION                          0x4
#define _DAC6CON2_DAC6R12_SIZE                              0x1
#define _DAC6CON2_DAC6R12_LENGTH                            0x1
#define _DAC6CON2_DAC6R12_MASK                              0x10
#define _DAC6CON2_DAC6R13_POSN                              0x5
#define _DAC6CON2_DAC6R13_POSITION                          0x5
#define _DAC6CON2_DAC6R13_SIZE                              0x1
#define _DAC6CON2_DAC6R13_LENGTH                            0x1
#define _DAC6CON2_DAC6R13_MASK                              0x20
#define _DAC6CON2_DAC6R14_POSN                              0x6
#define _DAC6CON2_DAC6R14_POSITION                          0x6
#define _DAC6CON2_DAC6R14_SIZE                              0x1
#define _DAC6CON2_DAC6R14_LENGTH                            0x1
#define _DAC6CON2_DAC6R14_MASK                              0x40
#define _DAC6CON2_DAC6R15_POSN                              0x7
#define _DAC6CON2_DAC6R15_POSITION                          0x7
#define _DAC6CON2_DAC6R15_SIZE                              0x1
#define _DAC6CON2_DAC6R15_LENGTH                            0x1
#define _DAC6CON2_DAC6R15_MASK                              0x80
#define _DAC6CON2_REF8_POSN                                 0x0
#define _DAC6CON2_REF8_POSITION                             0x0
#define _DAC6CON2_REF8_SIZE                                 0x1
#define _DAC6CON2_REF8_LENGTH                               0x1
#define _DAC6CON2_REF8_MASK                                 0x1
#define _DAC6CON2_REF9_POSN                                 0x1
#define _DAC6CON2_REF9_POSITION                             0x1
#define _DAC6CON2_REF9_SIZE                                 0x1
#define _DAC6CON2_REF9_LENGTH                               0x1
#define _DAC6CON2_REF9_MASK                                 0x2
#define _DAC6CON2_REF10_POSN                                0x2
#define _DAC6CON2_REF10_POSITION                            0x2
#define _DAC6CON2_REF10_SIZE                                0x1
#define _DAC6CON2_REF10_LENGTH                              0x1
#define _DAC6CON2_REF10_MASK                                0x4
#define _DAC6CON2_REF11_POSN                                0x3
#define _DAC6CON2_REF11_POSITION                            0x3
#define _DAC6CON2_REF11_SIZE                                0x1
#define _DAC6CON2_REF11_LENGTH                              0x1
#define _DAC6CON2_REF11_MASK                                0x8
#define _DAC6CON2_REF12_POSN                                0x4
#define _DAC6CON2_REF12_POSITION                            0x4
#define _DAC6CON2_REF12_SIZE                                0x1
#define _DAC6CON2_REF12_LENGTH                              0x1
#define _DAC6CON2_REF12_MASK                                0x10
#define _DAC6CON2_REF13_POSN                                0x5
#define _DAC6CON2_REF13_POSITION                            0x5
#define _DAC6CON2_REF13_SIZE                                0x1
#define _DAC6CON2_REF13_LENGTH                              0x1
#define _DAC6CON2_REF13_MASK                                0x20
#define _DAC6CON2_REF14_POSN                                0x6
#define _DAC6CON2_REF14_POSITION                            0x6
#define _DAC6CON2_REF14_SIZE                                0x1
#define _DAC6CON2_REF14_LENGTH                              0x1
#define _DAC6CON2_REF14_MASK                                0x40
#define _DAC6CON2_REF15_POSN                                0x7
#define _DAC6CON2_REF15_POSITION                            0x7
#define _DAC6CON2_REF15_SIZE                                0x1
#define _DAC6CON2_REF15_LENGTH                              0x1
#define _DAC6CON2_REF15_MASK                                0x80

