MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// Register: PWM10CON
#define PWM10CON PWM10CON
extern volatile unsigned char           PWM10CON            __at(0x61F);
#ifndef _LIB_BUILD
asm("PWM10CON equ 061Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :4;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :4;
        unsigned PWM10POL               :1;
        unsigned PWM10OUT               :1;
        unsigned                        :1;
        unsigned PWM10EN                :1;
    };
} PWM10CONbits_t;
extern volatile PWM10CONbits_t PWM10CONbits __at(0x61F);
// bitfield macros
#define _PWM10CON_POL_POSN                                  0x4
#define _PWM10CON_POL_POSITION                              0x4
#define _PWM10CON_POL_SIZE                                  0x1
#define _PWM10CON_POL_LENGTH                                0x1
#define _PWM10CON_POL_MASK                                  0x10
#define _PWM10CON_OUT_POSN                                  0x5
#define _PWM10CON_OUT_POSITION                              0x5
#define _PWM10CON_OUT_SIZE                                  0x1
#define _PWM10CON_OUT_LENGTH                                0x1
#define _PWM10CON_OUT_MASK                                  0x20
#define _PWM10CON_EN_POSN                                   0x7
#define _PWM10CON_EN_POSITION                               0x7
#define _PWM10CON_EN_SIZE                                   0x1
#define _PWM10CON_EN_LENGTH                                 0x1
#define _PWM10CON_EN_MASK                                   0x80
#define _PWM10CON_PWM10POL_POSN                             0x4
#define _PWM10CON_PWM10POL_POSITION                         0x4
#define _PWM10CON_PWM10POL_SIZE                             0x1
#define _PWM10CON_PWM10POL_LENGTH                           0x1
#define _PWM10CON_PWM10POL_MASK                             0x10
#define _PWM10CON_PWM10OUT_POSN                             0x5
#define _PWM10CON_PWM10OUT_POSITION                         0x5
#define _PWM10CON_PWM10OUT_SIZE                             0x1
#define _PWM10CON_PWM10OUT_LENGTH                           0x1
#define _PWM10CON_PWM10OUT_MASK                             0x20
#define _PWM10CON_PWM10EN_POSN                              0x7
#define _PWM10CON_PWM10EN_POSITION                          0x7
#define _PWM10CON_PWM10EN_SIZE                              0x1
#define _PWM10CON_PWM10EN_LENGTH                            0x1
#define _PWM10CON_PWM10EN_MASK                              0x80

// Register: COG1PHR
#define COG1PHR COG1PHR
extern volatile unsigned char           COG1PHR             __at(0x68D);
#ifndef _LIB_BUILD
asm("COG1PHR equ 068Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHR                    :6;
    };
    struct {
        unsigned PHR0                   :1;
        unsigned PHR1                   :1;
        unsigned PHR2                   :1;
        unsigned PHR3                   :1;
        unsigned PHR4                   :1;
        unsigned PHR5                   :1;
    };
    struct {
        unsigned G1PHR0                 :1;
        unsigned G1PHR1                 :1;
        unsigned G1PHR2                 :1;
        unsigned G1PHR3                 :1;
        unsigned G1PHR4                 :1;
        unsigned G1PHR5                 :1;
    };
} COG1PHRbits_t;
extern volatile COG1PHRbits_t COG1PHRbits __at(0x68D);
// bitfield macros
#define _COG1PHR_PHR_POSN                                   0x0
#define _COG1PHR_PHR_POSITION                               0x0
#define _COG1PHR_PHR_SIZE                                   0x6
#define _COG1PHR_PHR_LENGTH                                 0x6
#define _COG1PHR_PHR_MASK                                   0x3F
#define _COG1PHR_PHR0_POSN                                  0x0
#define _COG1PHR_PHR0_POSITION                              0x0
#define _COG1PHR_PHR0_SIZE                                  0x1
#define _COG1PHR_PHR0_LENGTH                                0x1
#define _COG1PHR_PHR0_MASK                                  0x1
#define _COG1PHR_PHR1_POSN                                  0x1
#define _COG1PHR_PHR1_POSITION                              0x1
#define _COG1PHR_PHR1_SIZE                                  0x1
#define _COG1PHR_PHR1_LENGTH                                0x1
#define _COG1PHR_PHR1_MASK                                  0x2
#define _COG1PHR_PHR2_POSN                                  0x2
#define _COG1PHR_PHR2_POSITION                              0x2
#define _COG1PHR_PHR2_SIZE                                  0x1
#define _COG1PHR_PHR2_LENGTH                                0x1
#define _COG1PHR_PHR2_MASK                                  0x4
#define _COG1PHR_PHR3_POSN                                  0x3
#define _COG1PHR_PHR3_POSITION                              0x3
#define _COG1PHR_PHR3_SIZE                                  0x1
#define _COG1PHR_PHR3_LENGTH                                0x1
#define _COG1PHR_PHR3_MASK                                  0x8
#define _COG1PHR_PHR4_POSN                                  0x4
#define _COG1PHR_PHR4_POSITION                              0x4
#define _COG1PHR_PHR4_SIZE                                  0x1
#define _COG1PHR_PHR4_LENGTH                                0x1
#define _COG1PHR_PHR4_MASK                                  0x10
#define _COG1PHR_PHR5_POSN                                  0x5
#define _COG1PHR_PHR5_POSITION                              0x5
#define _COG1PHR_PHR5_SIZE                                  0x1
#define _COG1PHR_PHR5_LENGTH                                0x1
#define _COG1PHR_PHR5_MASK                                  0x20
#define _COG1PHR_G1PHR0_POSN                                0x0
#define _COG1PHR_G1PHR0_POSITION                            0x0
#define _COG1PHR_G1PHR0_SIZE                                0x1
#define _COG1PHR_G1PHR0_LENGTH                              0x1
#define _COG1PHR_G1PHR0_MASK                                0x1
#define _COG1PHR_G1PHR1_POSN                                0x1
#define _COG1PHR_G1PHR1_POSITION                            0x1
#define _COG1PHR_G1PHR1_SIZE                                0x1
#define _COG1PHR_G1PHR1_LENGTH                              0x1
#define _COG1PHR_G1PHR1_MASK                                0x2
#define _COG1PHR_G1PHR2_POSN                                0x2
#define _COG1PHR_G1PHR2_POSITION                            0x2
#define _COG1PHR_G1PHR2_SIZE                                0x1
#define _COG1PHR_G1PHR2_LENGTH                              0x1
#define _COG1PHR_G1PHR2_MASK                                0x4
#define _COG1PHR_G1PHR3_POSN                                0x3
#define _COG1PHR_G1PHR3_POSITION                            0x3
#define _COG1PHR_G1PHR3_SIZE                                0x1
#define _COG1PHR_G1PHR3_LENGTH                              0x1
#define _COG1PHR_G1PHR3_MASK                                0x8
#define _COG1PHR_G1PHR4_POSN                                0x4
#define _COG1PHR_G1PHR4_POSITION                            0x4
#define _COG1PHR_G1PHR4_SIZE                                0x1
#define _COG1PHR_G1PHR4_LENGTH                              0x1
#define _COG1PHR_G1PHR4_MASK                                0x10
#define _COG1PHR_G1PHR5_POSN                                0x5
#define _COG1PHR_G1PHR5_POSITION                            0x5
#define _COG1PHR_G1PHR5_SIZE                                0x1
#define _COG1PHR_G1PHR5_LENGTH                              0x1
#define _COG1PHR_G1PHR5_MASK                                0x20

// Register: COG1PHF
#define COG1PHF COG1PHF
extern volatile unsigned char           COG1PHF             __at(0x68E);
#ifndef _LIB_BUILD
asm("COG1PHF equ 068Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHF                    :6;
    };
    struct {
        unsigned PHF0                   :1;
        unsigned PHF1                   :1;
        unsigned PHF2                   :1;
        unsigned PHF3                   :1;
        unsigned PHF4                   :1;
        unsigned PHF5                   :1;
    };
    struct {
        unsigned G1PHF0                 :1;
        unsigned G1PHF1                 :1;
        unsigned G1PHF2                 :1;
        unsigned G1PHF3                 :1;
        unsigned G1PHF4                 :1;
        unsigned G1PHF5                 :1;
    };
} COG1PHFbits_t;
extern volatile COG1PHFbits_t COG1PHFbits __at(0x68E);
// bitfield macros
#define _COG1PHF_PHF_POSN                                   0x0
#define _COG1PHF_PHF_POSITION                               0x0
#define _COG1PHF_PHF_SIZE                                   0x6
#define _COG1PHF_PHF_LENGTH                                 0x6
#define _COG1PHF_PHF_MASK                                   0x3F
#define _COG1PHF_PHF0_POSN                                  0x0
#define _COG1PHF_PHF0_POSITION                              0x0
#define _COG1PHF_PHF0_SIZE                                  0x1
#define _COG1PHF_PHF0_LENGTH                                0x1
#define _COG1PHF_PHF0_MASK                                  0x1
#define _COG1PHF_PHF1_POSN                                  0x1
#define _COG1PHF_PHF1_POSITION                              0x1
#define _COG1PHF_PHF1_SIZE                                  0x1
#define _COG1PHF_PHF1_LENGTH                                0x1
#define _COG1PHF_PHF1_MASK                                  0x2
#define _COG1PHF_PHF2_POSN                                  0x2
#define _COG1PHF_PHF2_POSITION                              0x2
#define _COG1PHF_PHF2_SIZE                                  0x1
#define _COG1PHF_PHF2_LENGTH                                0x1
#define _COG1PHF_PHF2_MASK                                  0x4
#define _COG1PHF_PHF3_POSN                                  0x3
#define _COG1PHF_PHF3_POSITION                              0x3
#define _COG1PHF_PHF3_SIZE                                  0x1
#define _COG1PHF_PHF3_LENGTH                                0x1
#define _COG1PHF_PHF3_MASK                                  0x8
#define _COG1PHF_PHF4_POSN                                  0x4
#define _COG1PHF_PHF4_POSITION                              0x4
#define _COG1PHF_PHF4_SIZE                                  0x1
#define _COG1PHF_PHF4_LENGTH                                0x1
#define _COG1PHF_PHF4_MASK                                  0x10
#define _COG1PHF_PHF5_POSN                                  0x5
#define _COG1PHF_PHF5_POSITION                              0x5
#define _COG1PHF_PHF5_SIZE                                  0x1
#define _COG1PHF_PHF5_LENGTH                                0x1
#define _COG1PHF_PHF5_MASK                                  0x20
#define _COG1PHF_G1PHF0_POSN                                0x0
#define _COG1PHF_G1PHF0_POSITION                            0x0
#define _COG1PHF_G1PHF0_SIZE                                0x1
#define _COG1PHF_G1PHF0_LENGTH                              0x1
#define _COG1PHF_G1PHF0_MASK                                0x1
#define _COG1PHF_G1PHF1_POSN                                0x1
#define _COG1PHF_G1PHF1_POSITION                            0x1
#define _COG1PHF_G1PHF1_SIZE                                0x1
#define _COG1PHF_G1PHF1_LENGTH                              0x1
#define _COG1PHF_G1PHF1_MASK                                0x2
#define _COG1PHF_G1PHF2_POSN                                0x2
#define _COG1PHF_G1PHF2_POSITION                            0x2
#define _COG1PHF_G1PHF2_SIZE                                0x1
#define _COG1PHF_G1PHF2_LENGTH                              0x1
#define _COG1PHF_G1PHF2_MASK                                0x4
#define _COG1PHF_G1PHF3_POSN                                0x3
#define _COG1PHF_G1PHF3_POSITION                            0x3
#define _COG1PHF_G1PHF3_SIZE                                0x1
#define _COG1PHF_G1PHF3_LENGTH                              0x1
#define _COG1PHF_G1PHF3_MASK                                0x8
#define _COG1PHF_G1PHF4_POSN                                0x4
#define _COG1PHF_G1PHF4_POSITION                            0x4
#define _COG1PHF_G1PHF4_SIZE                                0x1
#define _COG1PHF_G1PHF4_LENGTH                              0x1
#define _COG1PHF_G1PHF4_MASK                                0x10
#define _COG1PHF_G1PHF5_POSN                                0x5
#define _COG1PHF_G1PHF5_POSITION                            0x5
#define _COG1PHF_G1PHF5_SIZE                                0x1
#define _COG1PHF_G1PHF5_LENGTH                              0x1
#define _COG1PHF_G1PHF5_MASK                                0x20

