MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile COG2RIS0bits_t COG2RIS0bits __at(0x715);
// bitfield macros
#define _COG2RIS0_RIS0_POSN                                 0x0
#define _COG2RIS0_RIS0_POSITION                             0x0
#define _COG2RIS0_RIS0_SIZE                                 0x1
#define _COG2RIS0_RIS0_LENGTH                               0x1
#define _COG2RIS0_RIS0_MASK                                 0x1
#define _COG2RIS0_RIS1_POSN                                 0x1
#define _COG2RIS0_RIS1_POSITION                             0x1
#define _COG2RIS0_RIS1_SIZE                                 0x1
#define _COG2RIS0_RIS1_LENGTH                               0x1
#define _COG2RIS0_RIS1_MASK                                 0x2
#define _COG2RIS0_RIS2_POSN                                 0x2
#define _COG2RIS0_RIS2_POSITION                             0x2
#define _COG2RIS0_RIS2_SIZE                                 0x1
#define _COG2RIS0_RIS2_LENGTH                               0x1
#define _COG2RIS0_RIS2_MASK                                 0x4
#define _COG2RIS0_RIS3_POSN                                 0x3
#define _COG2RIS0_RIS3_POSITION                             0x3
#define _COG2RIS0_RIS3_SIZE                                 0x1
#define _COG2RIS0_RIS3_LENGTH                               0x1
#define _COG2RIS0_RIS3_MASK                                 0x8
#define _COG2RIS0_RIS4_POSN                                 0x4
#define _COG2RIS0_RIS4_POSITION                             0x4
#define _COG2RIS0_RIS4_SIZE                                 0x1
#define _COG2RIS0_RIS4_LENGTH                               0x1
#define _COG2RIS0_RIS4_MASK                                 0x10
#define _COG2RIS0_RIS5_POSN                                 0x5
#define _COG2RIS0_RIS5_POSITION                             0x5
#define _COG2RIS0_RIS5_SIZE                                 0x1
#define _COG2RIS0_RIS5_LENGTH                               0x1
#define _COG2RIS0_RIS5_MASK                                 0x20
#define _COG2RIS0_RIS6_POSN                                 0x6
#define _COG2RIS0_RIS6_POSITION                             0x6
#define _COG2RIS0_RIS6_SIZE                                 0x1
#define _COG2RIS0_RIS6_LENGTH                               0x1
#define _COG2RIS0_RIS6_MASK                                 0x40
#define _COG2RIS0_RIS7_POSN                                 0x7
#define _COG2RIS0_RIS7_POSITION                             0x7
#define _COG2RIS0_RIS7_SIZE                                 0x1
#define _COG2RIS0_RIS7_LENGTH                               0x1
#define _COG2RIS0_RIS7_MASK                                 0x80
#define _COG2RIS0_G2RIS0_POSN                               0x0
#define _COG2RIS0_G2RIS0_POSITION                           0x0
#define _COG2RIS0_G2RIS0_SIZE                               0x1
#define _COG2RIS0_G2RIS0_LENGTH                             0x1
#define _COG2RIS0_G2RIS0_MASK                               0x1
#define _COG2RIS0_G2RIS1_POSN                               0x1
#define _COG2RIS0_G2RIS1_POSITION                           0x1
#define _COG2RIS0_G2RIS1_SIZE                               0x1
#define _COG2RIS0_G2RIS1_LENGTH                             0x1
#define _COG2RIS0_G2RIS1_MASK                               0x2
#define _COG2RIS0_G2RIS2_POSN                               0x2
#define _COG2RIS0_G2RIS2_POSITION                           0x2
#define _COG2RIS0_G2RIS2_SIZE                               0x1
#define _COG2RIS0_G2RIS2_LENGTH                             0x1
#define _COG2RIS0_G2RIS2_MASK                               0x4
#define _COG2RIS0_G2RIS3_POSN                               0x3
#define _COG2RIS0_G2RIS3_POSITION                           0x3
#define _COG2RIS0_G2RIS3_SIZE                               0x1
#define _COG2RIS0_G2RIS3_LENGTH                             0x1
#define _COG2RIS0_G2RIS3_MASK                               0x8
#define _COG2RIS0_G2RIS4_POSN                               0x4
#define _COG2RIS0_G2RIS4_POSITION                           0x4
#define _COG2RIS0_G2RIS4_SIZE                               0x1
#define _COG2RIS0_G2RIS4_LENGTH                             0x1
#define _COG2RIS0_G2RIS4_MASK                               0x10
#define _COG2RIS0_G2RIS5_POSN                               0x5
#define _COG2RIS0_G2RIS5_POSITION                           0x5
#define _COG2RIS0_G2RIS5_SIZE                               0x1
#define _COG2RIS0_G2RIS5_LENGTH                             0x1
#define _COG2RIS0_G2RIS5_MASK                               0x20
#define _COG2RIS0_G2RIS6_POSN                               0x6
#define _COG2RIS0_G2RIS6_POSITION                           0x6
#define _COG2RIS0_G2RIS6_SIZE                               0x1
#define _COG2RIS0_G2RIS6_LENGTH                             0x1
#define _COG2RIS0_G2RIS6_MASK                               0x40
#define _COG2RIS0_G2RIS7_POSN                               0x7
#define _COG2RIS0_G2RIS7_POSITION                           0x7
#define _COG2RIS0_G2RIS7_SIZE                               0x1
#define _COG2RIS0_G2RIS7_LENGTH                             0x1
#define _COG2RIS0_G2RIS7_MASK                               0x80

// Register: COG2RIS1
#define COG2RIS1 COG2RIS1
extern volatile unsigned char           COG2RIS1            __at(0x716);
#ifndef _LIB_BUILD
asm("COG2RIS1 equ 0716h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RIS8                   :1;
        unsigned RIS9                   :1;
        unsigned RIS10                  :1;
        unsigned RIS11                  :1;
        unsigned RIS12                  :1;
        unsigned RIS13                  :1;
        unsigned RIS14                  :1;
        unsigned RIS15                  :1;
    };
    struct {
        unsigned G2RIS8                 :1;
        unsigned G2RIS9                 :1;
        unsigned G2RIS10                :1;
        unsigned G2RIS11                :1;
        unsigned G2RIS12                :1;
        unsigned G2RIS13                :1;
        unsigned G2RIS14                :1;
        unsigned G2RIS15                :1;
    };
} COG2RIS1bits_t;
extern volatile COG2RIS1bits_t COG2RIS1bits __at(0x716);
// bitfield macros
#define _COG2RIS1_RIS8_POSN                                 0x0
#define _COG2RIS1_RIS8_POSITION                             0x0
#define _COG2RIS1_RIS8_SIZE                                 0x1
#define _COG2RIS1_RIS8_LENGTH                               0x1
#define _COG2RIS1_RIS8_MASK                                 0x1
#define _COG2RIS1_RIS9_POSN                                 0x1
#define _COG2RIS1_RIS9_POSITION                             0x1
#define _COG2RIS1_RIS9_SIZE                                 0x1
#define _COG2RIS1_RIS9_LENGTH                               0x1
#define _COG2RIS1_RIS9_MASK                                 0x2
#define _COG2RIS1_RIS10_POSN                                0x2
#define _COG2RIS1_RIS10_POSITION                            0x2
#define _COG2RIS1_RIS10_SIZE                                0x1
#define _COG2RIS1_RIS10_LENGTH                              0x1
#define _COG2RIS1_RIS10_MASK                                0x4
#define _COG2RIS1_RIS11_POSN                                0x3
#define _COG2RIS1_RIS11_POSITION                            0x3
#define _COG2RIS1_RIS11_SIZE                                0x1
#define _COG2RIS1_RIS11_LENGTH                              0x1
#define _COG2RIS1_RIS11_MASK                                0x8
#define _COG2RIS1_RIS12_POSN                                0x4
#define _COG2RIS1_RIS12_POSITION                            0x4
#define _COG2RIS1_RIS12_SIZE                                0x1
#define _COG2RIS1_RIS12_LENGTH                              0x1
#define _COG2RIS1_RIS12_MASK                                0x10
#define _COG2RIS1_RIS13_POSN                                0x5
#define _COG2RIS1_RIS13_POSITION                            0x5
#define _COG2RIS1_RIS13_SIZE                                0x1
#define _COG2RIS1_RIS13_LENGTH                              0x1
#define _COG2RIS1_RIS13_MASK                                0x20
#define _COG2RIS1_RIS14_POSN                                0x6
#define _COG2RIS1_RIS14_POSITION                            0x6
#define _COG2RIS1_RIS14_SIZE                                0x1
#define _COG2RIS1_RIS14_LENGTH                              0x1
#define _COG2RIS1_RIS14_MASK                                0x40
#define _COG2RIS1_RIS15_POSN                                0x7
#define _COG2RIS1_RIS15_POSITION                            0x7
#define _COG2RIS1_RIS15_SIZE                                0x1
#define _COG2RIS1_RIS15_LENGTH                              0x1
#define _COG2RIS1_RIS15_MASK                                0x80
#define _COG2RIS1_G2RIS8_POSN                               0x0
#define _COG2RIS1_G2RIS8_POSITION                           0x0
#define _COG2RIS1_G2RIS8_SIZE                               0x1
#define _COG2RIS1_G2RIS8_LENGTH                             0x1
#define _COG2RIS1_G2RIS8_MASK                               0x1
#define _COG2RIS1_G2RIS9_POSN                               0x1
#define _COG2RIS1_G2RIS9_POSITION                           0x1
#define _COG2RIS1_G2RIS9_SIZE                               0x1
#define _COG2RIS1_G2RIS9_LENGTH                             0x1
#define _COG2RIS1_G2RIS9_MASK                               0x2
#define _COG2RIS1_G2RIS10_POSN                              0x2
#define _COG2RIS1_G2RIS10_POSITION                          0x2
#define _COG2RIS1_G2RIS10_SIZE                              0x1
#define _COG2RIS1_G2RIS10_LENGTH                            0x1
#define _COG2RIS1_G2RIS10_MASK                              0x4
#define _COG2RIS1_G2RIS11_POSN                              0x3
#define _COG2RIS1_G2RIS11_POSITION                          0x3
#define _COG2RIS1_G2RIS11_SIZE                              0x1
#define _COG2RIS1_G2RIS11_LENGTH                            0x1
#define _COG2RIS1_G2RIS11_MASK                              0x8
#define _COG2RIS1_G2RIS12_POSN                              0x4
#define _COG2RIS1_G2RIS12_POSITION                          0x4
#define _COG2RIS1_G2RIS12_SIZE                              0x1
#define _COG2RIS1_G2RIS12_LENGTH                            0x1
#define _COG2RIS1_G2RIS12_MASK                              0x10
#define _COG2RIS1_G2RIS13_POSN                              0x5
#define _COG2RIS1_G2RIS13_POSITION                          0x5
#define _COG2RIS1_G2RIS13_SIZE                              0x1
#define _COG2RIS1_G2RIS13_LENGTH                            0x1
#define _COG2RIS1_G2RIS13_MASK                              0x20
#define _COG2RIS1_G2RIS14_POSN                              0x6
#define _COG2RIS1_G2RIS14_POSITION                          0x6
#define _COG2RIS1_G2RIS14_SIZE                              0x1
#define _COG2RIS1_G2RIS14_LENGTH                            0x1
#define _COG2RIS1_G2RIS14_MASK                              0x40
#define _COG2RIS1_G2RIS15_POSN                              0x7
#define _COG2RIS1_G2RIS15_POSITION                          0x7
#define _COG2RIS1_G2RIS15_SIZE                              0x1
#define _COG2RIS1_G2RIS15_LENGTH                            0x1
#define _COG2RIS1_G2RIS15_MASK                              0x80

// Register: COG2RSIM0
#define COG2RSIM0 COG2RSIM0
extern volatile unsigned char           COG2RSIM0           __at(0x717);
#ifndef _LIB_BUILD
asm("COG2RSIM0 equ 0717h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RSIM0                  :1;
        unsigned RSIM1                  :1;
        unsigned RSIM2                  :1;
        unsigned RSIM3                  :1;
        unsigned RSIM4                  :1;
        unsigned RSIM5                  :1;
        unsigned RSIM6                  :1;
        unsigned RSIM7                  :1;
    };
    struct {
        unsigned G2RSIM0                :1;
        unsigned G2RSIM1                :1;
        unsigned G2RSIM2                :1;
        unsigned G2RSIM3                :1;
        unsigned G2RSIM4                :1;
        unsigned G2RSIM5                :1;
        unsigned G2RSIM6                :1;
        unsigned G2RSIM7                :1;
    };
} COG2RSIM0bits_t;
