MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile COG3DBRbits_t COG3DBRbits __at(0x811);
// bitfield macros
#define _COG3DBR_DBR_POSN                                   0x0
#define _COG3DBR_DBR_POSITION                               0x0
#define _COG3DBR_DBR_SIZE                                   0x6
#define _COG3DBR_DBR_LENGTH                                 0x6
#define _COG3DBR_DBR_MASK                                   0x3F
#define _COG3DBR_DBR0_POSN                                  0x0
#define _COG3DBR_DBR0_POSITION                              0x0
#define _COG3DBR_DBR0_SIZE                                  0x1
#define _COG3DBR_DBR0_LENGTH                                0x1
#define _COG3DBR_DBR0_MASK                                  0x1
#define _COG3DBR_DBR1_POSN                                  0x1
#define _COG3DBR_DBR1_POSITION                              0x1
#define _COG3DBR_DBR1_SIZE                                  0x1
#define _COG3DBR_DBR1_LENGTH                                0x1
#define _COG3DBR_DBR1_MASK                                  0x2
#define _COG3DBR_DBR2_POSN                                  0x2
#define _COG3DBR_DBR2_POSITION                              0x2
#define _COG3DBR_DBR2_SIZE                                  0x1
#define _COG3DBR_DBR2_LENGTH                                0x1
#define _COG3DBR_DBR2_MASK                                  0x4
#define _COG3DBR_DBR3_POSN                                  0x3
#define _COG3DBR_DBR3_POSITION                              0x3
#define _COG3DBR_DBR3_SIZE                                  0x1
#define _COG3DBR_DBR3_LENGTH                                0x1
#define _COG3DBR_DBR3_MASK                                  0x8
#define _COG3DBR_DBR4_POSN                                  0x4
#define _COG3DBR_DBR4_POSITION                              0x4
#define _COG3DBR_DBR4_SIZE                                  0x1
#define _COG3DBR_DBR4_LENGTH                                0x1
#define _COG3DBR_DBR4_MASK                                  0x10
#define _COG3DBR_DBR5_POSN                                  0x5
#define _COG3DBR_DBR5_POSITION                              0x5
#define _COG3DBR_DBR5_SIZE                                  0x1
#define _COG3DBR_DBR5_LENGTH                                0x1
#define _COG3DBR_DBR5_MASK                                  0x20
#define _COG3DBR_G3DBR0_POSN                                0x0
#define _COG3DBR_G3DBR0_POSITION                            0x0
#define _COG3DBR_G3DBR0_SIZE                                0x1
#define _COG3DBR_G3DBR0_LENGTH                              0x1
#define _COG3DBR_G3DBR0_MASK                                0x1
#define _COG3DBR_G3DBR1_POSN                                0x1
#define _COG3DBR_G3DBR1_POSITION                            0x1
#define _COG3DBR_G3DBR1_SIZE                                0x1
#define _COG3DBR_G3DBR1_LENGTH                              0x1
#define _COG3DBR_G3DBR1_MASK                                0x2
#define _COG3DBR_G3DBR2_POSN                                0x2
#define _COG3DBR_G3DBR2_POSITION                            0x2
#define _COG3DBR_G3DBR2_SIZE                                0x1
#define _COG3DBR_G3DBR2_LENGTH                              0x1
#define _COG3DBR_G3DBR2_MASK                                0x4
#define _COG3DBR_G3DBR3_POSN                                0x3
#define _COG3DBR_G3DBR3_POSITION                            0x3
#define _COG3DBR_G3DBR3_SIZE                                0x1
#define _COG3DBR_G3DBR3_LENGTH                              0x1
#define _COG3DBR_G3DBR3_MASK                                0x8
#define _COG3DBR_G3DBR4_POSN                                0x4
#define _COG3DBR_G3DBR4_POSITION                            0x4
#define _COG3DBR_G3DBR4_SIZE                                0x1
#define _COG3DBR_G3DBR4_LENGTH                              0x1
#define _COG3DBR_G3DBR4_MASK                                0x10
#define _COG3DBR_G3DBR5_POSN                                0x5
#define _COG3DBR_G3DBR5_POSITION                            0x5
#define _COG3DBR_G3DBR5_SIZE                                0x1
#define _COG3DBR_G3DBR5_LENGTH                              0x1
#define _COG3DBR_G3DBR5_MASK                                0x20

// Register: COG3DBF
#define COG3DBF COG3DBF
extern volatile unsigned char           COG3DBF             __at(0x812);
#ifndef _LIB_BUILD
asm("COG3DBF equ 0812h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DBF0                   :1;
        unsigned DBF1                   :1;
        unsigned DBF2                   :1;
        unsigned DBF3                   :1;
        unsigned DBF4                   :1;
        unsigned DBF5                   :1;
    };
    struct {
        unsigned G3DBF0                 :1;
        unsigned G3DBF1                 :1;
        unsigned G3DBF2                 :1;
        unsigned G3DBF3                 :1;
        unsigned G3DBF4                 :1;
        unsigned G3DBF5                 :1;
    };
    struct {
        unsigned G3DBF                  :6;
    };
} COG3DBFbits_t;
extern volatile COG3DBFbits_t COG3DBFbits __at(0x812);
// bitfield macros
#define _COG3DBF_DBF0_POSN                                  0x0
#define _COG3DBF_DBF0_POSITION                              0x0
#define _COG3DBF_DBF0_SIZE                                  0x1
#define _COG3DBF_DBF0_LENGTH                                0x1
#define _COG3DBF_DBF0_MASK                                  0x1
#define _COG3DBF_DBF1_POSN                                  0x1
#define _COG3DBF_DBF1_POSITION                              0x1
#define _COG3DBF_DBF1_SIZE                                  0x1
#define _COG3DBF_DBF1_LENGTH                                0x1
#define _COG3DBF_DBF1_MASK                                  0x2
#define _COG3DBF_DBF2_POSN                                  0x2
#define _COG3DBF_DBF2_POSITION                              0x2
#define _COG3DBF_DBF2_SIZE                                  0x1
#define _COG3DBF_DBF2_LENGTH                                0x1
#define _COG3DBF_DBF2_MASK                                  0x4
#define _COG3DBF_DBF3_POSN                                  0x3
#define _COG3DBF_DBF3_POSITION                              0x3
#define _COG3DBF_DBF3_SIZE                                  0x1
#define _COG3DBF_DBF3_LENGTH                                0x1
#define _COG3DBF_DBF3_MASK                                  0x8
#define _COG3DBF_DBF4_POSN                                  0x4
#define _COG3DBF_DBF4_POSITION                              0x4
#define _COG3DBF_DBF4_SIZE                                  0x1
#define _COG3DBF_DBF4_LENGTH                                0x1
#define _COG3DBF_DBF4_MASK                                  0x10
#define _COG3DBF_DBF5_POSN                                  0x5
#define _COG3DBF_DBF5_POSITION                              0x5
#define _COG3DBF_DBF5_SIZE                                  0x1
#define _COG3DBF_DBF5_LENGTH                                0x1
#define _COG3DBF_DBF5_MASK                                  0x20
#define _COG3DBF_G3DBF0_POSN                                0x0
#define _COG3DBF_G3DBF0_POSITION                            0x0
#define _COG3DBF_G3DBF0_SIZE                                0x1
#define _COG3DBF_G3DBF0_LENGTH                              0x1
#define _COG3DBF_G3DBF0_MASK                                0x1
#define _COG3DBF_G3DBF1_POSN                                0x1
#define _COG3DBF_G3DBF1_POSITION                            0x1
#define _COG3DBF_G3DBF1_SIZE                                0x1
#define _COG3DBF_G3DBF1_LENGTH                              0x1
#define _COG3DBF_G3DBF1_MASK                                0x2
#define _COG3DBF_G3DBF2_POSN                                0x2
#define _COG3DBF_G3DBF2_POSITION                            0x2
#define _COG3DBF_G3DBF2_SIZE                                0x1
#define _COG3DBF_G3DBF2_LENGTH                              0x1
#define _COG3DBF_G3DBF2_MASK                                0x4
#define _COG3DBF_G3DBF3_POSN                                0x3
#define _COG3DBF_G3DBF3_POSITION                            0x3
#define _COG3DBF_G3DBF3_SIZE                                0x1
#define _COG3DBF_G3DBF3_LENGTH                              0x1
#define _COG3DBF_G3DBF3_MASK                                0x8
#define _COG3DBF_G3DBF4_POSN                                0x4
#define _COG3DBF_G3DBF4_POSITION                            0x4
#define _COG3DBF_G3DBF4_SIZE                                0x1
#define _COG3DBF_G3DBF4_LENGTH                              0x1
#define _COG3DBF_G3DBF4_MASK                                0x10
#define _COG3DBF_G3DBF5_POSN                                0x5
#define _COG3DBF_G3DBF5_POSITION                            0x5
#define _COG3DBF_G3DBF5_SIZE                                0x1
#define _COG3DBF_G3DBF5_LENGTH                              0x1
#define _COG3DBF_G3DBF5_MASK                                0x20
#define _COG3DBF_G3DBF_POSN                                 0x0
#define _COG3DBF_G3DBF_POSITION                             0x0
#define _COG3DBF_G3DBF_SIZE                                 0x6
#define _COG3DBF_G3DBF_LENGTH                               0x6
#define _COG3DBF_G3DBF_MASK                                 0x3F

// Register: COG3CON0
#define COG3CON0 COG3CON0
extern volatile unsigned char           COG3CON0            __at(0x813);
#ifndef _LIB_BUILD
asm("COG3CON0 equ 0813h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MD                     :3;
        unsigned CS                     :2;
        unsigned                        :1;
        unsigned LD                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned MD0                    :1;
        unsigned MD1                    :1;
        unsigned MD2                    :1;
        unsigned CS0                    :1;
        unsigned CS1                    :1;
    };
    struct {
        unsigned G3MD                   :3;
        unsigned G3CS                   :2;
        unsigned                        :1;
        unsigned G3LD                   :1;
        unsigned G3EN                   :1;
    };
    struct {
        unsigned G3MD0                  :1;
        unsigned G3MD1                  :1;
        unsigned G3MD2                  :1;
        unsigned G3CS0                  :1;
        unsigned G3CS1                  :1;
    };
} COG3CON0bits_t;
