MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// Register: COG3STR
#define COG3STR COG3STR
extern volatile unsigned char           COG3STR             __at(0x81F);
#ifndef _LIB_BUILD
asm("COG3STR equ 081Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STRA                   :1;
        unsigned STRB                   :1;
        unsigned STRC                   :1;
        unsigned STRD                   :1;
        unsigned SDATA                  :1;
        unsigned SDATB                  :1;
        unsigned SDATC                  :1;
        unsigned SDATD                  :1;
    };
    struct {
        unsigned G3STRA                 :1;
        unsigned G3STRB                 :1;
        unsigned G3STRC                 :1;
        unsigned G3STRD                 :1;
        unsigned G3SDATA                :1;
        unsigned G3SDATB                :1;
        unsigned G3SDATC                :1;
        unsigned G3SDATD                :1;
    };
} COG3STRbits_t;
extern volatile COG3STRbits_t COG3STRbits __at(0x81F);
// bitfield macros
#define _COG3STR_STRA_POSN                                  0x0
#define _COG3STR_STRA_POSITION                              0x0
#define _COG3STR_STRA_SIZE                                  0x1
#define _COG3STR_STRA_LENGTH                                0x1
#define _COG3STR_STRA_MASK                                  0x1
#define _COG3STR_STRB_POSN                                  0x1
#define _COG3STR_STRB_POSITION                              0x1
#define _COG3STR_STRB_SIZE                                  0x1
#define _COG3STR_STRB_LENGTH                                0x1
#define _COG3STR_STRB_MASK                                  0x2
#define _COG3STR_STRC_POSN                                  0x2
#define _COG3STR_STRC_POSITION                              0x2
#define _COG3STR_STRC_SIZE                                  0x1
#define _COG3STR_STRC_LENGTH                                0x1
#define _COG3STR_STRC_MASK                                  0x4
#define _COG3STR_STRD_POSN                                  0x3
#define _COG3STR_STRD_POSITION                              0x3
#define _COG3STR_STRD_SIZE                                  0x1
#define _COG3STR_STRD_LENGTH                                0x1
#define _COG3STR_STRD_MASK                                  0x8
#define _COG3STR_SDATA_POSN                                 0x4
#define _COG3STR_SDATA_POSITION                             0x4
#define _COG3STR_SDATA_SIZE                                 0x1
#define _COG3STR_SDATA_LENGTH                               0x1
#define _COG3STR_SDATA_MASK                                 0x10
#define _COG3STR_SDATB_POSN                                 0x5
#define _COG3STR_SDATB_POSITION                             0x5
#define _COG3STR_SDATB_SIZE                                 0x1
#define _COG3STR_SDATB_LENGTH                               0x1
#define _COG3STR_SDATB_MASK                                 0x20
#define _COG3STR_SDATC_POSN                                 0x6
#define _COG3STR_SDATC_POSITION                             0x6
#define _COG3STR_SDATC_SIZE                                 0x1
#define _COG3STR_SDATC_LENGTH                               0x1
#define _COG3STR_SDATC_MASK                                 0x40
#define _COG3STR_SDATD_POSN                                 0x7
#define _COG3STR_SDATD_POSITION                             0x7
#define _COG3STR_SDATD_SIZE                                 0x1
#define _COG3STR_SDATD_LENGTH                               0x1
#define _COG3STR_SDATD_MASK                                 0x80
#define _COG3STR_G3STRA_POSN                                0x0
#define _COG3STR_G3STRA_POSITION                            0x0
#define _COG3STR_G3STRA_SIZE                                0x1
#define _COG3STR_G3STRA_LENGTH                              0x1
#define _COG3STR_G3STRA_MASK                                0x1
#define _COG3STR_G3STRB_POSN                                0x1
#define _COG3STR_G3STRB_POSITION                            0x1
#define _COG3STR_G3STRB_SIZE                                0x1
#define _COG3STR_G3STRB_LENGTH                              0x1
#define _COG3STR_G3STRB_MASK                                0x2
#define _COG3STR_G3STRC_POSN                                0x2
#define _COG3STR_G3STRC_POSITION                            0x2
#define _COG3STR_G3STRC_SIZE                                0x1
#define _COG3STR_G3STRC_LENGTH                              0x1
#define _COG3STR_G3STRC_MASK                                0x4
#define _COG3STR_G3STRD_POSN                                0x3
#define _COG3STR_G3STRD_POSITION                            0x3
#define _COG3STR_G3STRD_SIZE                                0x1
#define _COG3STR_G3STRD_LENGTH                              0x1
#define _COG3STR_G3STRD_MASK                                0x8
#define _COG3STR_G3SDATA_POSN                               0x4
#define _COG3STR_G3SDATA_POSITION                           0x4
#define _COG3STR_G3SDATA_SIZE                               0x1
#define _COG3STR_G3SDATA_LENGTH                             0x1
#define _COG3STR_G3SDATA_MASK                               0x10
#define _COG3STR_G3SDATB_POSN                               0x5
#define _COG3STR_G3SDATB_POSITION                           0x5
#define _COG3STR_G3SDATB_SIZE                               0x1
#define _COG3STR_G3SDATB_LENGTH                             0x1
#define _COG3STR_G3SDATB_MASK                               0x20
#define _COG3STR_G3SDATC_POSN                               0x6
#define _COG3STR_G3SDATC_POSITION                           0x6
#define _COG3STR_G3SDATC_SIZE                               0x1
#define _COG3STR_G3SDATC_LENGTH                             0x1
#define _COG3STR_G3SDATC_MASK                               0x40
#define _COG3STR_G3SDATD_POSN                               0x7
#define _COG3STR_G3SDATD_POSITION                           0x7
#define _COG3STR_G3SDATD_SIZE                               0x1
#define _COG3STR_G3SDATD_LENGTH                             0x1
#define _COG3STR_G3SDATD_MASK                               0x80

// Register: COG4PHR
#define COG4PHR COG4PHR
extern volatile unsigned char           COG4PHR             __at(0x88D);
#ifndef _LIB_BUILD
asm("COG4PHR equ 088Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PHR                    :6;
    };
    struct {
        unsigned PHR0                   :1;
        unsigned PHR1                   :1;
        unsigned PHR2                   :1;
        unsigned PHR3                   :1;
        unsigned PHR4                   :1;
        unsigned PHR5                   :1;
    };
    struct {
        unsigned G4PHR0                 :1;
        unsigned G4PHR1                 :1;
        unsigned G4PHR2                 :1;
        unsigned G4PHR3                 :1;
        unsigned G4PHR4                 :1;
        unsigned G4PHR5                 :1;
    };
} COG4PHRbits_t;
extern volatile COG4PHRbits_t COG4PHRbits __at(0x88D);
// bitfield macros
#define _COG4PHR_PHR_POSN                                   0x0
#define _COG4PHR_PHR_POSITION                               0x0
#define _COG4PHR_PHR_SIZE                                   0x6
#define _COG4PHR_PHR_LENGTH                                 0x6
#define _COG4PHR_PHR_MASK                                   0x3F
#define _COG4PHR_PHR0_POSN                                  0x0
#define _COG4PHR_PHR0_POSITION                              0x0
#define _COG4PHR_PHR0_SIZE                                  0x1
#define _COG4PHR_PHR0_LENGTH                                0x1
#define _COG4PHR_PHR0_MASK                                  0x1
#define _COG4PHR_PHR1_POSN                                  0x1
#define _COG4PHR_PHR1_POSITION                              0x1
#define _COG4PHR_PHR1_SIZE                                  0x1
#define _COG4PHR_PHR1_LENGTH                                0x1
#define _COG4PHR_PHR1_MASK                                  0x2
#define _COG4PHR_PHR2_POSN                                  0x2
#define _COG4PHR_PHR2_POSITION                              0x2
#define _COG4PHR_PHR2_SIZE                                  0x1
#define _COG4PHR_PHR2_LENGTH                                0x1
#define _COG4PHR_PHR2_MASK                                  0x4
#define _COG4PHR_PHR3_POSN                                  0x3
#define _COG4PHR_PHR3_POSITION                              0x3
#define _COG4PHR_PHR3_SIZE                                  0x1
#define _COG4PHR_PHR3_LENGTH                                0x1
#define _COG4PHR_PHR3_MASK                                  0x8
#define _COG4PHR_PHR4_POSN                                  0x4
#define _COG4PHR_PHR4_POSITION                              0x4
#define _COG4PHR_PHR4_SIZE                                  0x1
#define _COG4PHR_PHR4_LENGTH                                0x1
#define _COG4PHR_PHR4_MASK                                  0x10
#define _COG4PHR_PHR5_POSN                                  0x5
#define _COG4PHR_PHR5_POSITION                              0x5
#define _COG4PHR_PHR5_SIZE                                  0x1
#define _COG4PHR_PHR5_LENGTH                                0x1
#define _COG4PHR_PHR5_MASK                                  0x20
#define _COG4PHR_G4PHR0_POSN                                0x0
#define _COG4PHR_G4PHR0_POSITION                            0x0
#define _COG4PHR_G4PHR0_SIZE                                0x1
#define _COG4PHR_G4PHR0_LENGTH                              0x1
#define _COG4PHR_G4PHR0_MASK                                0x1
#define _COG4PHR_G4PHR1_POSN                                0x1
#define _COG4PHR_G4PHR1_POSITION                            0x1
#define _COG4PHR_G4PHR1_SIZE                                0x1
#define _COG4PHR_G4PHR1_LENGTH                              0x1
#define _COG4PHR_G4PHR1_MASK                                0x2
#define _COG4PHR_G4PHR2_POSN                                0x2
#define _COG4PHR_G4PHR2_POSITION                            0x2
#define _COG4PHR_G4PHR2_SIZE                                0x1
#define _COG4PHR_G4PHR2_LENGTH                              0x1
#define _COG4PHR_G4PHR2_MASK                                0x4
#define _COG4PHR_G4PHR3_POSN                                0x3
#define _COG4PHR_G4PHR3_POSITION                            0x3
#define _COG4PHR_G4PHR3_SIZE                                0x1
#define _COG4PHR_G4PHR3_LENGTH                              0x1
#define _COG4PHR_G4PHR3_MASK                                0x8
#define _COG4PHR_G4PHR4_POSN                                0x4
#define _COG4PHR_G4PHR4_POSITION                            0x4
#define _COG4PHR_G4PHR4_SIZE                                0x1
#define _COG4PHR_G4PHR4_LENGTH                              0x1
#define _COG4PHR_G4PHR4_MASK                                0x10
#define _COG4PHR_G4PHR5_POSN                                0x5
#define _COG4PHR_G4PHR5_POSITION                            0x5
#define _COG4PHR_G4PHR5_SIZE                                0x1
#define _COG4PHR_G4PHR5_LENGTH                              0x1
#define _COG4PHR_G4PHR5_MASK                                0x20

