MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// Register: COG4FSIM1
#define COG4FSIM1 COG4FSIM1
extern volatile unsigned char           COG4FSIM1           __at(0x89C);
#ifndef _LIB_BUILD
asm("COG4FSIM1 equ 089Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSIM8                  :1;
        unsigned FSIM9                  :1;
        unsigned FSIM10                 :1;
        unsigned FSIM11                 :1;
        unsigned FSIM12                 :1;
        unsigned FSIM13                 :1;
        unsigned FSIM14                 :1;
        unsigned FSIM15                 :1;
    };
    struct {
        unsigned G4FSIM8                :1;
        unsigned G4FSIM9                :1;
        unsigned G4FSIM10               :1;
        unsigned G4FSIM11               :1;
        unsigned G4FSIM12               :1;
        unsigned G4FSIM13               :1;
        unsigned G4FSIM14               :1;
        unsigned G4FSIM15               :1;
    };
} COG4FSIM1bits_t;
extern volatile COG4FSIM1bits_t COG4FSIM1bits __at(0x89C);
// bitfield macros
#define _COG4FSIM1_FSIM8_POSN                               0x0
#define _COG4FSIM1_FSIM8_POSITION                           0x0
#define _COG4FSIM1_FSIM8_SIZE                               0x1
#define _COG4FSIM1_FSIM8_LENGTH                             0x1
#define _COG4FSIM1_FSIM8_MASK                               0x1
#define _COG4FSIM1_FSIM9_POSN                               0x1
#define _COG4FSIM1_FSIM9_POSITION                           0x1
#define _COG4FSIM1_FSIM9_SIZE                               0x1
#define _COG4FSIM1_FSIM9_LENGTH                             0x1
#define _COG4FSIM1_FSIM9_MASK                               0x2
#define _COG4FSIM1_FSIM10_POSN                              0x2
#define _COG4FSIM1_FSIM10_POSITION                          0x2
#define _COG4FSIM1_FSIM10_SIZE                              0x1
#define _COG4FSIM1_FSIM10_LENGTH                            0x1
#define _COG4FSIM1_FSIM10_MASK                              0x4
#define _COG4FSIM1_FSIM11_POSN                              0x3
#define _COG4FSIM1_FSIM11_POSITION                          0x3
#define _COG4FSIM1_FSIM11_SIZE                              0x1
#define _COG4FSIM1_FSIM11_LENGTH                            0x1
#define _COG4FSIM1_FSIM11_MASK                              0x8
#define _COG4FSIM1_FSIM12_POSN                              0x4
#define _COG4FSIM1_FSIM12_POSITION                          0x4
#define _COG4FSIM1_FSIM12_SIZE                              0x1
#define _COG4FSIM1_FSIM12_LENGTH                            0x1
#define _COG4FSIM1_FSIM12_MASK                              0x10
#define _COG4FSIM1_FSIM13_POSN                              0x5
#define _COG4FSIM1_FSIM13_POSITION                          0x5
#define _COG4FSIM1_FSIM13_SIZE                              0x1
#define _COG4FSIM1_FSIM13_LENGTH                            0x1
#define _COG4FSIM1_FSIM13_MASK                              0x20
#define _COG4FSIM1_FSIM14_POSN                              0x6
#define _COG4FSIM1_FSIM14_POSITION                          0x6
#define _COG4FSIM1_FSIM14_SIZE                              0x1
#define _COG4FSIM1_FSIM14_LENGTH                            0x1
#define _COG4FSIM1_FSIM14_MASK                              0x40
#define _COG4FSIM1_FSIM15_POSN                              0x7
#define _COG4FSIM1_FSIM15_POSITION                          0x7
#define _COG4FSIM1_FSIM15_SIZE                              0x1
#define _COG4FSIM1_FSIM15_LENGTH                            0x1
#define _COG4FSIM1_FSIM15_MASK                              0x80
#define _COG4FSIM1_G4FSIM8_POSN                             0x0
#define _COG4FSIM1_G4FSIM8_POSITION                         0x0
#define _COG4FSIM1_G4FSIM8_SIZE                             0x1
#define _COG4FSIM1_G4FSIM8_LENGTH                           0x1
#define _COG4FSIM1_G4FSIM8_MASK                             0x1
#define _COG4FSIM1_G4FSIM9_POSN                             0x1
#define _COG4FSIM1_G4FSIM9_POSITION                         0x1
#define _COG4FSIM1_G4FSIM9_SIZE                             0x1
#define _COG4FSIM1_G4FSIM9_LENGTH                           0x1
#define _COG4FSIM1_G4FSIM9_MASK                             0x2
#define _COG4FSIM1_G4FSIM10_POSN                            0x2
#define _COG4FSIM1_G4FSIM10_POSITION                        0x2
#define _COG4FSIM1_G4FSIM10_SIZE                            0x1
#define _COG4FSIM1_G4FSIM10_LENGTH                          0x1
#define _COG4FSIM1_G4FSIM10_MASK                            0x4
#define _COG4FSIM1_G4FSIM11_POSN                            0x3
#define _COG4FSIM1_G4FSIM11_POSITION                        0x3
#define _COG4FSIM1_G4FSIM11_SIZE                            0x1
#define _COG4FSIM1_G4FSIM11_LENGTH                          0x1
#define _COG4FSIM1_G4FSIM11_MASK                            0x8
#define _COG4FSIM1_G4FSIM12_POSN                            0x4
#define _COG4FSIM1_G4FSIM12_POSITION                        0x4
#define _COG4FSIM1_G4FSIM12_SIZE                            0x1
#define _COG4FSIM1_G4FSIM12_LENGTH                          0x1
#define _COG4FSIM1_G4FSIM12_MASK                            0x10
#define _COG4FSIM1_G4FSIM13_POSN                            0x5
#define _COG4FSIM1_G4FSIM13_POSITION                        0x5
#define _COG4FSIM1_G4FSIM13_SIZE                            0x1
#define _COG4FSIM1_G4FSIM13_LENGTH                          0x1
#define _COG4FSIM1_G4FSIM13_MASK                            0x20
#define _COG4FSIM1_G4FSIM14_POSN                            0x6
#define _COG4FSIM1_G4FSIM14_POSITION                        0x6
#define _COG4FSIM1_G4FSIM14_SIZE                            0x1
#define _COG4FSIM1_G4FSIM14_LENGTH                          0x1
#define _COG4FSIM1_G4FSIM14_MASK                            0x40
#define _COG4FSIM1_G4FSIM15_POSN                            0x7
#define _COG4FSIM1_G4FSIM15_POSITION                        0x7
#define _COG4FSIM1_G4FSIM15_SIZE                            0x1
#define _COG4FSIM1_G4FSIM15_LENGTH                          0x1
#define _COG4FSIM1_G4FSIM15_MASK                            0x80

