MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile CM4CON0bits_t CM4CON0bits __at(0x90C);
// bitfield macros
#define _CM4CON0_SYNC_POSN                                  0x0
#define _CM4CON0_SYNC_POSITION                              0x0
#define _CM4CON0_SYNC_SIZE                                  0x1
#define _CM4CON0_SYNC_LENGTH                                0x1
#define _CM4CON0_SYNC_MASK                                  0x1
#define _CM4CON0_HYS_POSN                                   0x1
#define _CM4CON0_HYS_POSITION                               0x1
#define _CM4CON0_HYS_SIZE                                   0x1
#define _CM4CON0_HYS_LENGTH                                 0x1
#define _CM4CON0_HYS_MASK                                   0x2
#define _CM4CON0_ZLF_POSN                                   0x3
#define _CM4CON0_ZLF_POSITION                               0x3
#define _CM4CON0_ZLF_SIZE                                   0x1
#define _CM4CON0_ZLF_LENGTH                                 0x1
#define _CM4CON0_ZLF_MASK                                   0x8
#define _CM4CON0_POL_POSN                                   0x4
#define _CM4CON0_POL_POSITION                               0x4
#define _CM4CON0_POL_SIZE                                   0x1
#define _CM4CON0_POL_LENGTH                                 0x1
#define _CM4CON0_POL_MASK                                   0x10
#define _CM4CON0_OUT_POSN                                   0x6
#define _CM4CON0_OUT_POSITION                               0x6
#define _CM4CON0_OUT_SIZE                                   0x1
#define _CM4CON0_OUT_LENGTH                                 0x1
#define _CM4CON0_OUT_MASK                                   0x40
#define _CM4CON0_ON_POSN                                    0x7
#define _CM4CON0_ON_POSITION                                0x7
#define _CM4CON0_ON_SIZE                                    0x1
#define _CM4CON0_ON_LENGTH                                  0x1
#define _CM4CON0_ON_MASK                                    0x80
#define _CM4CON0_C4SYNC_POSN                                0x0
#define _CM4CON0_C4SYNC_POSITION                            0x0
#define _CM4CON0_C4SYNC_SIZE                                0x1
#define _CM4CON0_C4SYNC_LENGTH                              0x1
#define _CM4CON0_C4SYNC_MASK                                0x1
#define _CM4CON0_C4HYS_POSN                                 0x1
#define _CM4CON0_C4HYS_POSITION                             0x1
#define _CM4CON0_C4HYS_SIZE                                 0x1
#define _CM4CON0_C4HYS_LENGTH                               0x1
#define _CM4CON0_C4HYS_MASK                                 0x2
#define _CM4CON0_C4ZLF_POSN                                 0x3
#define _CM4CON0_C4ZLF_POSITION                             0x3
#define _CM4CON0_C4ZLF_SIZE                                 0x1
#define _CM4CON0_C4ZLF_LENGTH                               0x1
#define _CM4CON0_C4ZLF_MASK                                 0x8
#define _CM4CON0_C4POL_POSN                                 0x4
#define _CM4CON0_C4POL_POSITION                             0x4
#define _CM4CON0_C4POL_SIZE                                 0x1
#define _CM4CON0_C4POL_LENGTH                               0x1
#define _CM4CON0_C4POL_MASK                                 0x10
#define _CM4CON0_C4OUT_POSN                                 0x6
#define _CM4CON0_C4OUT_POSITION                             0x6
#define _CM4CON0_C4OUT_SIZE                                 0x1
#define _CM4CON0_C4OUT_LENGTH                               0x1
#define _CM4CON0_C4OUT_MASK                                 0x40
#define _CM4CON0_C4ON_POSN                                  0x7
#define _CM4CON0_C4ON_POSITION                              0x7
#define _CM4CON0_C4ON_SIZE                                  0x1
#define _CM4CON0_C4ON_LENGTH                                0x1
#define _CM4CON0_C4ON_MASK                                  0x80

// Register: CM4CON1
#define CM4CON1 CM4CON1
extern volatile unsigned char           CM4CON1             __at(0x90D);
#ifndef _LIB_BUILD
asm("CM4CON1 equ 090Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C4INTN                 :1;
        unsigned C4INTP                 :1;
    };
} CM4CON1bits_t;
extern volatile CM4CON1bits_t CM4CON1bits __at(0x90D);
// bitfield macros
#define _CM4CON1_INTN_POSN                                  0x0
#define _CM4CON1_INTN_POSITION                              0x0
#define _CM4CON1_INTN_SIZE                                  0x1
#define _CM4CON1_INTN_LENGTH                                0x1
#define _CM4CON1_INTN_MASK                                  0x1
#define _CM4CON1_INTP_POSN                                  0x1
#define _CM4CON1_INTP_POSITION                              0x1
#define _CM4CON1_INTP_SIZE                                  0x1
#define _CM4CON1_INTP_LENGTH                                0x1
#define _CM4CON1_INTP_MASK                                  0x2
#define _CM4CON1_C4INTN_POSN                                0x0
#define _CM4CON1_C4INTN_POSITION                            0x0
#define _CM4CON1_C4INTN_SIZE                                0x1
#define _CM4CON1_C4INTN_LENGTH                              0x1
#define _CM4CON1_C4INTN_MASK                                0x1
#define _CM4CON1_C4INTP_POSN                                0x1
#define _CM4CON1_C4INTP_POSITION                            0x1
#define _CM4CON1_C4INTP_SIZE                                0x1
#define _CM4CON1_C4INTP_LENGTH                              0x1
#define _CM4CON1_C4INTP_MASK                                0x2

// Register: CM4NSEL
#define CM4NSEL CM4NSEL
extern volatile unsigned char           CM4NSEL             __at(0x90E);
#ifndef _LIB_BUILD
asm("CM4NSEL equ 090Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :4;
    };
    struct {
        unsigned C4NCH                  :4;
    };
    struct {
        unsigned C4NCH0                 :1;
        unsigned C4NCH1                 :1;
        unsigned C4NCH2                 :1;
        unsigned C4NCH3                 :1;
    };
} CM4NSELbits_t;
