MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile CM6PSELbits_t CM6PSELbits __at(0x917);
// bitfield macros
#define _CM6PSEL_PCH_POSN                                   0x0
#define _CM6PSEL_PCH_POSITION                               0x0
#define _CM6PSEL_PCH_SIZE                                   0x4
#define _CM6PSEL_PCH_LENGTH                                 0x4
#define _CM6PSEL_PCH_MASK                                   0xF
#define _CM6PSEL_PCH0_POSN                                  0x0
#define _CM6PSEL_PCH0_POSITION                              0x0
#define _CM6PSEL_PCH0_SIZE                                  0x1
#define _CM6PSEL_PCH0_LENGTH                                0x1
#define _CM6PSEL_PCH0_MASK                                  0x1
#define _CM6PSEL_PCH1_POSN                                  0x1
#define _CM6PSEL_PCH1_POSITION                              0x1
#define _CM6PSEL_PCH1_SIZE                                  0x1
#define _CM6PSEL_PCH1_LENGTH                                0x1
#define _CM6PSEL_PCH1_MASK                                  0x2
#define _CM6PSEL_PCH2_POSN                                  0x2
#define _CM6PSEL_PCH2_POSITION                              0x2
#define _CM6PSEL_PCH2_SIZE                                  0x1
#define _CM6PSEL_PCH2_LENGTH                                0x1
#define _CM6PSEL_PCH2_MASK                                  0x4
#define _CM6PSEL_PCH3_POSN                                  0x3
#define _CM6PSEL_PCH3_POSITION                              0x3
#define _CM6PSEL_PCH3_SIZE                                  0x1
#define _CM6PSEL_PCH3_LENGTH                                0x1
#define _CM6PSEL_PCH3_MASK                                  0x8
#define _CM6PSEL_C6PCH_POSN                                 0x0
#define _CM6PSEL_C6PCH_POSITION                             0x0
#define _CM6PSEL_C6PCH_SIZE                                 0x4
#define _CM6PSEL_C6PCH_LENGTH                               0x4
#define _CM6PSEL_C6PCH_MASK                                 0xF
#define _CM6PSEL_C6PCH0_POSN                                0x0
#define _CM6PSEL_C6PCH0_POSITION                            0x0
#define _CM6PSEL_C6PCH0_SIZE                                0x1
#define _CM6PSEL_C6PCH0_LENGTH                              0x1
#define _CM6PSEL_C6PCH0_MASK                                0x1
#define _CM6PSEL_C6PCH1_POSN                                0x1
#define _CM6PSEL_C6PCH1_POSITION                            0x1
#define _CM6PSEL_C6PCH1_SIZE                                0x1
#define _CM6PSEL_C6PCH1_LENGTH                              0x1
#define _CM6PSEL_C6PCH1_MASK                                0x2
#define _CM6PSEL_C6PCH2_POSN                                0x2
#define _CM6PSEL_C6PCH2_POSITION                            0x2
#define _CM6PSEL_C6PCH2_SIZE                                0x1
#define _CM6PSEL_C6PCH2_LENGTH                              0x1
#define _CM6PSEL_C6PCH2_MASK                                0x4
#define _CM6PSEL_C6PCH3_POSN                                0x3
#define _CM6PSEL_C6PCH3_POSITION                            0x3
#define _CM6PSEL_C6PCH3_SIZE                                0x1
#define _CM6PSEL_C6PCH3_LENGTH                              0x1
#define _CM6PSEL_C6PCH3_MASK                                0x8

// Register: CM7CON0
#define CM7CON0 CM7CON0
extern volatile unsigned char           CM7CON0             __at(0x918);
#ifndef _LIB_BUILD
asm("CM7CON0 equ 0918h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C7SYNC                 :1;
        unsigned C7HYS                  :1;
        unsigned                        :1;
        unsigned C7ZLF                  :1;
        unsigned C7POL                  :1;
        unsigned                        :1;
        unsigned C7OUT                  :1;
        unsigned C7ON                   :1;
    };
} CM7CON0bits_t;
extern volatile CM7CON0bits_t CM7CON0bits __at(0x918);
// bitfield macros
#define _CM7CON0_SYNC_POSN                                  0x0
#define _CM7CON0_SYNC_POSITION                              0x0
#define _CM7CON0_SYNC_SIZE                                  0x1
#define _CM7CON0_SYNC_LENGTH                                0x1
#define _CM7CON0_SYNC_MASK                                  0x1
#define _CM7CON0_HYS_POSN                                   0x1
#define _CM7CON0_HYS_POSITION                               0x1
#define _CM7CON0_HYS_SIZE                                   0x1
#define _CM7CON0_HYS_LENGTH                                 0x1
#define _CM7CON0_HYS_MASK                                   0x2
#define _CM7CON0_ZLF_POSN                                   0x3
#define _CM7CON0_ZLF_POSITION                               0x3
#define _CM7CON0_ZLF_SIZE                                   0x1
#define _CM7CON0_ZLF_LENGTH                                 0x1
#define _CM7CON0_ZLF_MASK                                   0x8
#define _CM7CON0_POL_POSN                                   0x4
#define _CM7CON0_POL_POSITION                               0x4
#define _CM7CON0_POL_SIZE                                   0x1
#define _CM7CON0_POL_LENGTH                                 0x1
#define _CM7CON0_POL_MASK                                   0x10
#define _CM7CON0_OUT_POSN                                   0x6
#define _CM7CON0_OUT_POSITION                               0x6
#define _CM7CON0_OUT_SIZE                                   0x1
#define _CM7CON0_OUT_LENGTH                                 0x1
#define _CM7CON0_OUT_MASK                                   0x40
#define _CM7CON0_ON_POSN                                    0x7
#define _CM7CON0_ON_POSITION                                0x7
#define _CM7CON0_ON_SIZE                                    0x1
#define _CM7CON0_ON_LENGTH                                  0x1
#define _CM7CON0_ON_MASK                                    0x80
#define _CM7CON0_C7SYNC_POSN                                0x0
#define _CM7CON0_C7SYNC_POSITION                            0x0
#define _CM7CON0_C7SYNC_SIZE                                0x1
#define _CM7CON0_C7SYNC_LENGTH                              0x1
#define _CM7CON0_C7SYNC_MASK                                0x1
#define _CM7CON0_C7HYS_POSN                                 0x1
#define _CM7CON0_C7HYS_POSITION                             0x1
#define _CM7CON0_C7HYS_SIZE                                 0x1
#define _CM7CON0_C7HYS_LENGTH                               0x1
#define _CM7CON0_C7HYS_MASK                                 0x2
#define _CM7CON0_C7ZLF_POSN                                 0x3
#define _CM7CON0_C7ZLF_POSITION                             0x3
#define _CM7CON0_C7ZLF_SIZE                                 0x1
#define _CM7CON0_C7ZLF_LENGTH                               0x1
#define _CM7CON0_C7ZLF_MASK                                 0x8
#define _CM7CON0_C7POL_POSN                                 0x4
#define _CM7CON0_C7POL_POSITION                             0x4
#define _CM7CON0_C7POL_SIZE                                 0x1
#define _CM7CON0_C7POL_LENGTH                               0x1
#define _CM7CON0_C7POL_MASK                                 0x10
#define _CM7CON0_C7OUT_POSN                                 0x6
#define _CM7CON0_C7OUT_POSITION                             0x6
#define _CM7CON0_C7OUT_SIZE                                 0x1
#define _CM7CON0_C7OUT_LENGTH                               0x1
#define _CM7CON0_C7OUT_MASK                                 0x40
#define _CM7CON0_C7ON_POSN                                  0x7
#define _CM7CON0_C7ON_POSITION                              0x7
#define _CM7CON0_C7ON_SIZE                                  0x1
#define _CM7CON0_C7ON_LENGTH                                0x1
#define _CM7CON0_C7ON_MASK                                  0x80

// Register: CM7CON1
#define CM7CON1 CM7CON1
extern volatile unsigned char           CM7CON1             __at(0x919);
#ifndef _LIB_BUILD
asm("CM7CON1 equ 0919h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
    };
    struct {
        unsigned C7INTN                 :1;
        unsigned C7INTP                 :1;
    };
} CM7CON1bits_t;
extern volatile CM7CON1bits_t CM7CON1bits __at(0x919);
// bitfield macros
#define _CM7CON1_INTN_POSN                                  0x0
#define _CM7CON1_INTN_POSITION                              0x0
#define _CM7CON1_INTN_SIZE                                  0x1
#define _CM7CON1_INTN_LENGTH                                0x1
#define _CM7CON1_INTN_MASK                                  0x1
#define _CM7CON1_INTP_POSN                                  0x1
#define _CM7CON1_INTP_POSITION                              0x1
#define _CM7CON1_INTP_SIZE                                  0x1
#define _CM7CON1_INTP_LENGTH                                0x1
#define _CM7CON1_INTP_MASK                                  0x2
#define _CM7CON1_C7INTN_POSN                                0x0
#define _CM7CON1_C7INTN_POSITION                            0x0
#define _CM7CON1_C7INTN_SIZE                                0x1
#define _CM7CON1_C7INTN_LENGTH                              0x1
#define _CM7CON1_C7INTN_MASK                                0x1
#define _CM7CON1_C7INTP_POSN                                0x1
#define _CM7CON1_C7INTP_POSITION                            0x1
#define _CM7CON1_C7INTP_SIZE                                0x1
#define _CM7CON1_C7INTP_LENGTH                              0x1
#define _CM7CON1_C7INTP_MASK                                0x2

// Register: CM7NSEL
#define CM7NSEL CM7NSEL
extern volatile unsigned char           CM7NSEL             __at(0x91A);
#ifndef _LIB_BUILD
asm("CM7NSEL equ 091Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCH                    :4;
    };
    struct {
        unsigned C7NCH                  :4;
    };
    struct {
        unsigned C7NCH0                 :1;
        unsigned C7NCH1                 :1;
        unsigned C7NCH2                 :1;
        unsigned C7NCH3                 :1;
    };
} CM7NSELbits_t;
extern volatile CM7NSELbits_t CM7NSELbits __at(0x91A);
// bitfield macros
#define _CM7NSEL_NCH_POSN                                   0x0
#define _CM7NSEL_NCH_POSITION                               0x0
#define _CM7NSEL_NCH_SIZE                                   0x4
#define _CM7NSEL_NCH_LENGTH                                 0x4
#define _CM7NSEL_NCH_MASK                                   0xF
#define _CM7NSEL_C7NCH_POSN                                 0x0
#define _CM7NSEL_C7NCH_POSITION                             0x0
#define _CM7NSEL_C7NCH_SIZE                                 0x4
#define _CM7NSEL_C7NCH_LENGTH                               0x4
#define _CM7NSEL_C7NCH_MASK                                 0xF
#define _CM7NSEL_C7NCH0_POSN                                0x0
#define _CM7NSEL_C7NCH0_POSITION                            0x0
#define _CM7NSEL_C7NCH0_SIZE                                0x1
#define _CM7NSEL_C7NCH0_LENGTH                              0x1
#define _CM7NSEL_C7NCH0_MASK                                0x1
#define _CM7NSEL_C7NCH1_POSN                                0x1
#define _CM7NSEL_C7NCH1_POSITION                            0x1
#define _CM7NSEL_C7NCH1_SIZE                                0x1
#define _CM7NSEL_C7NCH1_LENGTH                              0x1
#define _CM7NSEL_C7NCH1_MASK                                0x2
#define _CM7NSEL_C7NCH2_POSN                                0x2
#define _CM7NSEL_C7NCH2_POSITION                            0x2
#define _CM7NSEL_C7NCH2_SIZE                                0x1
#define _CM7NSEL_C7NCH2_LENGTH                              0x1
#define _CM7NSEL_C7NCH2_MASK                                0x4
#define _CM7NSEL_C7NCH3_POSN                                0x3
#define _CM7NSEL_C7NCH3_POSITION                            0x3
#define _CM7NSEL_C7NCH3_SIZE                                0x1
#define _CM7NSEL_C7NCH3_LENGTH                              0x1
#define _CM7NSEL_C7NCH3_MASK                                0x8

// Register: CM7PSEL
#define CM7PSEL CM7PSEL
extern volatile unsigned char           CM7PSEL             __at(0x91B);
#ifndef _LIB_BUILD
asm("CM7PSEL equ 091Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCH                    :4;
    };
    struct {
        unsigned PCH0                   :1;
        unsigned PCH1                   :1;
        unsigned PCH2                   :1;
        unsigned PCH3                   :1;
    };
    struct {
        unsigned C7PCH                  :4;
    };
    struct {
        unsigned C7PCH0                 :1;
        unsigned C7PCH1                 :1;
        unsigned C7PCH2                 :1;
        unsigned C7PCH3                 :1;
    };
} CM7PSELbits_t;
extern volatile CM7PSELbits_t CM7PSELbits __at(0x91B);
// bitfield macros
#define _CM7PSEL_PCH_POSN                                   0x0
#define _CM7PSEL_PCH_POSITION                               0x0
#define _CM7PSEL_PCH_SIZE                                   0x4
#define _CM7PSEL_PCH_LENGTH                                 0x4
#define _CM7PSEL_PCH_MASK                                   0xF
#define _CM7PSEL_PCH0_POSN                                  0x0
#define _CM7PSEL_PCH0_POSITION                              0x0
#define _CM7PSEL_PCH0_SIZE                                  0x1
#define _CM7PSEL_PCH0_LENGTH                                0x1
#define _CM7PSEL_PCH0_MASK                                  0x1
#define _CM7PSEL_PCH1_POSN                                  0x1
#define _CM7PSEL_PCH1_POSITION                              0x1
#define _CM7PSEL_PCH1_SIZE                                  0x1
#define _CM7PSEL_PCH1_LENGTH                                0x1
#define _CM7PSEL_PCH1_MASK                                  0x2
#define _CM7PSEL_PCH2_POSN                                  0x2
#define _CM7PSEL_PCH2_POSITION                              0x2
#define _CM7PSEL_PCH2_SIZE                                  0x1
#define _CM7PSEL_PCH2_LENGTH                                0x1
#define _CM7PSEL_PCH2_MASK                                  0x4
#define _CM7PSEL_PCH3_POSN                                  0x3
#define _CM7PSEL_PCH3_POSITION                              0x3
#define _CM7PSEL_PCH3_SIZE                                  0x1
#define _CM7PSEL_PCH3_LENGTH                                0x1
#define _CM7PSEL_PCH3_MASK                                  0x8
#define _CM7PSEL_C7PCH_POSN                                 0x0
#define _CM7PSEL_C7PCH_POSITION                             0x0
#define _CM7PSEL_C7PCH_SIZE                                 0x4
#define _CM7PSEL_C7PCH_LENGTH                               0x4
#define _CM7PSEL_C7PCH_MASK                                 0xF
#define _CM7PSEL_C7PCH0_POSN                                0x0
#define _CM7PSEL_C7PCH0_POSITION                            0x0
#define _CM7PSEL_C7PCH0_SIZE                                0x1
#define _CM7PSEL_C7PCH0_LENGTH                              0x1
#define _CM7PSEL_C7PCH0_MASK                                0x1
#define _CM7PSEL_C7PCH1_POSN                                0x1
#define _CM7PSEL_C7PCH1_POSITION                            0x1
#define _CM7PSEL_C7PCH1_SIZE                                0x1
#define _CM7PSEL_C7PCH1_LENGTH                              0x1
#define _CM7PSEL_C7PCH1_MASK                                0x2
#define _CM7PSEL_C7PCH2_POSN                                0x2
#define _CM7PSEL_C7PCH2_POSITION                            0x2
#define _CM7PSEL_C7PCH2_SIZE                                0x1
#define _CM7PSEL_C7PCH2_LENGTH                              0x1
#define _CM7PSEL_C7PCH2_MASK                                0x4
#define _CM7PSEL_C7PCH3_POSN                                0x3
#define _CM7PSEL_C7PCH3_POSITION                            0x3
#define _CM7PSEL_C7PCH3_SIZE                                0x1
#define _CM7PSEL_C7PCH3_LENGTH                              0x1
#define _CM7PSEL_C7PCH3_MASK                                0x8

// Register: CM8CON0
#define CM8CON0 CM8CON0
extern volatile unsigned char           CM8CON0             __at(0x91C);
#ifndef _LIB_BUILD
asm("CM8CON0 equ 091Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SYNC                   :1;
        unsigned HYS                    :1;
        unsigned                        :1;
        unsigned ZLF                    :1;
        unsigned POL                    :1;
        unsigned                        :1;
        unsigned OUT                    :1;
        unsigned ON                     :1;
    };
    struct {
        unsigned C8SYNC                 :1;
        unsigned C8HYS                  :1;
        unsigned                        :1;
        unsigned C8ZLF                  :1;
        unsigned C8POL                  :1;
        unsigned                        :1;
        unsigned C8OUT                  :1;
        unsigned C8ON                   :1;
    };
} CM8CON0bits_t;
extern volatile CM8CON0bits_t CM8CON0bits __at(0x91C);
// bitfield macros
#define _CM8CON0_SYNC_POSN                                  0x0
#define _CM8CON0_SYNC_POSITION                              0x0
#define _CM8CON0_SYNC_SIZE                                  0x1
#define _CM8CON0_SYNC_LENGTH                                0x1
#define _CM8CON0_SYNC_MASK                                  0x1
#define _CM8CON0_HYS_POSN                                   0x1
#define _CM8CON0_HYS_POSITION                               0x1
#define _CM8CON0_HYS_SIZE                                   0x1
#define _CM8CON0_HYS_LENGTH                                 0x1
#define _CM8CON0_HYS_MASK                                   0x2
#define _CM8CON0_ZLF_POSN                                   0x3
#define _CM8CON0_ZLF_POSITION                               0x3
#define _CM8CON0_ZLF_SIZE                                   0x1
#define _CM8CON0_ZLF_LENGTH                                 0x1
#define _CM8CON0_ZLF_MASK                                   0x8
#define _CM8CON0_POL_POSN                                   0x4
#define _CM8CON0_POL_POSITION                               0x4
#define _CM8CON0_POL_SIZE                                   0x1
#define _CM8CON0_POL_LENGTH                                 0x1
#define _CM8CON0_POL_MASK                                   0x10
#define _CM8CON0_OUT_POSN                                   0x6
#define _CM8CON0_OUT_POSITION                               0x6
#define _CM8CON0_OUT_SIZE                                   0x1
#define _CM8CON0_OUT_LENGTH                                 0x1
#define _CM8CON0_OUT_MASK                                   0x40
#define _CM8CON0_ON_POSN                                    0x7
#define _CM8CON0_ON_POSITION                                0x7
#define _CM8CON0_ON_SIZE                                    0x1
#define _CM8CON0_ON_LENGTH                                  0x1
#define _CM8CON0_ON_MASK                                    0x80
#define _CM8CON0_C8SYNC_POSN                                0x0
#define _CM8CON0_C8SYNC_POSITION                            0x0
#define _CM8CON0_C8SYNC_SIZE                                0x1
#define _CM8CON0_C8SYNC_LENGTH                              0x1
#define _CM8CON0_C8SYNC_MASK                                0x1
#define _CM8CON0_C8HYS_POSN                                 0x1
#define _CM8CON0_C8HYS_POSITION                             0x1
#define _CM8CON0_C8HYS_SIZE                                 0x1
#define _CM8CON0_C8HYS_LENGTH                               0x1
#define _CM8CON0_C8HYS_MASK                                 0x2
#define _CM8CON0_C8ZLF_POSN                                 0x3
#define _CM8CON0_C8ZLF_POSITION                             0x3
#define _CM8CON0_C8ZLF_SIZE                                 0x1
#define _CM8CON0_C8ZLF_LENGTH                               0x1
#define _CM8CON0_C8ZLF_MASK                                 0x8
#define _CM8CON0_C8POL_POSN                                 0x4
#define _CM8CON0_C8POL_POSITION                             0x4
#define _CM8CON0_C8POL_SIZE                                 0x1
#define _CM8CON0_C8POL_LENGTH                               0x1
#define _CM8CON0_C8POL_MASK                                 0x10
#define _CM8CON0_C8OUT_POSN                                 0x6
#define _CM8CON0_C8OUT_POSITION                             0x6
#define _CM8CON0_C8OUT_SIZE                                 0x1
#define _CM8CON0_C8OUT_LENGTH                               0x1
#define _CM8CON0_C8OUT_MASK                                 0x40
#define _CM8CON0_C8ON_POSN                                  0x7
#define _CM8CON0_C8ON_POSITION                              0x7
#define _CM8CON0_C8ON_SIZE                                  0x1
#define _CM8CON0_C8ON_LENGTH                                0x1
#define _CM8CON0_C8ON_MASK                                  0x80

