MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
extern volatile PWM6CLKCONbits_t PWM6CLKCONbits __at(0xDAE);
// bitfield macros
#define _PWM6CLKCON_CS_POSN                                 0x0
#define _PWM6CLKCON_CS_POSITION                             0x0
#define _PWM6CLKCON_CS_SIZE                                 0x2
#define _PWM6CLKCON_CS_LENGTH                               0x2
#define _PWM6CLKCON_CS_MASK                                 0x3
#define _PWM6CLKCON_PS_POSN                                 0x4
#define _PWM6CLKCON_PS_POSITION                             0x4
#define _PWM6CLKCON_PS_SIZE                                 0x3
#define _PWM6CLKCON_PS_LENGTH                               0x3
#define _PWM6CLKCON_PS_MASK                                 0x70
#define _PWM6CLKCON_PWM6CS0_POSN                            0x0
#define _PWM6CLKCON_PWM6CS0_POSITION                        0x0
#define _PWM6CLKCON_PWM6CS0_SIZE                            0x1
#define _PWM6CLKCON_PWM6CS0_LENGTH                          0x1
#define _PWM6CLKCON_PWM6CS0_MASK                            0x1
#define _PWM6CLKCON_PWM6CS1_POSN                            0x1
#define _PWM6CLKCON_PWM6CS1_POSITION                        0x1
#define _PWM6CLKCON_PWM6CS1_SIZE                            0x1
#define _PWM6CLKCON_PWM6CS1_LENGTH                          0x1
#define _PWM6CLKCON_PWM6CS1_MASK                            0x2
#define _PWM6CLKCON_PWM6CS2_POSN                            0x2
#define _PWM6CLKCON_PWM6CS2_POSITION                        0x2
#define _PWM6CLKCON_PWM6CS2_SIZE                            0x1
#define _PWM6CLKCON_PWM6CS2_LENGTH                          0x1
#define _PWM6CLKCON_PWM6CS2_MASK                            0x4
#define _PWM6CLKCON_PWM6PS0_POSN                            0x4
#define _PWM6CLKCON_PWM6PS0_POSITION                        0x4
#define _PWM6CLKCON_PWM6PS0_SIZE                            0x1
#define _PWM6CLKCON_PWM6PS0_LENGTH                          0x1
#define _PWM6CLKCON_PWM6PS0_MASK                            0x10
#define _PWM6CLKCON_PWM6PS1_POSN                            0x5
#define _PWM6CLKCON_PWM6PS1_POSITION                        0x5
#define _PWM6CLKCON_PWM6PS1_SIZE                            0x1
#define _PWM6CLKCON_PWM6PS1_LENGTH                          0x1
#define _PWM6CLKCON_PWM6PS1_MASK                            0x20
#define _PWM6CLKCON_PWM6PS2_POSN                            0x6
#define _PWM6CLKCON_PWM6PS2_POSITION                        0x6
#define _PWM6CLKCON_PWM6PS2_SIZE                            0x1
#define _PWM6CLKCON_PWM6PS2_LENGTH                          0x1
#define _PWM6CLKCON_PWM6PS2_MASK                            0x40
#define _PWM6CLKCON_PWM6CS_POSN                             0x0
#define _PWM6CLKCON_PWM6CS_POSITION                         0x0
#define _PWM6CLKCON_PWM6CS_SIZE                             0x3
#define _PWM6CLKCON_PWM6CS_LENGTH                           0x3
#define _PWM6CLKCON_PWM6CS_MASK                             0x7
#define _PWM6CLKCON_PWM6PS_POSN                             0x4
#define _PWM6CLKCON_PWM6PS_POSITION                         0x4
#define _PWM6CLKCON_PWM6PS_SIZE                             0x3
#define _PWM6CLKCON_PWM6PS_LENGTH                           0x3
#define _PWM6CLKCON_PWM6PS_MASK                             0x70
#define _PWM6CLKCON_CS0_POSN                                0x0
#define _PWM6CLKCON_CS0_POSITION                            0x0
#define _PWM6CLKCON_CS0_SIZE                                0x1
#define _PWM6CLKCON_CS0_LENGTH                              0x1
#define _PWM6CLKCON_CS0_MASK                                0x1
#define _PWM6CLKCON_CS1_POSN                                0x1
#define _PWM6CLKCON_CS1_POSITION                            0x1
#define _PWM6CLKCON_CS1_SIZE                                0x1
#define _PWM6CLKCON_CS1_LENGTH                              0x1
#define _PWM6CLKCON_CS1_MASK                                0x2
#define _PWM6CLKCON_CS2_POSN                                0x2
#define _PWM6CLKCON_CS2_POSITION                            0x2
#define _PWM6CLKCON_CS2_SIZE                                0x1
#define _PWM6CLKCON_CS2_LENGTH                              0x1
#define _PWM6CLKCON_CS2_MASK                                0x4
#define _PWM6CLKCON_PS0_POSN                                0x4
#define _PWM6CLKCON_PS0_POSITION                            0x4
#define _PWM6CLKCON_PS0_SIZE                                0x1
#define _PWM6CLKCON_PS0_LENGTH                              0x1
#define _PWM6CLKCON_PS0_MASK                                0x10
#define _PWM6CLKCON_PS1_POSN                                0x5
#define _PWM6CLKCON_PS1_POSITION                            0x5
#define _PWM6CLKCON_PS1_SIZE                                0x1
#define _PWM6CLKCON_PS1_LENGTH                              0x1
#define _PWM6CLKCON_PS1_MASK                                0x20
#define _PWM6CLKCON_PS2_POSN                                0x6
#define _PWM6CLKCON_PS2_POSITION                            0x6
#define _PWM6CLKCON_PS2_SIZE                                0x1
#define _PWM6CLKCON_PS2_LENGTH                              0x1
#define _PWM6CLKCON_PS2_MASK                                0x40

// Register: PWM6LDCON
#define PWM6LDCON PWM6LDCON
extern volatile unsigned char           PWM6LDCON           __at(0xDAF);
#ifndef _LIB_BUILD
asm("PWM6LDCON equ 0DAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM6LDS0               :1;
        unsigned PWM6LDS1               :1;
    };
    struct {
        unsigned PWM6LDS                :2;
        unsigned                        :4;
        unsigned PWM6LDM                :1;
        unsigned PWM6LD                 :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM6LDCONbits_t;
extern volatile PWM6LDCONbits_t PWM6LDCONbits __at(0xDAF);
// bitfield macros
#define _PWM6LDCON_LDS_POSN                                 0x0
#define _PWM6LDCON_LDS_POSITION                             0x0
#define _PWM6LDCON_LDS_SIZE                                 0x2
#define _PWM6LDCON_LDS_LENGTH                               0x2
#define _PWM6LDCON_LDS_MASK                                 0x3
#define _PWM6LDCON_LDT_POSN                                 0x6
#define _PWM6LDCON_LDT_POSITION                             0x6
#define _PWM6LDCON_LDT_SIZE                                 0x1
#define _PWM6LDCON_LDT_LENGTH                               0x1
#define _PWM6LDCON_LDT_MASK                                 0x40
#define _PWM6LDCON_LDA_POSN                                 0x7
#define _PWM6LDCON_LDA_POSITION                             0x7
#define _PWM6LDCON_LDA_SIZE                                 0x1
#define _PWM6LDCON_LDA_LENGTH                               0x1
#define _PWM6LDCON_LDA_MASK                                 0x80
#define _PWM6LDCON_PWM6LDS0_POSN                            0x0
#define _PWM6LDCON_PWM6LDS0_POSITION                        0x0
#define _PWM6LDCON_PWM6LDS0_SIZE                            0x1
#define _PWM6LDCON_PWM6LDS0_LENGTH                          0x1
#define _PWM6LDCON_PWM6LDS0_MASK                            0x1
#define _PWM6LDCON_PWM6LDS1_POSN                            0x1
#define _PWM6LDCON_PWM6LDS1_POSITION                        0x1
#define _PWM6LDCON_PWM6LDS1_SIZE                            0x1
#define _PWM6LDCON_PWM6LDS1_LENGTH                          0x1
#define _PWM6LDCON_PWM6LDS1_MASK                            0x2
#define _PWM6LDCON_PWM6LDS_POSN                             0x0
#define _PWM6LDCON_PWM6LDS_POSITION                         0x0
#define _PWM6LDCON_PWM6LDS_SIZE                             0x2
#define _PWM6LDCON_PWM6LDS_LENGTH                           0x2
#define _PWM6LDCON_PWM6LDS_MASK                             0x3
#define _PWM6LDCON_PWM6LDM_POSN                             0x6
#define _PWM6LDCON_PWM6LDM_POSITION                         0x6
#define _PWM6LDCON_PWM6LDM_SIZE                             0x1
#define _PWM6LDCON_PWM6LDM_LENGTH                           0x1
#define _PWM6LDCON_PWM6LDM_MASK                             0x40
#define _PWM6LDCON_PWM6LD_POSN                              0x7
#define _PWM6LDCON_PWM6LD_POSITION                          0x7
#define _PWM6LDCON_PWM6LD_SIZE                              0x1
#define _PWM6LDCON_PWM6LD_LENGTH                            0x1
#define _PWM6LDCON_PWM6LD_MASK                              0x80
#define _PWM6LDCON_LDS0_POSN                                0x0
#define _PWM6LDCON_LDS0_POSITION                            0x0
#define _PWM6LDCON_LDS0_SIZE                                0x1
#define _PWM6LDCON_LDS0_LENGTH                              0x1
#define _PWM6LDCON_LDS0_MASK                                0x1
#define _PWM6LDCON_LDS1_POSN                                0x1
#define _PWM6LDCON_LDS1_POSITION                            0x1
#define _PWM6LDCON_LDS1_SIZE                                0x1
#define _PWM6LDCON_LDS1_LENGTH                              0x1
#define _PWM6LDCON_LDS1_MASK                                0x2

// Register: PWM6OFCON
#define PWM6OFCON PWM6OFCON
extern volatile unsigned char           PWM6OFCON           __at(0xDB0);
#ifndef _LIB_BUILD
asm("PWM6OFCON equ 0DB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM6OFS0               :1;
        unsigned PWM6OFS1               :1;
        unsigned                        :3;
        unsigned PWM6OFM0               :1;
        unsigned PWM6OFM1               :1;
    };
    struct {
        unsigned PWM6OFS                :2;
        unsigned                        :2;
        unsigned PWM6OFMC               :1;
        unsigned PWM6OFM                :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM6OFCONbits_t;
extern volatile PWM6OFCONbits_t PWM6OFCONbits __at(0xDB0);
// bitfield macros
#define _PWM6OFCON_OFS_POSN                                 0x0
#define _PWM6OFCON_OFS_POSITION                             0x0
#define _PWM6OFCON_OFS_SIZE                                 0x2
#define _PWM6OFCON_OFS_LENGTH                               0x2
#define _PWM6OFCON_OFS_MASK                                 0x3
#define _PWM6OFCON_OFO_POSN                                 0x4
#define _PWM6OFCON_OFO_POSITION                             0x4
#define _PWM6OFCON_OFO_SIZE                                 0x1
#define _PWM6OFCON_OFO_LENGTH                               0x1
#define _PWM6OFCON_OFO_MASK                                 0x10
#define _PWM6OFCON_OFM_POSN                                 0x5
#define _PWM6OFCON_OFM_POSITION                             0x5
#define _PWM6OFCON_OFM_SIZE                                 0x2
#define _PWM6OFCON_OFM_LENGTH                               0x2
#define _PWM6OFCON_OFM_MASK                                 0x60
#define _PWM6OFCON_PWM6OFS0_POSN                            0x0
#define _PWM6OFCON_PWM6OFS0_POSITION                        0x0
#define _PWM6OFCON_PWM6OFS0_SIZE                            0x1
#define _PWM6OFCON_PWM6OFS0_LENGTH                          0x1
#define _PWM6OFCON_PWM6OFS0_MASK                            0x1
#define _PWM6OFCON_PWM6OFS1_POSN                            0x1
#define _PWM6OFCON_PWM6OFS1_POSITION                        0x1
#define _PWM6OFCON_PWM6OFS1_SIZE                            0x1
#define _PWM6OFCON_PWM6OFS1_LENGTH                          0x1
#define _PWM6OFCON_PWM6OFS1_MASK                            0x2
#define _PWM6OFCON_PWM6OFM0_POSN                            0x5
#define _PWM6OFCON_PWM6OFM0_POSITION                        0x5
#define _PWM6OFCON_PWM6OFM0_SIZE                            0x1
#define _PWM6OFCON_PWM6OFM0_LENGTH                          0x1
#define _PWM6OFCON_PWM6OFM0_MASK                            0x20
#define _PWM6OFCON_PWM6OFM1_POSN                            0x6
#define _PWM6OFCON_PWM6OFM1_POSITION                        0x6
#define _PWM6OFCON_PWM6OFM1_SIZE                            0x1
#define _PWM6OFCON_PWM6OFM1_LENGTH                          0x1
#define _PWM6OFCON_PWM6OFM1_MASK                            0x40
#define _PWM6OFCON_PWM6OFS_POSN                             0x0
#define _PWM6OFCON_PWM6OFS_POSITION                         0x0
#define _PWM6OFCON_PWM6OFS_SIZE                             0x2
#define _PWM6OFCON_PWM6OFS_LENGTH                           0x2
#define _PWM6OFCON_PWM6OFS_MASK                             0x3
#define _PWM6OFCON_PWM6OFMC_POSN                            0x4
#define _PWM6OFCON_PWM6OFMC_POSITION                        0x4
#define _PWM6OFCON_PWM6OFMC_SIZE                            0x1
#define _PWM6OFCON_PWM6OFMC_LENGTH                          0x1
#define _PWM6OFCON_PWM6OFMC_MASK                            0x10
#define _PWM6OFCON_PWM6OFM_POSN                             0x5
#define _PWM6OFCON_PWM6OFM_POSITION                         0x5
#define _PWM6OFCON_PWM6OFM_SIZE                             0x2
#define _PWM6OFCON_PWM6OFM_LENGTH                           0x2
#define _PWM6OFCON_PWM6OFM_MASK                             0x60
#define _PWM6OFCON_OFS0_POSN                                0x0
#define _PWM6OFCON_OFS0_POSITION                            0x0
#define _PWM6OFCON_OFS0_SIZE                                0x1
#define _PWM6OFCON_OFS0_LENGTH                              0x1
#define _PWM6OFCON_OFS0_MASK                                0x1
#define _PWM6OFCON_OFS1_POSN                                0x1
#define _PWM6OFCON_OFS1_POSITION                            0x1
#define _PWM6OFCON_OFS1_SIZE                                0x1
#define _PWM6OFCON_OFS1_LENGTH                              0x1
#define _PWM6OFCON_OFS1_MASK                                0x2
#define _PWM6OFCON_OFM0_POSN                                0x5
#define _PWM6OFCON_OFM0_POSITION                            0x5
#define _PWM6OFCON_OFM0_SIZE                                0x1
#define _PWM6OFCON_OFM0_LENGTH                              0x1
#define _PWM6OFCON_OFM0_MASK                                0x20
#define _PWM6OFCON_OFM1_POSN                                0x6
#define _PWM6OFCON_OFM1_POSITION                            0x6
#define _PWM6OFCON_OFM1_SIZE                                0x1
#define _PWM6OFCON_OFM1_LENGTH                              0x1
#define _PWM6OFCON_OFM1_MASK                                0x40

// Register: PWM11PH
#define PWM11PH PWM11PH
extern volatile unsigned short          PWM11PH             __at(0xDB1);
#ifndef _LIB_BUILD
asm("PWM11PH equ 0DB1h");
#endif

// Register: PWM11PHL
#define PWM11PHL PWM11PHL
extern volatile unsigned char           PWM11PHL            __at(0xDB1);
#ifndef _LIB_BUILD
asm("PWM11PHL equ 0DB1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PH                     :8;
    };
    struct {
        unsigned PWM11PHL0              :1;
        unsigned PWM11PHL1              :1;
        unsigned PWM11PHL2              :1;
        unsigned PWM11PHL3              :1;
        unsigned PWM11PHL4              :1;
        unsigned PWM11PHL5              :1;
        unsigned PWM11PHL6              :1;
        unsigned PWM11PHL7              :1;
    };
    struct {
        unsigned PWM11PHL               :8;
    };
} PWM11PHLbits_t;
