MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// Register: PWM12DCL
#define PWM12DCL PWM12DCL
extern volatile unsigned char           PWM12DCL            __at(0xDC3);
#ifndef _LIB_BUILD
asm("PWM12DCL equ 0DC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM12DCL0              :1;
        unsigned PWM12DCL1              :1;
        unsigned PWM12DCL2              :1;
        unsigned PWM12DCL3              :1;
        unsigned PWM12DCL4              :1;
        unsigned PWM12DCL5              :1;
        unsigned PWM12DCL6              :1;
        unsigned PWM12DCL7              :1;
    };
    struct {
        unsigned PWM12DCL               :8;
    };
} PWM12DCLbits_t;
extern volatile PWM12DCLbits_t PWM12DCLbits __at(0xDC3);
// bitfield macros
#define _PWM12DCL_DC_POSN                                   0x0
#define _PWM12DCL_DC_POSITION                               0x0
#define _PWM12DCL_DC_SIZE                                   0x8
#define _PWM12DCL_DC_LENGTH                                 0x8
#define _PWM12DCL_DC_MASK                                   0xFF
#define _PWM12DCL_PWM12DCL0_POSN                            0x0
#define _PWM12DCL_PWM12DCL0_POSITION                        0x0
#define _PWM12DCL_PWM12DCL0_SIZE                            0x1
#define _PWM12DCL_PWM12DCL0_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL0_MASK                            0x1
#define _PWM12DCL_PWM12DCL1_POSN                            0x1
#define _PWM12DCL_PWM12DCL1_POSITION                        0x1
#define _PWM12DCL_PWM12DCL1_SIZE                            0x1
#define _PWM12DCL_PWM12DCL1_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL1_MASK                            0x2
#define _PWM12DCL_PWM12DCL2_POSN                            0x2
#define _PWM12DCL_PWM12DCL2_POSITION                        0x2
#define _PWM12DCL_PWM12DCL2_SIZE                            0x1
#define _PWM12DCL_PWM12DCL2_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL2_MASK                            0x4
#define _PWM12DCL_PWM12DCL3_POSN                            0x3
#define _PWM12DCL_PWM12DCL3_POSITION                        0x3
#define _PWM12DCL_PWM12DCL3_SIZE                            0x1
#define _PWM12DCL_PWM12DCL3_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL3_MASK                            0x8
#define _PWM12DCL_PWM12DCL4_POSN                            0x4
#define _PWM12DCL_PWM12DCL4_POSITION                        0x4
#define _PWM12DCL_PWM12DCL4_SIZE                            0x1
#define _PWM12DCL_PWM12DCL4_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL4_MASK                            0x10
#define _PWM12DCL_PWM12DCL5_POSN                            0x5
#define _PWM12DCL_PWM12DCL5_POSITION                        0x5
#define _PWM12DCL_PWM12DCL5_SIZE                            0x1
#define _PWM12DCL_PWM12DCL5_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL5_MASK                            0x20
#define _PWM12DCL_PWM12DCL6_POSN                            0x6
#define _PWM12DCL_PWM12DCL6_POSITION                        0x6
#define _PWM12DCL_PWM12DCL6_SIZE                            0x1
#define _PWM12DCL_PWM12DCL6_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL6_MASK                            0x40
#define _PWM12DCL_PWM12DCL7_POSN                            0x7
#define _PWM12DCL_PWM12DCL7_POSITION                        0x7
#define _PWM12DCL_PWM12DCL7_SIZE                            0x1
#define _PWM12DCL_PWM12DCL7_LENGTH                          0x1
#define _PWM12DCL_PWM12DCL7_MASK                            0x80
#define _PWM12DCL_PWM12DCL_POSN                             0x0
#define _PWM12DCL_PWM12DCL_POSITION                         0x0
#define _PWM12DCL_PWM12DCL_SIZE                             0x8
#define _PWM12DCL_PWM12DCL_LENGTH                           0x8
#define _PWM12DCL_PWM12DCL_MASK                             0xFF

// Register: PWM12DCH
#define PWM12DCH PWM12DCH
extern volatile unsigned char           PWM12DCH            __at(0xDC4);
#ifndef _LIB_BUILD
asm("PWM12DCH equ 0DC4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM12DCH0              :1;
        unsigned PWM12DCH1              :1;
        unsigned PWM12DCH2              :1;
        unsigned PWM12DCH3              :1;
        unsigned PWM12DCH4              :1;
        unsigned PWM12DCH5              :1;
        unsigned PWM12DCH6              :1;
        unsigned PWM12DCH7              :1;
    };
    struct {
        unsigned PWM12DCH               :8;
    };
} PWM12DCHbits_t;
extern volatile PWM12DCHbits_t PWM12DCHbits __at(0xDC4);
// bitfield macros
#define _PWM12DCH_DC_POSN                                   0x0
#define _PWM12DCH_DC_POSITION                               0x0
#define _PWM12DCH_DC_SIZE                                   0x8
#define _PWM12DCH_DC_LENGTH                                 0x8
#define _PWM12DCH_DC_MASK                                   0xFF
#define _PWM12DCH_PWM12DCH0_POSN                            0x0
#define _PWM12DCH_PWM12DCH0_POSITION                        0x0
#define _PWM12DCH_PWM12DCH0_SIZE                            0x1
#define _PWM12DCH_PWM12DCH0_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH0_MASK                            0x1
#define _PWM12DCH_PWM12DCH1_POSN                            0x1
#define _PWM12DCH_PWM12DCH1_POSITION                        0x1
#define _PWM12DCH_PWM12DCH1_SIZE                            0x1
#define _PWM12DCH_PWM12DCH1_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH1_MASK                            0x2
#define _PWM12DCH_PWM12DCH2_POSN                            0x2
#define _PWM12DCH_PWM12DCH2_POSITION                        0x2
#define _PWM12DCH_PWM12DCH2_SIZE                            0x1
#define _PWM12DCH_PWM12DCH2_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH2_MASK                            0x4
#define _PWM12DCH_PWM12DCH3_POSN                            0x3
#define _PWM12DCH_PWM12DCH3_POSITION                        0x3
#define _PWM12DCH_PWM12DCH3_SIZE                            0x1
#define _PWM12DCH_PWM12DCH3_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH3_MASK                            0x8
#define _PWM12DCH_PWM12DCH4_POSN                            0x4
#define _PWM12DCH_PWM12DCH4_POSITION                        0x4
#define _PWM12DCH_PWM12DCH4_SIZE                            0x1
#define _PWM12DCH_PWM12DCH4_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH4_MASK                            0x10
#define _PWM12DCH_PWM12DCH5_POSN                            0x5
#define _PWM12DCH_PWM12DCH5_POSITION                        0x5
#define _PWM12DCH_PWM12DCH5_SIZE                            0x1
#define _PWM12DCH_PWM12DCH5_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH5_MASK                            0x20
#define _PWM12DCH_PWM12DCH6_POSN                            0x6
#define _PWM12DCH_PWM12DCH6_POSITION                        0x6
#define _PWM12DCH_PWM12DCH6_SIZE                            0x1
#define _PWM12DCH_PWM12DCH6_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH6_MASK                            0x40
#define _PWM12DCH_PWM12DCH7_POSN                            0x7
#define _PWM12DCH_PWM12DCH7_POSITION                        0x7
#define _PWM12DCH_PWM12DCH7_SIZE                            0x1
#define _PWM12DCH_PWM12DCH7_LENGTH                          0x1
#define _PWM12DCH_PWM12DCH7_MASK                            0x80
#define _PWM12DCH_PWM12DCH_POSN                             0x0
#define _PWM12DCH_PWM12DCH_POSITION                         0x0
#define _PWM12DCH_PWM12DCH_SIZE                             0x8
#define _PWM12DCH_PWM12DCH_LENGTH                           0x8
#define _PWM12DCH_PWM12DCH_MASK                             0xFF

