MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// Register: PWM12LDCON
#define PWM12LDCON PWM12LDCON
extern volatile unsigned char           PWM12LDCON          __at(0xDCF);
#ifndef _LIB_BUILD
asm("PWM12LDCON equ 0DCFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :2;
        unsigned                        :4;
        unsigned LDT                    :1;
        unsigned LDA                    :1;
    };
    struct {
        unsigned PWM12LDS0              :1;
        unsigned PWM12LDS1              :1;
    };
    struct {
        unsigned PWM12LDS               :2;
        unsigned                        :4;
        unsigned PWM12LDM               :1;
        unsigned PWM12LD                :1;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
    };
} PWM12LDCONbits_t;
extern volatile PWM12LDCONbits_t PWM12LDCONbits __at(0xDCF);
// bitfield macros
#define _PWM12LDCON_LDS_POSN                                0x0
#define _PWM12LDCON_LDS_POSITION                            0x0
#define _PWM12LDCON_LDS_SIZE                                0x2
#define _PWM12LDCON_LDS_LENGTH                              0x2
#define _PWM12LDCON_LDS_MASK                                0x3
#define _PWM12LDCON_LDT_POSN                                0x6
#define _PWM12LDCON_LDT_POSITION                            0x6
#define _PWM12LDCON_LDT_SIZE                                0x1
#define _PWM12LDCON_LDT_LENGTH                              0x1
#define _PWM12LDCON_LDT_MASK                                0x40
#define _PWM12LDCON_LDA_POSN                                0x7
#define _PWM12LDCON_LDA_POSITION                            0x7
#define _PWM12LDCON_LDA_SIZE                                0x1
#define _PWM12LDCON_LDA_LENGTH                              0x1
#define _PWM12LDCON_LDA_MASK                                0x80
#define _PWM12LDCON_PWM12LDS0_POSN                          0x0
#define _PWM12LDCON_PWM12LDS0_POSITION                      0x0
#define _PWM12LDCON_PWM12LDS0_SIZE                          0x1
#define _PWM12LDCON_PWM12LDS0_LENGTH                        0x1
#define _PWM12LDCON_PWM12LDS0_MASK                          0x1
#define _PWM12LDCON_PWM12LDS1_POSN                          0x1
#define _PWM12LDCON_PWM12LDS1_POSITION                      0x1
#define _PWM12LDCON_PWM12LDS1_SIZE                          0x1
#define _PWM12LDCON_PWM12LDS1_LENGTH                        0x1
#define _PWM12LDCON_PWM12LDS1_MASK                          0x2
#define _PWM12LDCON_PWM12LDS_POSN                           0x0
#define _PWM12LDCON_PWM12LDS_POSITION                       0x0
#define _PWM12LDCON_PWM12LDS_SIZE                           0x2
#define _PWM12LDCON_PWM12LDS_LENGTH                         0x2
#define _PWM12LDCON_PWM12LDS_MASK                           0x3
#define _PWM12LDCON_PWM12LDM_POSN                           0x6
#define _PWM12LDCON_PWM12LDM_POSITION                       0x6
#define _PWM12LDCON_PWM12LDM_SIZE                           0x1
#define _PWM12LDCON_PWM12LDM_LENGTH                         0x1
#define _PWM12LDCON_PWM12LDM_MASK                           0x40
#define _PWM12LDCON_PWM12LD_POSN                            0x7
#define _PWM12LDCON_PWM12LD_POSITION                        0x7
#define _PWM12LDCON_PWM12LD_SIZE                            0x1
#define _PWM12LDCON_PWM12LD_LENGTH                          0x1
#define _PWM12LDCON_PWM12LD_MASK                            0x80
#define _PWM12LDCON_LDS0_POSN                               0x0
#define _PWM12LDCON_LDS0_POSITION                           0x0
#define _PWM12LDCON_LDS0_SIZE                               0x1
#define _PWM12LDCON_LDS0_LENGTH                             0x1
#define _PWM12LDCON_LDS0_MASK                               0x1
#define _PWM12LDCON_LDS1_POSN                               0x1
#define _PWM12LDCON_LDS1_POSITION                           0x1
#define _PWM12LDCON_LDS1_SIZE                               0x1
#define _PWM12LDCON_LDS1_LENGTH                             0x1
#define _PWM12LDCON_LDS1_MASK                               0x2

// Register: PWM12OFCON
#define PWM12OFCON PWM12OFCON
extern volatile unsigned char           PWM12OFCON          __at(0xDD0);
#ifndef _LIB_BUILD
asm("PWM12OFCON equ 0DD0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OFS                    :2;
        unsigned                        :2;
        unsigned OFO                    :1;
        unsigned OFM                    :2;
    };
    struct {
        unsigned PWM12OFS0              :1;
        unsigned PWM12OFS1              :1;
        unsigned                        :3;
        unsigned PWM12OFM0              :1;
        unsigned PWM12OFM1              :1;
    };
    struct {
        unsigned PWM12OFS               :2;
        unsigned                        :2;
        unsigned PWM12OFMC              :1;
        unsigned PWM12OFM               :2;
    };
    struct {
        unsigned OFS0                   :1;
        unsigned OFS1                   :1;
        unsigned                        :3;
        unsigned OFM0                   :1;
        unsigned OFM1                   :1;
    };
} PWM12OFCONbits_t;
extern volatile PWM12OFCONbits_t PWM12OFCONbits __at(0xDD0);
// bitfield macros
#define _PWM12OFCON_OFS_POSN                                0x0
#define _PWM12OFCON_OFS_POSITION                            0x0
#define _PWM12OFCON_OFS_SIZE                                0x2
#define _PWM12OFCON_OFS_LENGTH                              0x2
#define _PWM12OFCON_OFS_MASK                                0x3
#define _PWM12OFCON_OFO_POSN                                0x4
#define _PWM12OFCON_OFO_POSITION                            0x4
#define _PWM12OFCON_OFO_SIZE                                0x1
#define _PWM12OFCON_OFO_LENGTH                              0x1
#define _PWM12OFCON_OFO_MASK                                0x10
#define _PWM12OFCON_OFM_POSN                                0x5
#define _PWM12OFCON_OFM_POSITION                            0x5
#define _PWM12OFCON_OFM_SIZE                                0x2
#define _PWM12OFCON_OFM_LENGTH                              0x2
#define _PWM12OFCON_OFM_MASK                                0x60
#define _PWM12OFCON_PWM12OFS0_POSN                          0x0
#define _PWM12OFCON_PWM12OFS0_POSITION                      0x0
#define _PWM12OFCON_PWM12OFS0_SIZE                          0x1
#define _PWM12OFCON_PWM12OFS0_LENGTH                        0x1
#define _PWM12OFCON_PWM12OFS0_MASK                          0x1
#define _PWM12OFCON_PWM12OFS1_POSN                          0x1
#define _PWM12OFCON_PWM12OFS1_POSITION                      0x1
#define _PWM12OFCON_PWM12OFS1_SIZE                          0x1
#define _PWM12OFCON_PWM12OFS1_LENGTH                        0x1
#define _PWM12OFCON_PWM12OFS1_MASK                          0x2
#define _PWM12OFCON_PWM12OFM0_POSN                          0x5
#define _PWM12OFCON_PWM12OFM0_POSITION                      0x5
#define _PWM12OFCON_PWM12OFM0_SIZE                          0x1
#define _PWM12OFCON_PWM12OFM0_LENGTH                        0x1
#define _PWM12OFCON_PWM12OFM0_MASK                          0x20
#define _PWM12OFCON_PWM12OFM1_POSN                          0x6
#define _PWM12OFCON_PWM12OFM1_POSITION                      0x6
#define _PWM12OFCON_PWM12OFM1_SIZE                          0x1
#define _PWM12OFCON_PWM12OFM1_LENGTH                        0x1
#define _PWM12OFCON_PWM12OFM1_MASK                          0x40
#define _PWM12OFCON_PWM12OFS_POSN                           0x0
#define _PWM12OFCON_PWM12OFS_POSITION                       0x0
#define _PWM12OFCON_PWM12OFS_SIZE                           0x2
#define _PWM12OFCON_PWM12OFS_LENGTH                         0x2
#define _PWM12OFCON_PWM12OFS_MASK                           0x3
#define _PWM12OFCON_PWM12OFMC_POSN                          0x4
#define _PWM12OFCON_PWM12OFMC_POSITION                      0x4
#define _PWM12OFCON_PWM12OFMC_SIZE                          0x1
#define _PWM12OFCON_PWM12OFMC_LENGTH                        0x1
#define _PWM12OFCON_PWM12OFMC_MASK                          0x10
#define _PWM12OFCON_PWM12OFM_POSN                           0x5
#define _PWM12OFCON_PWM12OFM_POSITION                       0x5
#define _PWM12OFCON_PWM12OFM_SIZE                           0x2
#define _PWM12OFCON_PWM12OFM_LENGTH                         0x2
#define _PWM12OFCON_PWM12OFM_MASK                           0x60
#define _PWM12OFCON_OFS0_POSN                               0x0
#define _PWM12OFCON_OFS0_POSITION                           0x0
#define _PWM12OFCON_OFS0_SIZE                               0x1
#define _PWM12OFCON_OFS0_LENGTH                             0x1
#define _PWM12OFCON_OFS0_MASK                               0x1
#define _PWM12OFCON_OFS1_POSN                               0x1
#define _PWM12OFCON_OFS1_POSITION                           0x1
#define _PWM12OFCON_OFS1_SIZE                               0x1
#define _PWM12OFCON_OFS1_LENGTH                             0x1
#define _PWM12OFCON_OFS1_MASK                               0x2
#define _PWM12OFCON_OFM0_POSN                               0x5
#define _PWM12OFCON_OFM0_POSITION                           0x5
#define _PWM12OFCON_OFM0_SIZE                               0x1
#define _PWM12OFCON_OFM0_LENGTH                             0x1
#define _PWM12OFCON_OFM0_MASK                               0x20
#define _PWM12OFCON_OFM1_POSN                               0x6
#define _PWM12OFCON_OFM1_POSITION                           0x6
#define _PWM12OFCON_OFM1_SIZE                               0x1
#define _PWM12OFCON_OFM1_LENGTH                             0x1
#define _PWM12OFCON_OFM1_MASK                               0x40

// Register: PPSLOCK
#define PPSLOCK PPSLOCK
extern volatile unsigned char           PPSLOCK             __at(0xE0C);
#ifndef _LIB_BUILD
asm("PPSLOCK equ 0E0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PPSLOCKED              :1;
    };
} PPSLOCKbits_t;
extern volatile PPSLOCKbits_t PPSLOCKbits __at(0xE0C);
// bitfield macros
#define _PPSLOCK_PPSLOCKED_POSN                             0x0
#define _PPSLOCK_PPSLOCKED_POSITION                         0x0
#define _PPSLOCK_PPSLOCKED_SIZE                             0x1
#define _PPSLOCK_PPSLOCKED_LENGTH                           0x1
#define _PPSLOCK_PPSLOCKED_MASK                             0x1

// Register: INTPPS
#define INTPPS INTPPS
extern volatile unsigned char           INTPPS              __at(0xE0D);
#ifndef _LIB_BUILD
asm("INTPPS equ 0E0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTPPS                 :6;
    };
} INTPPSbits_t;
