MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
// MD2CON1<MD2CLPOL>
extern volatile __bit                   MD2CLPOL            __at(0x18E1);	// @ (0x31C * 8 + 1)
#define                                 MD2CLPOL_bit        _BIT_ACCESS(MD2CON1,1)
// MD2CON1<MD2CLSYNC>
extern volatile __bit                   MD2CLSYNC           __at(0x18E0);	// @ (0x31C * 8 + 0)
#define                                 MD2CLSYNC_bit       _BIT_ACCESS(MD2CON1,0)
// MD2CON0<MD2EN>
extern volatile __bit                   MD2EN               __at(0x18DF);	// @ (0x31B * 8 + 7)
#define                                 MD2EN_bit           _BIT_ACCESS(MD2CON0,7)
// MD2SRC<MD2MS0>
extern volatile __bit                   MD2MS0              __at(0x18E8);	// @ (0x31D * 8 + 0)
#define                                 MD2MS0_bit          _BIT_ACCESS(MD2SRC,0)
// MD2SRC<MD2MS1>
extern volatile __bit                   MD2MS1              __at(0x18E9);	// @ (0x31D * 8 + 1)
#define                                 MD2MS1_bit          _BIT_ACCESS(MD2SRC,1)
// MD2SRC<MD2MS2>
extern volatile __bit                   MD2MS2              __at(0x18EA);	// @ (0x31D * 8 + 2)
#define                                 MD2MS2_bit          _BIT_ACCESS(MD2SRC,2)
// MD2SRC<MD2MS3>
extern volatile __bit                   MD2MS3              __at(0x18EB);	// @ (0x31D * 8 + 3)
#define                                 MD2MS3_bit          _BIT_ACCESS(MD2SRC,3)
// MD2SRC<MD2MS4>
extern volatile __bit                   MD2MS4              __at(0x18EC);	// @ (0x31D * 8 + 4)
#define                                 MD2MS4_bit          _BIT_ACCESS(MD2SRC,4)
// MD2CON0<MD2OPOL>
extern volatile __bit                   MD2OPOL             __at(0x18DC);	// @ (0x31B * 8 + 4)
#define                                 MD2OPOL_bit         _BIT_ACCESS(MD2CON0,4)
// MD2CON0<MD2OUT>
extern volatile __bit                   MD2OUT              __at(0x18DD);	// @ (0x31B * 8 + 5)
#define                                 MD2OUT_bit          _BIT_ACCESS(MD2CON0,5)
// MD3CON0<MD3BIT>
extern volatile __bit                   MD3BIT              __at(0x10D8);	// @ (0x21B * 8 + 0)
#define                                 MD3BIT_bit          _BIT_ACCESS(MD3CON0,0)
// MD3CARH<MD3CH0>
extern volatile __bit                   MD3CH0              __at(0x10F8);	// @ (0x21F * 8 + 0)
#define                                 MD3CH0_bit          _BIT_ACCESS(MD3CARH,0)
// MD3CARH<MD3CH1>
extern volatile __bit                   MD3CH1              __at(0x10F9);	// @ (0x21F * 8 + 1)
#define                                 MD3CH1_bit          _BIT_ACCESS(MD3CARH,1)
// MD3CARH<MD3CH2>
extern volatile __bit                   MD3CH2              __at(0x10FA);	// @ (0x21F * 8 + 2)
#define                                 MD3CH2_bit          _BIT_ACCESS(MD3CARH,2)
// MD3CARH<MD3CH3>
extern volatile __bit                   MD3CH3              __at(0x10FB);	// @ (0x21F * 8 + 3)
#define                                 MD3CH3_bit          _BIT_ACCESS(MD3CARH,3)
// MD3CARH<MD3CH4>
extern volatile __bit                   MD3CH4              __at(0x10FC);	// @ (0x21F * 8 + 4)
#define                                 MD3CH4_bit          _BIT_ACCESS(MD3CARH,4)
// MD3CON1<MD3CHPOL>
extern volatile __bit                   MD3CHPOL            __at(0x10E5);	// @ (0x21C * 8 + 5)
#define                                 MD3CHPOL_bit        _BIT_ACCESS(MD3CON1,5)
// MD3CON1<MD3CHSYNC>
extern volatile __bit                   MD3CHSYNC           __at(0x10E4);	// @ (0x21C * 8 + 4)
#define                                 MD3CHSYNC_bit       _BIT_ACCESS(MD3CON1,4)
// MD3CARL<MD3CL0>
extern volatile __bit                   MD3CL0              __at(0x10F0);	// @ (0x21E * 8 + 0)
#define                                 MD3CL0_bit          _BIT_ACCESS(MD3CARL,0)
// MD3CARL<MD3CL1>
extern volatile __bit                   MD3CL1              __at(0x10F1);	// @ (0x21E * 8 + 1)
#define                                 MD3CL1_bit          _BIT_ACCESS(MD3CARL,1)
// MD3CARL<MD3CL2>
extern volatile __bit                   MD3CL2              __at(0x10F2);	// @ (0x21E * 8 + 2)
#define                                 MD3CL2_bit          _BIT_ACCESS(MD3CARL,2)
// MD3CARL<MD3CL3>
extern volatile __bit                   MD3CL3              __at(0x10F3);	// @ (0x21E * 8 + 3)
#define                                 MD3CL3_bit          _BIT_ACCESS(MD3CARL,3)
// MD3CARL<MD3CL4>
extern volatile __bit                   MD3CL4              __at(0x10F4);	// @ (0x21E * 8 + 4)
#define                                 MD3CL4_bit          _BIT_ACCESS(MD3CARL,4)
// MD3CON1<MD3CLPOL>
extern volatile __bit                   MD3CLPOL            __at(0x10E1);	// @ (0x21C * 8 + 1)
#define                                 MD3CLPOL_bit        _BIT_ACCESS(MD3CON1,1)
// MD3CON1<MD3CLSYNC>
extern volatile __bit                   MD3CLSYNC           __at(0x10E0);	// @ (0x21C * 8 + 0)
#define                                 MD3CLSYNC_bit       _BIT_ACCESS(MD3CON1,0)
// MD3CON0<MD3EN>
extern volatile __bit                   MD3EN               __at(0x10DF);	// @ (0x21B * 8 + 7)
#define                                 MD3EN_bit           _BIT_ACCESS(MD3CON0,7)
// MD3SRC<MD3MS0>
extern volatile __bit                   MD3MS0              __at(0x10E8);	// @ (0x21D * 8 + 0)
#define                                 MD3MS0_bit          _BIT_ACCESS(MD3SRC,0)
// MD3SRC<MD3MS1>
extern volatile __bit                   MD3MS1              __at(0x10E9);	// @ (0x21D * 8 + 1)
#define                                 MD3MS1_bit          _BIT_ACCESS(MD3SRC,1)
// MD3SRC<MD3MS2>
extern volatile __bit                   MD3MS2              __at(0x10EA);	// @ (0x21D * 8 + 2)
#define                                 MD3MS2_bit          _BIT_ACCESS(MD3SRC,2)
// MD3SRC<MD3MS3>
extern volatile __bit                   MD3MS3              __at(0x10EB);	// @ (0x21D * 8 + 3)
#define                                 MD3MS3_bit          _BIT_ACCESS(MD3SRC,3)
// MD3SRC<MD3MS4>
extern volatile __bit                   MD3MS4              __at(0x10EC);	// @ (0x21D * 8 + 4)
#define                                 MD3MS4_bit          _BIT_ACCESS(MD3SRC,4)
// MD3CON0<MD3OPOL>
extern volatile __bit                   MD3OPOL             __at(0x10DC);	// @ (0x21B * 8 + 4)
#define                                 MD3OPOL_bit         _BIT_ACCESS(MD3CON0,4)
// MD3CON0<MD3OUT>
extern volatile __bit                   MD3OUT              __at(0x10DD);	// @ (0x21B * 8 + 5)
#define                                 MD3OUT_bit          _BIT_ACCESS(MD3CON0,5)
// MD4CON0<MD4BIT>
extern volatile __bit                   MD4BIT              __at(0x68D8);	// @ (0xD1B * 8 + 0)
#define                                 MD4BIT_bit          _BIT_ACCESS(MD4CON0,0)
// MD4CARH<MD4CH0>
extern volatile __bit                   MD4CH0              __at(0x68F8);	// @ (0xD1F * 8 + 0)
#define                                 MD4CH0_bit          _BIT_ACCESS(MD4CARH,0)
// MD4CARH<MD4CH1>
extern volatile __bit                   MD4CH1              __at(0x68F9);	// @ (0xD1F * 8 + 1)
#define                                 MD4CH1_bit          _BIT_ACCESS(MD4CARH,1)
// MD4CARH<MD4CH2>
extern volatile __bit                   MD4CH2              __at(0x68FA);	// @ (0xD1F * 8 + 2)
#define                                 MD4CH2_bit          _BIT_ACCESS(MD4CARH,2)
// MD4CARH<MD4CH3>
extern volatile __bit                   MD4CH3              __at(0x68FB);	// @ (0xD1F * 8 + 3)
#define                                 MD4CH3_bit          _BIT_ACCESS(MD4CARH,3)
// MD4CARH<MD4CH4>
extern volatile __bit                   MD4CH4              __at(0x68FC);	// @ (0xD1F * 8 + 4)
#define                                 MD4CH4_bit          _BIT_ACCESS(MD4CARH,4)
// MD4CON1<MD4CHPOL>
extern volatile __bit                   MD4CHPOL            __at(0x68E5);	// @ (0xD1C * 8 + 5)
#define                                 MD4CHPOL_bit        _BIT_ACCESS(MD4CON1,5)
// MD4CON1<MD4CHSYNC>
extern volatile __bit                   MD4CHSYNC           __at(0x68E4);	// @ (0xD1C * 8 + 4)
#define                                 MD4CHSYNC_bit       _BIT_ACCESS(MD4CON1,4)
// MD4CARL<MD4CL0>
extern volatile __bit                   MD4CL0              __at(0x68F0);	// @ (0xD1E * 8 + 0)
#define                                 MD4CL0_bit          _BIT_ACCESS(MD4CARL,0)
// MD4CARL<MD4CL1>
extern volatile __bit                   MD4CL1              __at(0x68F1);	// @ (0xD1E * 8 + 1)
#define                                 MD4CL1_bit          _BIT_ACCESS(MD4CARL,1)
// MD4CARL<MD4CL2>
extern volatile __bit                   MD4CL2              __at(0x68F2);	// @ (0xD1E * 8 + 2)
#define                                 MD4CL2_bit          _BIT_ACCESS(MD4CARL,2)
// MD4CARL<MD4CL3>
extern volatile __bit                   MD4CL3              __at(0x68F3);	// @ (0xD1E * 8 + 3)
#define                                 MD4CL3_bit          _BIT_ACCESS(MD4CARL,3)
// MD4CARL<MD4CL4>
extern volatile __bit                   MD4CL4              __at(0x68F4);	// @ (0xD1E * 8 + 4)
#define                                 MD4CL4_bit          _BIT_ACCESS(MD4CARL,4)
// MD4CON1<MD4CLPOL>
extern volatile __bit                   MD4CLPOL            __at(0x68E1);	// @ (0xD1C * 8 + 1)
#define                                 MD4CLPOL_bit        _BIT_ACCESS(MD4CON1,1)
// MD4CON1<MD4CLSYNC>
extern volatile __bit                   MD4CLSYNC           __at(0x68E0);	// @ (0xD1C * 8 + 0)
#define                                 MD4CLSYNC_bit       _BIT_ACCESS(MD4CON1,0)
// MD4CON0<MD4EN>
extern volatile __bit                   MD4EN               __at(0x68DF);	// @ (0xD1B * 8 + 7)
#define                                 MD4EN_bit           _BIT_ACCESS(MD4CON0,7)
// MD4SRC<MD4MS0>
extern volatile __bit                   MD4MS0              __at(0x68E8);	// @ (0xD1D * 8 + 0)
#define                                 MD4MS0_bit          _BIT_ACCESS(MD4SRC,0)
// MD4SRC<MD4MS1>
extern volatile __bit                   MD4MS1              __at(0x68E9);	// @ (0xD1D * 8 + 1)
#define                                 MD4MS1_bit          _BIT_ACCESS(MD4SRC,1)
// MD4SRC<MD4MS2>
extern volatile __bit                   MD4MS2              __at(0x68EA);	// @ (0xD1D * 8 + 2)
#define                                 MD4MS2_bit          _BIT_ACCESS(MD4SRC,2)
// MD4SRC<MD4MS3>
extern volatile __bit                   MD4MS3              __at(0x68EB);	// @ (0xD1D * 8 + 3)
#define                                 MD4MS3_bit          _BIT_ACCESS(MD4SRC,3)
// MD4SRC<MD4MS4>
extern volatile __bit                   MD4MS4              __at(0x68EC);	// @ (0xD1D * 8 + 4)
#define                                 MD4MS4_bit          _BIT_ACCESS(MD4SRC,4)
// MD4CON0<MD4OPOL>
extern volatile __bit                   MD4OPOL             __at(0x68DC);	// @ (0xD1B * 8 + 4)
#define                                 MD4OPOL_bit         _BIT_ACCESS(MD4CON0,4)
// MD4CON0<MD4OUT>
extern volatile __bit                   MD4OUT              __at(0x68DD);	// @ (0xD1B * 8 + 5)
#define                                 MD4OUT_bit          _BIT_ACCESS(MD4CON0,5)
// OSCSTAT<MFIOFR>
extern volatile __bit                   MFIOFR              __at(0x4E2);	// @ (0x9C * 8 + 2)
#define                                 MFIOFR_bit          _BIT_ACCESS(OSCSTAT,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x787B);	// @ (0xF0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// PWMEN<MPWM11EN>
extern volatile __bit                   MPWM11EN            __at(0x6C72);	// @ (0xD8E * 8 + 2)
#define                                 MPWM11EN_bit        _BIT_ACCESS(PWMEN,2)
// PWMLD<MPWM11LD>
extern volatile __bit                   MPWM11LD            __at(0x6C7A);	// @ (0xD8F * 8 + 2)
#define                                 MPWM11LD_bit        _BIT_ACCESS(PWMLD,2)
// PWMOUT<MPWM11OUT>
extern volatile __bit                   MPWM11OUT           __at(0x6C82);	// @ (0xD90 * 8 + 2)
#define                                 MPWM11OUT_bit       _BIT_ACCESS(PWMOUT,2)
// PWMEN<MPWM12EN>
extern volatile __bit                   MPWM12EN            __at(0x6C73);	// @ (0xD8E * 8 + 3)
#define                                 MPWM12EN_bit        _BIT_ACCESS(PWMEN,3)
// PWMLD<MPWM12LD>
extern volatile __bit                   MPWM12LD            __at(0x6C7B);	// @ (0xD8F * 8 + 3)
#define                                 MPWM12LD_bit        _BIT_ACCESS(PWMLD,3)
// PWMOUT<MPWM12OUT>
extern volatile __bit                   MPWM12OUT           __at(0x6C83);	// @ (0xD90 * 8 + 3)
#define                                 MPWM12OUT_bit       _BIT_ACCESS(PWMOUT,3)
// PWMEN<MPWM5EN>
extern volatile __bit                   MPWM5EN             __at(0x6C70);	// @ (0xD8E * 8 + 0)
#define                                 MPWM5EN_bit         _BIT_ACCESS(PWMEN,0)
// PWMLD<MPWM5LD>
extern volatile __bit                   MPWM5LD             __at(0x6C78);	// @ (0xD8F * 8 + 0)
#define                                 MPWM5LD_bit         _BIT_ACCESS(PWMLD,0)
// PWMOUT<MPWM5OUT>
extern volatile __bit                   MPWM5OUT            __at(0x6C80);	// @ (0xD90 * 8 + 0)
#define                                 MPWM5OUT_bit        _BIT_ACCESS(PWMOUT,0)
// PWMEN<MPWM6EN>
extern volatile __bit                   MPWM6EN             __at(0x6C71);	// @ (0xD8E * 8 + 1)
#define                                 MPWM6EN_bit         _BIT_ACCESS(PWMEN,1)
// PWMLD<MPWM6LD>
extern volatile __bit                   MPWM6LD             __at(0x6C79);	// @ (0xD8F * 8 + 1)
#define                                 MPWM6LD_bit         _BIT_ACCESS(PWMLD,1)
// PWMOUT<MPWM6OUT>
extern volatile __bit                   MPWM6OUT            __at(0x6C81);	// @ (0xD90 * 8 + 1)
#define                                 MPWM6OUT_bit        _BIT_ACCESS(PWMOUT,1)
// SSP1MSK<MSK0>
extern volatile __bit                   MSK0                __at(0x1098);	// @ (0x213 * 8 + 0)
#define                                 MSK0_bit            _BIT_ACCESS(SSP1MSK,0)
// SSP1MSK<MSK1>
extern volatile __bit                   MSK1                __at(0x1099);	// @ (0x213 * 8 + 1)
#define                                 MSK1_bit            _BIT_ACCESS(SSP1MSK,1)
// SSP1MSK<MSK2>
extern volatile __bit                   MSK2                __at(0x109A);	// @ (0x213 * 8 + 2)
#define                                 MSK2_bit            _BIT_ACCESS(SSP1MSK,2)
// SSP1MSK<MSK3>
extern volatile __bit                   MSK3                __at(0x109B);	// @ (0x213 * 8 + 3)
#define                                 MSK3_bit            _BIT_ACCESS(SSP1MSK,3)
// SSP1MSK<MSK4>
extern volatile __bit                   MSK4                __at(0x109C);	// @ (0x213 * 8 + 4)
#define                                 MSK4_bit            _BIT_ACCESS(SSP1MSK,4)
// SSP1MSK<MSK5>
extern volatile __bit                   MSK5                __at(0x109D);	// @ (0x213 * 8 + 5)
#define                                 MSK5_bit            _BIT_ACCESS(SSP1MSK,5)
// SSP1MSK<MSK6>
extern volatile __bit                   MSK6                __at(0x109E);	// @ (0x213 * 8 + 6)
#define                                 MSK6_bit            _BIT_ACCESS(SSP1MSK,6)
// SSP1MSK<MSK7>
extern volatile __bit                   MSK7                __at(0x109F);	// @ (0x213 * 8 + 7)
#define                                 MSK7_bit            _BIT_ACCESS(SSP1MSK,7)
// ODCONA<ODA0>
extern volatile __bit                   ODA0                __at(0x1460);	// @ (0x28C * 8 + 0)
#define                                 ODA0_bit            _BIT_ACCESS(ODCONA,0)
// ODCONA<ODA1>
extern volatile __bit                   ODA1                __at(0x1461);	// @ (0x28C * 8 + 1)
#define                                 ODA1_bit            _BIT_ACCESS(ODCONA,1)
// ODCONA<ODA2>
extern volatile __bit                   ODA2                __at(0x1462);	// @ (0x28C * 8 + 2)
#define                                 ODA2_bit            _BIT_ACCESS(ODCONA,2)
// ODCONA<ODA3>
extern volatile __bit                   ODA3                __at(0x1463);	// @ (0x28C * 8 + 3)
#define                                 ODA3_bit            _BIT_ACCESS(ODCONA,3)
// ODCONA<ODA4>
extern volatile __bit                   ODA4                __at(0x1464);	// @ (0x28C * 8 + 4)
#define                                 ODA4_bit            _BIT_ACCESS(ODCONA,4)
// ODCONA<ODA5>
extern volatile __bit                   ODA5                __at(0x1465);	// @ (0x28C * 8 + 5)
#define                                 ODA5_bit            _BIT_ACCESS(ODCONA,5)
// ODCONA<ODA6>
extern volatile __bit                   ODA6                __at(0x1466);	// @ (0x28C * 8 + 6)
#define                                 ODA6_bit            _BIT_ACCESS(ODCONA,6)
// ODCONA<ODA7>
extern volatile __bit                   ODA7                __at(0x1467);	// @ (0x28C * 8 + 7)
#define                                 ODA7_bit            _BIT_ACCESS(ODCONA,7)
// ODCONB<ODB0>
extern volatile __bit                   ODB0                __at(0x1468);	// @ (0x28D * 8 + 0)
#define                                 ODB0_bit            _BIT_ACCESS(ODCONB,0)
// ODCONB<ODB1>
extern volatile __bit                   ODB1                __at(0x1469);	// @ (0x28D * 8 + 1)
#define                                 ODB1_bit            _BIT_ACCESS(ODCONB,1)
// ODCONB<ODB2>
extern volatile __bit                   ODB2                __at(0x146A);	// @ (0x28D * 8 + 2)
#define                                 ODB2_bit            _BIT_ACCESS(ODCONB,2)
// ODCONB<ODB3>
extern volatile __bit                   ODB3                __at(0x146B);	// @ (0x28D * 8 + 3)
#define                                 ODB3_bit            _BIT_ACCESS(ODCONB,3)
// ODCONB<ODB4>
extern volatile __bit                   ODB4                __at(0x146C);	// @ (0x28D * 8 + 4)
#define                                 ODB4_bit            _BIT_ACCESS(ODCONB,4)
// ODCONB<ODB5>
extern volatile __bit                   ODB5                __at(0x146D);	// @ (0x28D * 8 + 5)
#define                                 ODB5_bit            _BIT_ACCESS(ODCONB,5)
// ODCONB<ODB6>
extern volatile __bit                   ODB6                __at(0x146E);	// @ (0x28D * 8 + 6)
#define                                 ODB6_bit            _BIT_ACCESS(ODCONB,6)
// ODCONB<ODB7>
extern volatile __bit                   ODB7                __at(0x146F);	// @ (0x28D * 8 + 7)
#define                                 ODB7_bit            _BIT_ACCESS(ODCONB,7)
// ODCONC<ODC0>
extern volatile __bit                   ODC0                __at(0x1470);	// @ (0x28E * 8 + 0)
#define                                 ODC0_bit            _BIT_ACCESS(ODCONC,0)
// ODCONC<ODC1>
extern volatile __bit                   ODC1                __at(0x1471);	// @ (0x28E * 8 + 1)
#define                                 ODC1_bit            _BIT_ACCESS(ODCONC,1)
// ODCONC<ODC2>
extern volatile __bit                   ODC2                __at(0x1472);	// @ (0x28E * 8 + 2)
#define                                 ODC2_bit            _BIT_ACCESS(ODCONC,2)
// ODCONC<ODC3>
extern volatile __bit                   ODC3                __at(0x1473);	// @ (0x28E * 8 + 3)
#define                                 ODC3_bit            _BIT_ACCESS(ODCONC,3)
// ODCONC<ODC4>
extern volatile __bit                   ODC4                __at(0x1474);	// @ (0x28E * 8 + 4)
#define                                 ODC4_bit            _BIT_ACCESS(ODCONC,4)
// ODCONC<ODC5>
extern volatile __bit                   ODC5                __at(0x1475);	// @ (0x28E * 8 + 5)
#define                                 ODC5_bit            _BIT_ACCESS(ODCONC,5)
// ODCONC<ODC6>
extern volatile __bit                   ODC6                __at(0x1476);	// @ (0x28E * 8 + 6)
#define                                 ODC6_bit            _BIT_ACCESS(ODCONC,6)
// ODCONC<ODC7>
extern volatile __bit                   ODC7                __at(0x1477);	// @ (0x28E * 8 + 7)
#define                                 ODC7_bit            _BIT_ACCESS(ODCONC,7)
// ODCOND<ODD0>
extern volatile __bit                   ODD0                __at(0x1478);	// @ (0x28F * 8 + 0)
#define                                 ODD0_bit            _BIT_ACCESS(ODCOND,0)
// ODCOND<ODD1>
extern volatile __bit                   ODD1                __at(0x1479);	// @ (0x28F * 8 + 1)
#define                                 ODD1_bit            _BIT_ACCESS(ODCOND,1)
// ODCOND<ODD2>
extern volatile __bit                   ODD2                __at(0x147A);	// @ (0x28F * 8 + 2)
#define                                 ODD2_bit            _BIT_ACCESS(ODCOND,2)
// ODCOND<ODD3>
extern volatile __bit                   ODD3                __at(0x147B);	// @ (0x28F * 8 + 3)
#define                                 ODD3_bit            _BIT_ACCESS(ODCOND,3)
// ODCOND<ODD4>
extern volatile __bit                   ODD4                __at(0x147C);	// @ (0x28F * 8 + 4)
#define                                 ODD4_bit            _BIT_ACCESS(ODCOND,4)
// ODCOND<ODD5>
extern volatile __bit                   ODD5                __at(0x147D);	// @ (0x28F * 8 + 5)
#define                                 ODD5_bit            _BIT_ACCESS(ODCOND,5)
// ODCOND<ODD6>
extern volatile __bit                   ODD6                __at(0x147E);	// @ (0x28F * 8 + 6)
#define                                 ODD6_bit            _BIT_ACCESS(ODCOND,6)
// ODCOND<ODD7>
extern volatile __bit                   ODD7                __at(0x147F);	// @ (0x28F * 8 + 7)
#define                                 ODD7_bit            _BIT_ACCESS(ODCOND,7)
// ODCONE<ODE0>
extern volatile __bit                   ODE0                __at(0x1480);	// @ (0x290 * 8 + 0)
#define                                 ODE0_bit            _BIT_ACCESS(ODCONE,0)
// ODCONE<ODE1>
extern volatile __bit                   ODE1                __at(0x1481);	// @ (0x290 * 8 + 1)
#define                                 ODE1_bit            _BIT_ACCESS(ODCONE,1)
// ODCONE<ODE2>
extern volatile __bit                   ODE2                __at(0x1482);	// @ (0x290 * 8 + 2)
#define                                 ODE2_bit            _BIT_ACCESS(ODCONE,2)
// RC1STA<OERR>
extern volatile __bit                   OERR                __at(0xCE9);	// @ (0x19D * 8 + 1)
#define                                 OERR_bit            _BIT_ACCESS(RC1STA,1)
// OPA1CON<OPA1EN>
extern volatile __bit                   OPA1EN              __at(0x288F);	// @ (0x511 * 8 + 7)
#define                                 OPA1EN_bit          _BIT_ACCESS(OPA1CON,7)
// OPA1CON<OPA1ORM0>
extern volatile __bit                   OPA1ORM0            __at(0x2888);	// @ (0x511 * 8 + 0)
#define                                 OPA1ORM0_bit        _BIT_ACCESS(OPA1CON,0)
// OPA1CON<OPA1ORM1>
extern volatile __bit                   OPA1ORM1            __at(0x2889);	// @ (0x511 * 8 + 1)
#define                                 OPA1ORM1_bit        _BIT_ACCESS(OPA1CON,1)
// OPA1CON<OPA1ORPOL>
extern volatile __bit                   OPA1ORPOL           __at(0x288A);	// @ (0x511 * 8 + 2)
#define                                 OPA1ORPOL_bit       _BIT_ACCESS(OPA1CON,2)
// OPA1CON<OPA1UG>
extern volatile __bit                   OPA1UG              __at(0x288C);	// @ (0x511 * 8 + 4)
#define                                 OPA1UG_bit          _BIT_ACCESS(OPA1CON,4)
// OPA2CON<OPA2EN>
extern volatile __bit                   OPA2EN              __at(0x28AF);	// @ (0x515 * 8 + 7)
#define                                 OPA2EN_bit          _BIT_ACCESS(OPA2CON,7)
// OPA2CON<OPA2ORM0>
extern volatile __bit                   OPA2ORM0            __at(0x28A8);	// @ (0x515 * 8 + 0)
#define                                 OPA2ORM0_bit        _BIT_ACCESS(OPA2CON,0)
// OPA2CON<OPA2ORM1>
extern volatile __bit                   OPA2ORM1            __at(0x28A9);	// @ (0x515 * 8 + 1)
#define                                 OPA2ORM1_bit        _BIT_ACCESS(OPA2CON,1)
// OPA2CON<OPA2ORPOL>
extern volatile __bit                   OPA2ORPOL           __at(0x28AA);	// @ (0x515 * 8 + 2)
