MikroElektronika/core_packages/PIC/XC8/def/PIC16F1779/mcu.h
#define                                 OPA2ORPOL_bit       _BIT_ACCESS(OPA2CON,2)
// OPA2CON<OPA2UG>
extern volatile __bit                   OPA2UG              __at(0x28AC);	// @ (0x515 * 8 + 4)
#define                                 OPA2UG_bit          _BIT_ACCESS(OPA2CON,4)
// OPA3CON<OPA3EN>
extern volatile __bit                   OPA3EN              __at(0x28CF);	// @ (0x519 * 8 + 7)
#define                                 OPA3EN_bit          _BIT_ACCESS(OPA3CON,7)
// OPA3CON<OPA3ORM0>
extern volatile __bit                   OPA3ORM0            __at(0x28C8);	// @ (0x519 * 8 + 0)
#define                                 OPA3ORM0_bit        _BIT_ACCESS(OPA3CON,0)
// OPA3CON<OPA3ORM1>
extern volatile __bit                   OPA3ORM1            __at(0x28C9);	// @ (0x519 * 8 + 1)
#define                                 OPA3ORM1_bit        _BIT_ACCESS(OPA3CON,1)
// OPA3CON<OPA3ORPOL>
extern volatile __bit                   OPA3ORPOL           __at(0x28CA);	// @ (0x519 * 8 + 2)
#define                                 OPA3ORPOL_bit       _BIT_ACCESS(OPA3CON,2)
// OPA3CON<OPA3SP>
extern volatile __bit                   OPA3SP              __at(0x28CE);	// @ (0x519 * 8 + 6)
#define                                 OPA3SP_bit          _BIT_ACCESS(OPA3CON,6)
// OPA3CON<OPA3UG>
extern volatile __bit                   OPA3UG              __at(0x28CC);	// @ (0x519 * 8 + 4)
#define                                 OPA3UG_bit          _BIT_ACCESS(OPA3CON,4)
// OPA4CON<OPA4EN>
extern volatile __bit                   OPA4EN              __at(0x28EF);	// @ (0x51D * 8 + 7)
#define                                 OPA4EN_bit          _BIT_ACCESS(OPA4CON,7)
// OPA4CON<OPA4ORM0>
extern volatile __bit                   OPA4ORM0            __at(0x28E8);	// @ (0x51D * 8 + 0)
#define                                 OPA4ORM0_bit        _BIT_ACCESS(OPA4CON,0)
// OPA4CON<OPA4ORM1>
extern volatile __bit                   OPA4ORM1            __at(0x28E9);	// @ (0x51D * 8 + 1)
#define                                 OPA4ORM1_bit        _BIT_ACCESS(OPA4CON,1)
// OPA4CON<OPA4ORPOL>
extern volatile __bit                   OPA4ORPOL           __at(0x28EA);	// @ (0x51D * 8 + 2)
#define                                 OPA4ORPOL_bit       _BIT_ACCESS(OPA4CON,2)
// OPA4CON<OPA4SP>
extern volatile __bit                   OPA4SP              __at(0x28EE);	// @ (0x51D * 8 + 6)
#define                                 OPA4SP_bit          _BIT_ACCESS(OPA4CON,6)
// OPA4CON<OPA4UG>
extern volatile __bit                   OPA4UG              __at(0x28EC);	// @ (0x51D * 8 + 4)
#define                                 OPA4UG_bit          _BIT_ACCESS(OPA4CON,4)
// PIE2<OSFIE>
extern volatile __bit                   OSFIE               __at(0x497);	// @ (0x92 * 8 + 7)
#define                                 OSFIE_bit           _BIT_ACCESS(PIE2,7)
// PIR2<OSFIF>
extern volatile __bit                   OSFIF               __at(0x97);	// @ (0x12 * 8 + 7)
#define                                 OSFIF_bit           _BIT_ACCESS(PIR2,7)
// OSCSTAT<OSTS>
extern volatile __bit                   OSTS                __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 OSTS_bit            _BIT_ACCESS(OSCSTAT,5)
// CCPTMRS2<P3TSEL0>
extern volatile __bit                   P3TSEL0             __at(0x14F8);	// @ (0x29F * 8 + 0)
#define                                 P3TSEL0_bit         _BIT_ACCESS(CCPTMRS2,0)
// CCPTMRS2<P3TSEL1>
extern volatile __bit                   P3TSEL1             __at(0x14F9);	// @ (0x29F * 8 + 1)
#define                                 P3TSEL1_bit         _BIT_ACCESS(CCPTMRS2,1)
// CCPTMRS2<P4TSEL0>
extern volatile __bit                   P4TSEL0             __at(0x14FA);	// @ (0x29F * 8 + 2)
#define                                 P4TSEL0_bit         _BIT_ACCESS(CCPTMRS2,2)
// CCPTMRS2<P4TSEL1>
extern volatile __bit                   P4TSEL1             __at(0x14FB);	// @ (0x29F * 8 + 3)
#define                                 P4TSEL1_bit         _BIT_ACCESS(CCPTMRS2,3)
// CCPTMRS2<P9TSEL0>
extern volatile __bit                   P9TSEL0             __at(0x14FC);	// @ (0x29F * 8 + 4)
#define                                 P9TSEL0_bit         _BIT_ACCESS(CCPTMRS2,4)
// CCPTMRS2<P9TSEL1>
extern volatile __bit                   P9TSEL1             __at(0x14FD);	// @ (0x29F * 8 + 5)
#define                                 P9TSEL1_bit         _BIT_ACCESS(CCPTMRS2,5)
// SSP1CON3<PCIE>
extern volatile __bit                   PCIE                __at(0x10BE);	// @ (0x217 * 8 + 6)
#define                                 PCIE_bit            _BIT_ACCESS(SSP1CON3,6)
// INTCON<PEIE>
extern volatile __bit                   PEIE                __at(0x5E);	// @ (0xB * 8 + 6)
#define                                 PEIE_bit            _BIT_ACCESS(INTCON,6)
// SSP1CON2<PEN>
extern volatile __bit                   PEN                 __at(0x10B2);	// @ (0x216 * 8 + 2)
#define                                 PEN_bit             _BIT_ACCESS(SSP1CON2,2)
// OSCSTAT<PLLR>
extern volatile __bit                   PLLR                __at(0x4E6);	// @ (0x9C * 8 + 6)
#define                                 PLLR_bit            _BIT_ACCESS(OSCSTAT,6)
// PPSLOCK<PPSLOCKED>
extern volatile __bit                   PPSLOCKED           __at(0x7060);	// @ (0xE0C * 8 + 0)
#define                                 PPSLOCKED_bit       _BIT_ACCESS(PPSLOCK,0)
// OPTION_REG<PSA>
extern volatile __bit                   PSA                 __at(0x4BB);	// @ (0x97 * 8 + 3)
#define                                 PSA_bit             _BIT_ACCESS(OPTION_REG,3)
// PWM10DCL<PWM10DC0>
extern volatile __bit                   PWM10DC0            __at(0x30EE);	// @ (0x61D * 8 + 6)
#define                                 PWM10DC0_bit        _BIT_ACCESS(PWM10DCL,6)
// PWM10DCL<PWM10DC1>
extern volatile __bit                   PWM10DC1            __at(0x30EF);	// @ (0x61D * 8 + 7)
#define                                 PWM10DC1_bit        _BIT_ACCESS(PWM10DCL,7)
// PWM10DCH<PWM10DC2>
extern volatile __bit                   PWM10DC2            __at(0x30F0);	// @ (0x61E * 8 + 0)
#define                                 PWM10DC2_bit        _BIT_ACCESS(PWM10DCH,0)
// PWM10DCH<PWM10DC3>
extern volatile __bit                   PWM10DC3            __at(0x30F1);	// @ (0x61E * 8 + 1)
#define                                 PWM10DC3_bit        _BIT_ACCESS(PWM10DCH,1)
// PWM10DCH<PWM10DC4>
extern volatile __bit                   PWM10DC4            __at(0x30F2);	// @ (0x61E * 8 + 2)
#define                                 PWM10DC4_bit        _BIT_ACCESS(PWM10DCH,2)
// PWM10DCH<PWM10DC5>
extern volatile __bit                   PWM10DC5            __at(0x30F3);	// @ (0x61E * 8 + 3)
#define                                 PWM10DC5_bit        _BIT_ACCESS(PWM10DCH,3)
// PWM10DCH<PWM10DC6>
extern volatile __bit                   PWM10DC6            __at(0x30F4);	// @ (0x61E * 8 + 4)
#define                                 PWM10DC6_bit        _BIT_ACCESS(PWM10DCH,4)
// PWM10DCH<PWM10DC7>
extern volatile __bit                   PWM10DC7            __at(0x30F5);	// @ (0x61E * 8 + 5)
#define                                 PWM10DC7_bit        _BIT_ACCESS(PWM10DCH,5)
// PWM10DCH<PWM10DC8>
extern volatile __bit                   PWM10DC8            __at(0x30F6);	// @ (0x61E * 8 + 6)
#define                                 PWM10DC8_bit        _BIT_ACCESS(PWM10DCH,6)
// PWM10DCH<PWM10DC9>
extern volatile __bit                   PWM10DC9            __at(0x30F7);	// @ (0x61E * 8 + 7)
#define                                 PWM10DC9_bit        _BIT_ACCESS(PWM10DCH,7)
// PWM10CON<PWM10EN>
extern volatile __bit                   PWM10EN             __at(0x30FF);	// @ (0x61F * 8 + 7)
#define                                 PWM10EN_bit         _BIT_ACCESS(PWM10CON,7)
// PWM10CON<PWM10OUT>
extern volatile __bit                   PWM10OUT            __at(0x30FD);	// @ (0x61F * 8 + 5)
#define                                 PWM10OUT_bit        _BIT_ACCESS(PWM10CON,5)
// PWM10CON<PWM10POL>
extern volatile __bit                   PWM10POL            __at(0x30FC);	// @ (0x61F * 8 + 4)
#define                                 PWM10POL_bit        _BIT_ACCESS(PWM10CON,4)
// PWM11CLKCON<PWM11CS0>
extern volatile __bit                   PWM11CS0            __at(0x6DF0);	// @ (0xDBE * 8 + 0)
#define                                 PWM11CS0_bit        _BIT_ACCESS(PWM11CLKCON,0)
// PWM11CLKCON<PWM11CS1>
extern volatile __bit                   PWM11CS1            __at(0x6DF1);	// @ (0xDBE * 8 + 1)
#define                                 PWM11CS1_bit        _BIT_ACCESS(PWM11CLKCON,1)
// PWM11CLKCON<PWM11CS2>
extern volatile __bit                   PWM11CS2            __at(0x6DF2);	// @ (0xDBE * 8 + 2)
#define                                 PWM11CS2_bit        _BIT_ACCESS(PWM11CLKCON,2)
// PWM11DCH<PWM11DCH0>
extern volatile __bit                   PWM11DCH0           __at(0x6DA0);	// @ (0xDB4 * 8 + 0)
#define                                 PWM11DCH0_bit       _BIT_ACCESS(PWM11DCH,0)
// PWM11DCH<PWM11DCH1>
extern volatile __bit                   PWM11DCH1           __at(0x6DA1);	// @ (0xDB4 * 8 + 1)
#define                                 PWM11DCH1_bit       _BIT_ACCESS(PWM11DCH,1)
// PWM11DCH<PWM11DCH2>
extern volatile __bit                   PWM11DCH2           __at(0x6DA2);	// @ (0xDB4 * 8 + 2)
#define                                 PWM11DCH2_bit       _BIT_ACCESS(PWM11DCH,2)
// PWM11DCH<PWM11DCH3>
extern volatile __bit                   PWM11DCH3           __at(0x6DA3);	// @ (0xDB4 * 8 + 3)
#define                                 PWM11DCH3_bit       _BIT_ACCESS(PWM11DCH,3)
// PWM11DCH<PWM11DCH4>
extern volatile __bit                   PWM11DCH4           __at(0x6DA4);	// @ (0xDB4 * 8 + 4)
#define                                 PWM11DCH4_bit       _BIT_ACCESS(PWM11DCH,4)
// PWM11DCH<PWM11DCH5>
extern volatile __bit                   PWM11DCH5           __at(0x6DA5);	// @ (0xDB4 * 8 + 5)
#define                                 PWM11DCH5_bit       _BIT_ACCESS(PWM11DCH,5)
// PWM11DCH<PWM11DCH6>
extern volatile __bit                   PWM11DCH6           __at(0x6DA6);	// @ (0xDB4 * 8 + 6)
#define                                 PWM11DCH6_bit       _BIT_ACCESS(PWM11DCH,6)
// PWM11DCH<PWM11DCH7>
extern volatile __bit                   PWM11DCH7           __at(0x6DA7);	// @ (0xDB4 * 8 + 7)
#define                                 PWM11DCH7_bit       _BIT_ACCESS(PWM11DCH,7)
// PWM11INTE<PWM11DCIE>
extern volatile __bit                   PWM11DCIE           __at(0x6DE1);	// @ (0xDBC * 8 + 1)
#define                                 PWM11DCIE_bit       _BIT_ACCESS(PWM11INTE,1)
// PWM11INTF<PWM11DCIF>
extern volatile __bit                   PWM11DCIF           __at(0x6DE9);	// @ (0xDBD * 8 + 1)
#define                                 PWM11DCIF_bit       _BIT_ACCESS(PWM11INTF,1)
// PWM11DCL<PWM11DCL0>
extern volatile __bit                   PWM11DCL0           __at(0x6D98);	// @ (0xDB3 * 8 + 0)
#define                                 PWM11DCL0_bit       _BIT_ACCESS(PWM11DCL,0)
// PWM11DCL<PWM11DCL1>
extern volatile __bit                   PWM11DCL1           __at(0x6D99);	// @ (0xDB3 * 8 + 1)
#define                                 PWM11DCL1_bit       _BIT_ACCESS(PWM11DCL,1)
// PWM11DCL<PWM11DCL2>
extern volatile __bit                   PWM11DCL2           __at(0x6D9A);	// @ (0xDB3 * 8 + 2)
#define                                 PWM11DCL2_bit       _BIT_ACCESS(PWM11DCL,2)
// PWM11DCL<PWM11DCL3>
extern volatile __bit                   PWM11DCL3           __at(0x6D9B);	// @ (0xDB3 * 8 + 3)
#define                                 PWM11DCL3_bit       _BIT_ACCESS(PWM11DCL,3)
// PWM11DCL<PWM11DCL4>
extern volatile __bit                   PWM11DCL4           __at(0x6D9C);	// @ (0xDB3 * 8 + 4)
#define                                 PWM11DCL4_bit       _BIT_ACCESS(PWM11DCL,4)
// PWM11DCL<PWM11DCL5>
extern volatile __bit                   PWM11DCL5           __at(0x6D9D);	// @ (0xDB3 * 8 + 5)
#define                                 PWM11DCL5_bit       _BIT_ACCESS(PWM11DCL,5)
// PWM11DCL<PWM11DCL6>
extern volatile __bit                   PWM11DCL6           __at(0x6D9E);	// @ (0xDB3 * 8 + 6)
#define                                 PWM11DCL6_bit       _BIT_ACCESS(PWM11DCL,6)
// PWM11DCL<PWM11DCL7>
extern volatile __bit                   PWM11DCL7           __at(0x6D9F);	// @ (0xDB3 * 8 + 7)
#define                                 PWM11DCL7_bit       _BIT_ACCESS(PWM11DCL,7)
// PWM11CON<PWM11EN>
extern volatile __bit                   PWM11EN             __at(0x6DDF);	// @ (0xDBB * 8 + 7)
#define                                 PWM11EN_bit         _BIT_ACCESS(PWM11CON,7)
// PIE6<PWM11IE>
extern volatile __bit                   PWM11IE             __at(0x4B2);	// @ (0x96 * 8 + 2)
#define                                 PWM11IE_bit         _BIT_ACCESS(PIE6,2)
// PIR6<PWM11IF>
extern volatile __bit                   PWM11IF             __at(0xB2);	// @ (0x16 * 8 + 2)
#define                                 PWM11IF_bit         _BIT_ACCESS(PIR6,2)
// PWM11LDCON<PWM11LD>
extern volatile __bit                   PWM11LD             __at(0x6DFF);	// @ (0xDBF * 8 + 7)
#define                                 PWM11LD_bit         _BIT_ACCESS(PWM11LDCON,7)
// PWM11LDCON<PWM11LDM>
extern volatile __bit                   PWM11LDM            __at(0x6DFE);	// @ (0xDBF * 8 + 6)
#define                                 PWM11LDM_bit        _BIT_ACCESS(PWM11LDCON,6)
// PWM11LDCON<PWM11LDS0>
extern volatile __bit                   PWM11LDS0           __at(0x6DF8);	// @ (0xDBF * 8 + 0)
#define                                 PWM11LDS0_bit       _BIT_ACCESS(PWM11LDCON,0)
// PWM11LDCON<PWM11LDS1>
extern volatile __bit                   PWM11LDS1           __at(0x6DF9);	// @ (0xDBF * 8 + 1)
#define                                 PWM11LDS1_bit       _BIT_ACCESS(PWM11LDCON,1)
// PWM11CON<PWM11MODE0>
extern volatile __bit                   PWM11MODE0          __at(0x6DDA);	// @ (0xDBB * 8 + 2)
#define                                 PWM11MODE0_bit      _BIT_ACCESS(PWM11CON,2)
// PWM11CON<PWM11MODE1>
extern volatile __bit                   PWM11MODE1          __at(0x6DDB);	// @ (0xDBB * 8 + 3)
#define                                 PWM11MODE1_bit      _BIT_ACCESS(PWM11CON,3)
// PWM11OFH<PWM11OFH0>
extern volatile __bit                   PWM11OFH0           __at(0x6DC0);	// @ (0xDB8 * 8 + 0)
#define                                 PWM11OFH0_bit       _BIT_ACCESS(PWM11OFH,0)
// PWM11OFH<PWM11OFH1>
extern volatile __bit                   PWM11OFH1           __at(0x6DC1);	// @ (0xDB8 * 8 + 1)
#define                                 PWM11OFH1_bit       _BIT_ACCESS(PWM11OFH,1)
// PWM11OFH<PWM11OFH2>
extern volatile __bit                   PWM11OFH2           __at(0x6DC2);	// @ (0xDB8 * 8 + 2)
#define                                 PWM11OFH2_bit       _BIT_ACCESS(PWM11OFH,2)
// PWM11OFH<PWM11OFH3>
extern volatile __bit                   PWM11OFH3           __at(0x6DC3);	// @ (0xDB8 * 8 + 3)
#define                                 PWM11OFH3_bit       _BIT_ACCESS(PWM11OFH,3)
// PWM11OFH<PWM11OFH4>
extern volatile __bit                   PWM11OFH4           __at(0x6DC4);	// @ (0xDB8 * 8 + 4)
#define                                 PWM11OFH4_bit       _BIT_ACCESS(PWM11OFH,4)
// PWM11OFH<PWM11OFH5>
extern volatile __bit                   PWM11OFH5           __at(0x6DC5);	// @ (0xDB8 * 8 + 5)
#define                                 PWM11OFH5_bit       _BIT_ACCESS(PWM11OFH,5)
// PWM11OFH<PWM11OFH6>
extern volatile __bit                   PWM11OFH6           __at(0x6DC6);	// @ (0xDB8 * 8 + 6)
#define                                 PWM11OFH6_bit       _BIT_ACCESS(PWM11OFH,6)
// PWM11OFH<PWM11OFH7>
extern volatile __bit                   PWM11OFH7           __at(0x6DC7);	// @ (0xDB8 * 8 + 7)
#define                                 PWM11OFH7_bit       _BIT_ACCESS(PWM11OFH,7)
// PWM11INTE<PWM11OFIE>
extern volatile __bit                   PWM11OFIE           __at(0x6DE3);	// @ (0xDBC * 8 + 3)
#define                                 PWM11OFIE_bit       _BIT_ACCESS(PWM11INTE,3)
// PWM11INTF<PWM11OFIF>
extern volatile __bit                   PWM11OFIF           __at(0x6DEB);	// @ (0xDBD * 8 + 3)
#define                                 PWM11OFIF_bit       _BIT_ACCESS(PWM11INTF,3)
// PWM11OFL<PWM11OFL0>
extern volatile __bit                   PWM11OFL0           __at(0x6DB8);	// @ (0xDB7 * 8 + 0)
#define                                 PWM11OFL0_bit       _BIT_ACCESS(PWM11OFL,0)
// PWM11OFL<PWM11OFL1>
extern volatile __bit                   PWM11OFL1           __at(0x6DB9);	// @ (0xDB7 * 8 + 1)
#define                                 PWM11OFL1_bit       _BIT_ACCESS(PWM11OFL,1)
// PWM11OFL<PWM11OFL2>
extern volatile __bit                   PWM11OFL2           __at(0x6DBA);	// @ (0xDB7 * 8 + 2)
#define                                 PWM11OFL2_bit       _BIT_ACCESS(PWM11OFL,2)
// PWM11OFL<PWM11OFL3>
extern volatile __bit                   PWM11OFL3           __at(0x6DBB);	// @ (0xDB7 * 8 + 3)
#define                                 PWM11OFL3_bit       _BIT_ACCESS(PWM11OFL,3)
// PWM11OFL<PWM11OFL4>
extern volatile __bit                   PWM11OFL4           __at(0x6DBC);	// @ (0xDB7 * 8 + 4)
#define                                 PWM11OFL4_bit       _BIT_ACCESS(PWM11OFL,4)
// PWM11OFL<PWM11OFL5>
extern volatile __bit                   PWM11OFL5           __at(0x6DBD);	// @ (0xDB7 * 8 + 5)
#define                                 PWM11OFL5_bit       _BIT_ACCESS(PWM11OFL,5)
// PWM11OFL<PWM11OFL6>
extern volatile __bit                   PWM11OFL6           __at(0x6DBE);	// @ (0xDB7 * 8 + 6)
#define                                 PWM11OFL6_bit       _BIT_ACCESS(PWM11OFL,6)
// PWM11OFL<PWM11OFL7>
extern volatile __bit                   PWM11OFL7           __at(0x6DBF);	// @ (0xDB7 * 8 + 7)
#define                                 PWM11OFL7_bit       _BIT_ACCESS(PWM11OFL,7)
// PWM11OFCON<PWM11OFM0>
extern volatile __bit                   PWM11OFM0           __at(0x6E05);	// @ (0xDC0 * 8 + 5)
#define                                 PWM11OFM0_bit       _BIT_ACCESS(PWM11OFCON,5)
// PWM11OFCON<PWM11OFM1>
extern volatile __bit                   PWM11OFM1           __at(0x6E06);	// @ (0xDC0 * 8 + 6)
#define                                 PWM11OFM1_bit       _BIT_ACCESS(PWM11OFCON,6)
// PWM11OFCON<PWM11OFMC>
extern volatile __bit                   PWM11OFMC           __at(0x6E04);	// @ (0xDC0 * 8 + 4)
#define                                 PWM11OFMC_bit       _BIT_ACCESS(PWM11OFCON,4)
// PWM11OFCON<PWM11OFS0>
extern volatile __bit                   PWM11OFS0           __at(0x6E00);	// @ (0xDC0 * 8 + 0)
#define                                 PWM11OFS0_bit       _BIT_ACCESS(PWM11OFCON,0)
// PWM11OFCON<PWM11OFS1>
extern volatile __bit                   PWM11OFS1           __at(0x6E01);	// @ (0xDC0 * 8 + 1)
#define                                 PWM11OFS1_bit       _BIT_ACCESS(PWM11OFCON,1)
// PWM11CON<PWM11OUT>
extern volatile __bit                   PWM11OUT            __at(0x6DDD);	// @ (0xDBB * 8 + 5)
#define                                 PWM11OUT_bit        _BIT_ACCESS(PWM11CON,5)
// PWM11PHH<PWM11PHH0>
extern volatile __bit                   PWM11PHH0           __at(0x6D90);	// @ (0xDB2 * 8 + 0)
#define                                 PWM11PHH0_bit       _BIT_ACCESS(PWM11PHH,0)
// PWM11PHH<PWM11PHH1>
extern volatile __bit                   PWM11PHH1           __at(0x6D91);	// @ (0xDB2 * 8 + 1)
#define                                 PWM11PHH1_bit       _BIT_ACCESS(PWM11PHH,1)
// PWM11PHH<PWM11PHH2>
extern volatile __bit                   PWM11PHH2           __at(0x6D92);	// @ (0xDB2 * 8 + 2)
#define                                 PWM11PHH2_bit       _BIT_ACCESS(PWM11PHH,2)
// PWM11PHH<PWM11PHH3>
extern volatile __bit                   PWM11PHH3           __at(0x6D93);	// @ (0xDB2 * 8 + 3)
#define                                 PWM11PHH3_bit       _BIT_ACCESS(PWM11PHH,3)
// PWM11PHH<PWM11PHH4>
extern volatile __bit                   PWM11PHH4           __at(0x6D94);	// @ (0xDB2 * 8 + 4)
#define                                 PWM11PHH4_bit       _BIT_ACCESS(PWM11PHH,4)
// PWM11PHH<PWM11PHH5>
extern volatile __bit                   PWM11PHH5           __at(0x6D95);	// @ (0xDB2 * 8 + 5)
#define                                 PWM11PHH5_bit       _BIT_ACCESS(PWM11PHH,5)
// PWM11PHH<PWM11PHH6>
extern volatile __bit                   PWM11PHH6           __at(0x6D96);	// @ (0xDB2 * 8 + 6)
#define                                 PWM11PHH6_bit       _BIT_ACCESS(PWM11PHH,6)
// PWM11PHH<PWM11PHH7>
extern volatile __bit                   PWM11PHH7           __at(0x6D97);	// @ (0xDB2 * 8 + 7)
#define                                 PWM11PHH7_bit       _BIT_ACCESS(PWM11PHH,7)
// PWM11INTE<PWM11PHIE>
extern volatile __bit                   PWM11PHIE           __at(0x6DE2);	// @ (0xDBC * 8 + 2)
#define                                 PWM11PHIE_bit       _BIT_ACCESS(PWM11INTE,2)
// PWM11INTF<PWM11PHIF>
extern volatile __bit                   PWM11PHIF           __at(0x6DEA);	// @ (0xDBD * 8 + 2)
#define                                 PWM11PHIF_bit       _BIT_ACCESS(PWM11INTF,2)
// PWM11PHL<PWM11PHL0>
extern volatile __bit                   PWM11PHL0           __at(0x6D88);	// @ (0xDB1 * 8 + 0)
#define                                 PWM11PHL0_bit       _BIT_ACCESS(PWM11PHL,0)
// PWM11PHL<PWM11PHL1>
extern volatile __bit                   PWM11PHL1           __at(0x6D89);	// @ (0xDB1 * 8 + 1)
#define                                 PWM11PHL1_bit       _BIT_ACCESS(PWM11PHL,1)
// PWM11PHL<PWM11PHL2>
extern volatile __bit                   PWM11PHL2           __at(0x6D8A);	// @ (0xDB1 * 8 + 2)
#define                                 PWM11PHL2_bit       _BIT_ACCESS(PWM11PHL,2)
// PWM11PHL<PWM11PHL3>
extern volatile __bit                   PWM11PHL3           __at(0x6D8B);	// @ (0xDB1 * 8 + 3)
#define                                 PWM11PHL3_bit       _BIT_ACCESS(PWM11PHL,3)
// PWM11PHL<PWM11PHL4>
extern volatile __bit                   PWM11PHL4           __at(0x6D8C);	// @ (0xDB1 * 8 + 4)
#define                                 PWM11PHL4_bit       _BIT_ACCESS(PWM11PHL,4)
// PWM11PHL<PWM11PHL5>
extern volatile __bit                   PWM11PHL5           __at(0x6D8D);	// @ (0xDB1 * 8 + 5)
#define                                 PWM11PHL5_bit       _BIT_ACCESS(PWM11PHL,5)
// PWM11PHL<PWM11PHL6>
extern volatile __bit                   PWM11PHL6           __at(0x6D8E);	// @ (0xDB1 * 8 + 6)
#define                                 PWM11PHL6_bit       _BIT_ACCESS(PWM11PHL,6)
// PWM11PHL<PWM11PHL7>
extern volatile __bit                   PWM11PHL7           __at(0x6D8F);	// @ (0xDB1 * 8 + 7)
#define                                 PWM11PHL7_bit       _BIT_ACCESS(PWM11PHL,7)
// PWM11CON<PWM11POL>
extern volatile __bit                   PWM11POL            __at(0x6DDC);	// @ (0xDBB * 8 + 4)
#define                                 PWM11POL_bit        _BIT_ACCESS(PWM11CON,4)
// PWM11PRH<PWM11PRH0>
extern volatile __bit                   PWM11PRH0           __at(0x6DB0);	// @ (0xDB6 * 8 + 0)
#define                                 PWM11PRH0_bit       _BIT_ACCESS(PWM11PRH,0)
// PWM11PRH<PWM11PRH1>
extern volatile __bit                   PWM11PRH1           __at(0x6DB1);	// @ (0xDB6 * 8 + 1)
#define                                 PWM11PRH1_bit       _BIT_ACCESS(PWM11PRH,1)
// PWM11PRH<PWM11PRH2>
extern volatile __bit                   PWM11PRH2           __at(0x6DB2);	// @ (0xDB6 * 8 + 2)
#define                                 PWM11PRH2_bit       _BIT_ACCESS(PWM11PRH,2)
// PWM11PRH<PWM11PRH3>
extern volatile __bit                   PWM11PRH3           __at(0x6DB3);	// @ (0xDB6 * 8 + 3)
#define                                 PWM11PRH3_bit       _BIT_ACCESS(PWM11PRH,3)
// PWM11PRH<PWM11PRH4>
extern volatile __bit                   PWM11PRH4           __at(0x6DB4);	// @ (0xDB6 * 8 + 4)
#define                                 PWM11PRH4_bit       _BIT_ACCESS(PWM11PRH,4)
